{"review": "We always include Darbar on our restaurant list when in NY.  The food is very good and authentic.  No beef on the menu as would be expected in a true Indian restaurant.  A bit more spicy this time than before but that is not a...", "stars": 4}
{"review": "We've been eating at Darbar for years. Their lunch buffet is all you can eat and tasty with consistent quality. Take out dinner is solid but delivery can take forever to arrive. The chicken tikka masala is tasty and you'll be using your naan to...", "stars": 4}
{"review": "We had seven people for dinner, and had a variety of dishes--shrimp (2), chicken (2), salmon,  goat, and spinach.  Everyone loved their dishes.  I had the shrimp with the house special sauce for the chicken (I think it's called Mali); it was excellent. It is...", "stars": 5}
{"review": "Went here with my wife and had a very nice time. My wife, who never eats much Indian food enjoyed her meal, as did I. Food was very affordable and was generous in portion size. I thought the staff was very helpful and friendly.", "stars": 5}
{"review": "This restaurant is not only costly but also it doesn't have food to live up to that price. Curries were sour and you can make out that most of them had frozen veggies. Dessert Shrikhand was watery. Cutlery was looking unclean. Dal had taste of...", "stars": 2}
{"review": "Excellent, varied menu with relatively reasonable prices; perfect central location in midtown east. Polite & thorough service, too.", "stars": 4}
{"review": "I stumbled across this place in New York the other day on a short overnight. Had a hankering for Indian food and looked at several places before this one. Since there was another Indian food place next door, I figured I would head over and...", "stars": 5}
{"review": "It was Friday night and we had just finished a Broadway show and I was craving some Indian food. I called for take out at 10:15PM - 45 minutes before closing. They said they were closed. I have since read similar reviews. Obviously they are...", "stars": 1}
{"review": "the welcome was warm, we were nicely seated, the waiter was pushing to make the order as soon as possible. The service was very good. The food was excelent we had chicken masala and chicken tandoori with Naan with rosemary and two glaces of wine....", "stars": 5}
{"review": "We were visiting NY and was told about Darbar.  It was absolutely wonderfully delicious.   They had a variety on the buffet- all dishes unique and flavorful.  The perfect amount of spice &’heat’.  The staff was thoughtful and excellent service.  Highly recommend.   We went at lunch...", "stars": 5}
{"review": "Located very close to Grand Central train station, this is truly a great Indian restaurant. The interior decor is traditionally Indian, service is extremely courteous and pricing is reasonable considering the location. The main courses were good spicy catered to Indian taste buds. The appetizers...", "stars": 4}
{"review": "We were here for a group gathering so it was a pre-set menu. The food was tasty and served hot. The customer service was excellent. For a pre-set menu we had a nice variety of foods to select.", "stars": 4}
{"review": "We booked on Open Table for our Christmas lunch and loved it! As a couple consisting of a vegan and carnivore, the buffet lunch was plentiful with great choice for us both. The dhal, brinjal bharjee and spinach were lovely and my husband enjoyed tandoori...", "stars": 5}
{"review": "Total disappointment , soon as we were in they tried to give us the table near the door only to find it gets an icy blast every time the doors opened, we asked to be moved and watched them try to give everyone else that...", "stars": 1}
{"review": "I had two dishes here, a house special appetizer with mung beans and goat bhuna.  The appetizer was amazing and the goat was very good.  The cocktail, Karma, was excellent.  This is a place I will come back to.", "stars": 5}
{"review": "I really enjoyed the buffet for lunch.  Went with a work colleague and it was great setting to eat, relax and chat.  Make sure you get there a little early, it was super full the day we went.  I liked the Naan that they brought...", "stars": 5}
{"review": "You can’t beat the quality of the food and the price for this buffet. Indian food is my favorite and this place wowed me. I sampled everything on the buffet and found it all exceptional. It was incredibly spiced but not overly so for sensitive...", "stars": 5}
{"review": "Great authentic food! Every item was perfectly seasoned and fresh. It had many choices and it was all amazing. Decor very nice. Staff wxceptional!!!", "stars": 5}
{"review": "Being an Indian, I have tried lots of Indian restaurants across the globe. This one may be liked by non-Indians but it definitely lacks the authenticity of an Indian food. I understand that in a city like NY you will have to temper down the...", "stars": 2}
{"review": "Fantastic dinner last night! Everything from the garlic naan to the kalfi(?) was delicious. The lamb biryani was spiced properly with the raita providing a cooling counter. The goat korma was tender. The Indian red wine(Sula) was surprisingly good and the Taj Mahal beer is...", "stars": 5}
{"review": "Nothing special about atmosphere nor service. Large verity of food but again nothing special not to say not tasty about it.", "stars": 3}
{"review": "Came here for dinner on a week night.  Got to say the food here is very good and tasty. The spicy dishes we got were not overly spicy that we couldn’t taste the food.  Staff here were friendly and offered advice as to what dishes...", "stars": 4}
{"review": "Atmosphere and staff were not amazing but the food was pretty good although every dish was extra hot ( some to much to eat ) other than that the food was all good tasted fresh and came out hot.", "stars": 4}
{"review": "This place serves very authentic Indian food. Garlic Naan and Paneer Makhani are my favourite and go-to.", "stars": 5}
{"review": "If your looking for authentic Indian food Darbar is the place to go.  Some of the best Korma and Vindaloo I've eaten.  Additionally the restaurant gets an A rating for cleanliness form the city.", "stars": 5}
{"review": "The naan bread was soft like putty and the goat curry was the opposite - as tough as old boots. I couldn’t cut it, never mind eat it! When I told the waiter he just said sorry but didn’t offer an alternative that I might...", "stars": 1}
{"review": "We had a really great time at Darbar. The restaurant was easy to get find and had a varied menu. The food had great flavours and was perfectly seasoned according to our order. A special mention to the garlic nan-breads which were absolutely top-notch. The...", "stars": 5}
{"review": "I found Darbar by Googling restaurants near our hotel and was very satisfied by it.  Ambiance is classy.  Food is tasty.  Prices aren't astronomical.", "stars": 4}
{"review": "Often hard to find a good Indian restaurant but I came back here as I enjoyed it last time in 2014.\nLots of good choices.\nAlthough gluten free options are available for food they do not serve gluten free beer which is disappointing, and so...", "stars": 4}
{"review": "The food was well made tasty,generous portions and genuine. Service was great. Gluten-free was no problem. Recommended.", "stars": 4}
{"review": "We had dinner here. The food is good and the portions generous. We had the chicken Tika ;lamb rogan Josh ; Aloo gobi , peshwari naan and onion Bajia . They were all very tasty. The service was good and attentive. The Taj Mahal beer...", "stars": 4}
{"review": "Enjoyed the Chicken Tikka Masala and the samosas.  Srvice was slow,  ut the food was very good.  Sat on the balcony overlooking the street in the upper level.", "stars": 5}
{"review": "We went there based on an article in an add in the hotel magazine and really enjoyed it. It is an upscale restaurant, based on price, but casual dress. The food and wait staff were very good and really enjoyed all of the food we...", "stars": 5}
{"review": "Googled a decent Indian in NYC and this little gem came highly rated. We were not disappointed...\nFood, service and value were all Excellent. Truly couldn’t fault it. Would definitely recommend. Didn’t feel like we were on a production line... thoroughly enjoyed every bite.", "stars": 5}
{"review": "We have wonderful Indian food in London where we are from. So we set a very high standard. This restaurant not only met that standard but exceeded it. \n\nVery comfortable to sit and excellent service. The food was exceptional and an added bonus was it...", "stars": 5}
{"review": "Enjoy the food while staff serve with a smile and attention to detail. Great portions. I had the lamb curry and did not leave anything on the plate!", "stars": 5}
{"review": "Typical Indian food with a decent selection for the buffet menu. Their mango lassi was exceptional. Ambience could be better.", "stars": 3}
{"review": "A colleague and I recently went for lunch to Darbar Indian Restaurant on East 46 Street in Manhattan.  We left terribly disappointed and wondering how can this restaurant of hurried, smileless, and unfriendly service, mediocre food quality, and noisy ambience claim laurels it fails to...", "stars": 1}
{"review": "Recently visited Darbar on a trip to New York. Stumbled across it after we rejected another restaurant we had googled but changed our minds when we got outside !! How glad we were we got a fantastic reception from staff they made us feel so...", "stars": 5}
{"review": "We expected a bit more after seeing all of the great reviews.  It's a simple, good Indian spot.  Zero ambiance, fair to mid-level service.  The food is solid - very good Indian, but nothing to write home about.  They did have a great bottle of...", "stars": 3}
{"review": "We ate only vegetarian dishes. Daal makhani was good. Kheer and gulabjamun were good too. But pakoras were very oily.", "stars": 4}
{"review": "I couldnt say anymore, this is one of the tastiest indian food in town!. I ate the chicken, amazing and very juicy with all the spiciness, the cauliflower with szechuan style sauce is excellent as well.", "stars": 5}
{"review": "We were two for dinner in the middle of the week. We ordered tandoori chicken, pureed spinach, samosas, chutney and naan. The samosas are a good size and very flavorful and come with a choices of sauces. The tandoori chicken is 2 good sized pieces...", "stars": 4}
{"review": "Yesterday was Sunday and I booked the buffet lunch for 5. Our 2 guests were American and we thought we would take them out to an Indian meal. We were seated politely, but that was almost it. The food was pretty awful, some of it...", "stars": 2}
{"review": "Whenever we feel lazy to go far for a dinner out we go to this local indian place. Food is always great and we have been coming for years now.  Equally tasty are the lamb and chicken dishes as arr vegetarian options", "stars": 5}
{"review": "Midtown location. Made reservations on OpenTable. This is a neighborhood go to for me. We were seated right away. The pappads come gratis with a tamarind and mint sauce. The main dishes come with rice. We had saag paneer which was really good. The chicken...", "stars": 5}
{"review": "I've ordered Delivery from this place for a couple of years and have generally been well satisfied.  The other night I was walking by after a cocktail party, about 8 p.m., and decided to go in for the first time for a light supper.  It...", "stars": 4}
{"review": "We really enjoyed our meal here - we ate very late as we'd only just arrived in the city but the food tasted as fresh as it would have at the start of the evening.  Popular with locals too.", "stars": 5}
{"review": "Enjoyed an evening here with colleagues. The food was great with good service and reasonable cost. Would definitely come back in future.", "stars": 4}
{"review": "Decided to stop by to give this place a try after walking by and we did not leave disappointed.  We tried the prix fixe meal and it was definitely good value - leaves you full but also satisfied.  The flavours are there and services is...", "stars": 4}
{"review": "Stayed in a nearby hotel and checked Trip Advisor for a place nearby that met our criteria-walking distance, good reviews, and won't break the bank- and check, check, check!\nGreat food at reasonable prices (always a challenge in Manhattan).\nWe had two chicken dishes, one...", "stars": 5}
{"review": "I am not exaggerating when I say that Darbar has wrecked most Indian restaurants for me. Everything, from the Peshawari naan to the kebab appetizer, was a notch above. Their house cocktail, a play on a mango lassi with rum and pineapple, goes down far...", "stars": 5}
{"review": "We were casting about for someplace near Grand Central, and found Darbar.  We had the buffet thing, and everything was quite good, notably the fish curry and the chicken tandoori, and something I've forgotten the name of that involved something very like sweet potatoes.  We...", "stars": 4}
{"review": "Really enjoyed dinner here.  Staff were friendly and attentive, but not in your face.  Food was freshly cooked, authentic and tasty.  The chicken was good quality.  Enjoyed our meal very much. Not overpriced. Will go back again.  Have eaten here before.  The decor downstairs isn't...", "stars": 4}
{"review": "The hotel recommended this place so we decided to try it. It was close within walking distance, 5 blocks from the hotel. We had the goat and lamb vindaloo. The goat was a little tough but the sauce was very good. The cauliflower with potatoes...", "stars": 4}
{"review": "A short walk from the UN. We stepped out of the snowstorm and onto this quaint restaurant. We enjoyed a delicious lunchtime buffet with all that one expects at an Indian buffet.  I particularly liked the Goat Curry.  My son loved the Tiki Masala and...", "stars": 4}
{"review": "I recently stayed at Hotel Lexington and was sent to Darbar for dinner by our concierge. Always a toss up when you get a recommendation from a hotel as they are usually paid to send people to specific places.  Darbar turned out to be a...", "stars": 5}
{"review": "we went on a Sunday. The restaurant offers a good value , all you can eat meal .  It has a a good selection of vegan dishes. we ate the vegan and not vegan dishes. In our opinion the food taste was on the okay...", "stars": 4}
{"review": "Never had Indian before and the couple we were with love it. We decided on Darbar and the server was fabulous. Helped us determine what to get and we all got something different.  It was the best and we will forever and always be a...", "stars": 5}
{"review": "We picked this place as it was close to our hotel on Lexington avenue and we fancied and Indian. We were not disappointed, the food here is really good and it's somewhere I'd definitely recommend eating at.", "stars": 4}
{"review": "I went with my daughter and we have Indian food all the time so we ordered our favorite dishes. They serve very small portions and it's expensive. 2 pieces of chicken tandoori for 17$, the paneer Masala had like 7 pieces drowning in sauce, the...", "stars": 3}
{"review": "The food and atmosphere in the restaurant was excellent. The staff were very friendly and attentive throuought.", "stars": 5}
{"review": "Very good food and price average \nThe indian variety id huge \nThe cook is clean and the service is 👍\nI advise for indean food lovers maybe it is one of the best in Geneva", "stars": 4}
{"review": "Darbar offers an impressive menu of genuine meat and vegetarian Indian-style dishes, with reasonable prices. The freshly made breads, such as roti and naan, are not to miss. The wide array of choices contains a few unexpected choices, such as a stew of goat (and...", "stars": 5}
{"review": "The service was outstanding. The waiter brought us food combinations and tea that were not on the menu. The lamb was tender and not too spicy. A good selection of wines and the happy hour made it possible to enjoy more than one glass. An...", "stars": 4}
{"review": "During lunch time threre's a buffet with a large variety of dishes - the meal costs about 16$ w/o tax. Everything we've tried was delicious, and the service was also very good.", "stars": 5}
{"review": "First off, the service was amazing. The servers are very attentive. We called before to make sure we could walk in since the listing on trip advisor says to reserve a table. It was around 5pm and they allowed us to walk in without a...", "stars": 5}
{"review": "You'd think NYC would be the epicenter of great Indian food, but we've been disappointed a few times . Outside of the Murray Hill area, its hit and miss. This place is an exception though. Attentive service in this small midtown eatery. Good and decently...", "stars": 5}
{"review": "Our daughter loves Indian food and this did not disappoint. We had been there several years ago and it was as good as remembered. Reasonably priced. Good service. Only issue was that the Lamb Bhuna was very spicy though not indicated so on menu --...", "stars": 4}
{"review": "We had a fabulous experience at the Darbar hotel right in the centre of New York city.  The restaurant is tastefully done up, the service is excellent - but the real star is the FOOD!  Real authentic Indian food - subject to none!", "stars": 5}
{"review": "We went for dinner on 28/07. The service was excellent - the food was average. Very very spicy food was served to us first time round and when we spoke to the waiter they replaced it immediately. They even gave us extra roti and Gulab...", "stars": 3}
{"review": "Great lamb chops tandoor and shrimp bouna. Very nice service. Not my favorite indian but above average. Affiliated with the one on 55 but not identical.", "stars": 4}
{"review": "One of the best dinners I have had in an Indian restaurant. Staff very friendly. Since the two guys who were responsible for the home deliveries were very busy all the time we spent in the restaurant there most be many more people who likes...", "stars": 4}
{"review": "What impressed us: Food was delicious-our group of 6 ordered a variety of vegetarian and meat dishes. Service was impeccable. Table setting was elegant. Atmosphere was quiet, so that we could enjoy lively dinner conversation.  Best of all, servings were ample enough that our take-home...", "stars": 5}
{"review": "I love the restaurant with crisp white tablecloth's and this one has it. The food was truly delicious we had a wonderful lobster in spicy red sauce and we also had a very tasty lamb dish. The service was absolutely the best and made our...", "stars": 4}
{"review": "I have had Indian food before many times. This is was not pleasing, not aromatic, not flavorful, not exciting, and not the first bad Indian in NYC.", "stars": 1}
{"review": "We were planning on trying a new Indian restaurant on our trip to NY this year but decided to return to this place as it is very close to our hotel, not disappointed! Very good food. We tried new dishes as well as our favourites....", "stars": 4}
{"review": "Four of us shared 3 dishes, nan and a couple of appetizers.  We had some of the best Indian food I've ever had.   The house specials on the menu had wonderful flavors.  And it's reasonably priced for the quality, ambience, and location.  With taxes, tip,...", "stars": 5}
{"review": "The prices are similar to other Indian restaurants in the area, but it excels with ambience.  The waiter was very engaging about his life and food experience in India and it was a very clean and chic yet simple space.\n\nThe food was really good....", "stars": 4}
{"review": "I just came back from lunch at Darbar. Their big draw is the $15 buffet. I skipped that and ordered the mutton kheema and tandoori roti. What if got was fairly big chunks of meat cooked hastily and poorly and a cold roti. There's a...", "stars": 2}
{"review": "stared badly with what were obviously pre cooked and reheated aloo tikki whose batter was almost inpenetrable. The Chicken Tandoori had less meat on it that your average sparrow and the Kheer to finish was just warm milk with a few grains of rice thrown...", "stars": 2}
{"review": "The food was overall fine; however, the basic etiquette of treating guests properly is missing. What was most disappointing is the manager's attitude; he was too rude when I mentioned to him about the undercooked food.  Needless to say, I'm not going there again and...", "stars": 1}
{"review": "Who says good meals in NYC cost a fortune? Darbar has a fantastic lunch buffet--in a calm, linen-tablecloth environment, for less than 15 bucks. We also ordered takeout one night that was equally good. Goat curry and carrot halwah were standouts.", "stars": 5}
{"review": "I went to this place only after reading the reviews on TripAdvisors. Buffett looked decent, so we opted for that. The food was quite decent except the rice. We just asked one of the waiters (cum manager) if he could check if it was undercooked....", "stars": 1}
{"review": "I am very picky about Indian but this place stood up to my expectations. Wait staff were awesome! The food was even better! They offer a prix fix and everything we ordered was fabulous! Chefs suggestions are a must!", "stars": 5}
{"review": "The lunch buffet is among the best in NYC: a wide array of fine dishes: tandori chicken, chicken tikka masala, goat curry, goan fish curry, veggies, naans--all for the very reasonable price of $14.95.", "stars": 5}
{"review": "This place was recommended to us, and were weren't disappointed. Prices for NYC were very reasonable,plant of food, and good service. We started off with the \"Vegetable Snack Platter\" which was plenty. For dinner we had the \"Tandoori Mixed Grill\", it was plenty for the...", "stars": 4}
{"review": "This restaurant was a real find midtown. The curry was pleasantly spicy but you could still taste the meat, yummy spinach dish and piping hot nan. Great location, good service, reasonable price. I'd go again in a heartbeat.", "stars": 4}
{"review": "First time to New York but definitely not our first Indian meal but without doubt the best we have had the service excellent, prices for the quality have to say on the low side if you're in this side of town don't miss this gem...", "stars": 5}
{"review": "We had the carry out because of the freezing temps.\nDelivery on time; nan and palak paneer were excellent. My wife and son also liked their stuff equally well.", "stars": 5}
{"review": "Pleasant and friendly staff, food was pleasant. Table on second floor near window. Not far from fifth avenue, easy walk from most central locations.", "stars": 4}
{"review": "We got reservations on Open Table...didn't need them after all as the place wasn't that busy.  Great Indian food, very attentive service and good ambience.  Would return.", "stars": 4}
{"review": "Personally the best Indian I have ever had. Service was good, attentive without being too fussy. We just ordered poppadum's and pickles to start followed by a main course each. It was delicious, perfect flavour, not greasy, really really enjoyed it. Price was so reasonable...", "stars": 5}
{"review": "visited one night for a meal with my partner,upon arrival we had the chef going ape at the delivery guy for parking his bike at the front a few choice words thrown infront of customers shocking, ordered popodoms and mango chutney for starters popodoms came...", "stars": 1}
{"review": "As an individual traveller from Manchester UK, I arrived staying locally at the Radisson looking for some extra spice for dinner. I was not disappointed by with the warm welcome nor the quality of food cooked to a requested specification, the dinner was perfect. \nFor...", "stars": 5}
{"review": "The lunch buffet was pretty good. The service is quick and a business party from the office can get in and out within one hour.", "stars": 4}
{"review": "Although NYC is crawling with Indian restaurants, some good, and many truly awful, Darbar stands as an oasis of real Indian cuisine, freshly cooked, with excellent service. The prices are low to fair, and this should be a destination for anyone looking for an authentic...", "stars": 5}
{"review": "Really enjoyed our meal here. It was some of the best Indian food I've had. The service was also excellent. The prices were reasonable. We would eat here again. The only thing we didn't like was the scallop appetizer.", "stars": 5}
{"review": "We had dinner twice at the Darbar Restaurant in New York. This is a compact restuarante on the 46th St. that serves primarily Indian but also Bangladeshi cuisine at it's restaurant. The management and staff are mostly Bangladeshis so you can see a nice \"eastern\"...", "stars": 4}
{"review": "From the outside you do think \"hmmm I'm not sure\" but as soon as you walk in everyone's friendly, and don't be put off by the small amount of seating downstairs, upstairs is great and won't get the draft from the door. \nGreat service, fantastic...", "stars": 5}
{"review": "Went here for dinner with three friends. This is a comfortable restaurant, nice atmosphere and excellent service. It is located on E. 56th St., not E. 46th as stated on this site, We're all quite familiar with Indian food and found all of our dishes,...", "stars": 4}
{"review": "We discovered this place just by chance around 1500 hrs. The manager informed us that they were closing in 10 minutes and would not be able to open up tables for us, but we could sit at the bar and eat. We were famished and...", "stars": 5}
{"review": "It seems to be one of the very few restaurants (possibly the only one) offering an all-you-can-eat lunch buffet in Midtown. There is a long and narrow dining room downstairs and a larger and noisy (waiters contribute to the noise) dining room upstairs. The choice...", "stars": 3}
{"review": "Good buffet with great lentil soup, friendly people nice place. If you like tasty and spicy is the right place.", "stars": 4}
{"review": "I like this place.  The prices are reasonable, there is an available lunch buffet that is the best of the surrounding Indian restaurants, and the food off the menu is well prepared and fresh.  The menu selections tend to be more spicy than the buffet,...", "stars": 4}
{"review": "Darbar was my self discovered place staff is fast and takes care of ally your special requirements really well. Will surely return back to try out more items from menu.", "stars": 5}
{"review": "We enjoyed chilly chicken and yogurt fish. Good service  clean and comfortable. I would recommend to anyone", "stars": 5}
{"review": "Great place for lunch. They have a buffet with a lot of Indian dishes. They had lamb tandoori chicken lentils rice. Service was excellent. Plenty of nam bread.", "stars": 4}
{"review": "Darbar provided very good food and impeccable service. The Gobi Manchurian appetizer, which I have an enjoyed at other restaurants, was the highlight of the meal. The chicken saag was fresh and lighter than I've had elsewhere.\n\nI like spicey food, but not Indian hot....", "stars": 5}
{"review": "Went to the Sunday lunch buffet. Amazing food! I am a vegetarian but my husband enjoyed the 5 meat dishes, while I had second helpings of the 7 veggie options. The nan is made to order and was unlimited. I can't say what the desserts...", "stars": 5}
{"review": "Nice ambience.. A little bit of sluggish service but not too slow.. Food was awesome..  Garlic Naan and Daal Makhni, peas pulav were just too good.. My friends who had Non-veg food were equally impressed as well.. I will surely visit again..", "stars": 4}
{"review": "Three of us went to dinner at Darbar on 46th because we were looking for dining near the theater district before our planned show. I have to preface this review with an explanation that our daughter is a cook in New York, so when we...", "stars": 5}
{"review": "Greeted well. Friendly staff. Attentive. Started with two orders of Naan bread. Luke warm at best with an empty restaurant. Not acceptable. We ordered Lamb Roghan Josh, Chicken Malai, Shrimp Tandori. Lamb was regular spicy but had a bite. Don't order hotter. It was fine....", "stars": 3}
{"review": "Stumbled upon this restaurant in NYC last week. Had never tried Indian food so was a little unsure but was so happy we found this place. Staff was great, atmosphere was good. We were sat right away. Waiter made great suggestion and food was great....", "stars": 5}
{"review": "6 of us ate dinner here.  The crackers were homemade and flavorful as were the condiments.  Vegetarian samosas were fresh and delicious.  All enjoyed their entrees, particularly the chana masala.  Had garlic naan, onion naan and the potato stuffed naan, some of the best anywhere....", "stars": 5}
{"review": "Eated her for dinner. The resurant has a nice atmosphere. Friendly staff that delivered good service. And the most important,the food vas really good! Would love to eat here again.", "stars": 5}
{"review": "We tried this place on a whim and felt like we hit the jackpot!  It's small and doesn't look like much from the outside but the food was some of the best I've ever had.  Very good selection and service.  I thought the prices were...", "stars": 5}
{"review": "Darbar was recommended by Lexington Hotel which is close by.  The restaurant is cozy and serves really good Indian food.   We enjoyed the chicken Tikka Masala and Okra dishes. Onion Naan was good too. Coconut sorbet in shell was perfect ending.   Good wines by glass...", "stars": 4}
{"review": "in town for personal and business and decided to try this restaurant out because of all the good reviews. We were not disappointed. The service was excellent and the food was awesome and everyone just could not stop raving about it... we have been to...", "stars": 5}
{"review": "Nine of us met for a Saturday dinner here with some arriving by car some by train and others by foot. Conveniently located near Grand Central, this Indian restaurant was a fabulous delightful surprise. From a good Chardonnay to some delicious drinks called Karma, through...", "stars": 5}
{"review": "Some of the best chicken tikka masala, goat, paneer, etc. !5 bucks for the extensive, fresh buffet. I truly recommend it.", "stars": 4}
{"review": "Went here recently with four colleagues for an early business dinner. The restaurant is small-ish, we sat upstair. It was a Monday night so not too busy (still early I think). There are lots of good options for your typical Indian Punjabi dishes. We had...", "stars": 4}
{"review": "Went here recently by myself for lunch on a Sunday and was pleasantly surprised. $13 for all you can eat Indian buffet. And the quality of the buffet was quite high. They had appetizers, good mains and some dessert. Staff were very friendly and there...", "stars": 4}
{"review": "I was skeptical about eating here after reading all the reviews however when I got there the Stat wad very friendly and helpful. I ordered a chicken dish and a shrimp dish. They were both delicious! The dinner menu is a little pricy but the...", "stars": 4}
{"review": "Mainstream food, very bad service, unpleasant atmosphere. \nThey let us sit on the table, order drinks, take some food from the bufee and after that they informed they close in 5 minutes so we shoud hurry up filling our plates ...", "stars": 1}
{"review": "I am a lover of Indian food and I have to say this was one of the worst Indian meals I have ever tasted . I chose Goat vindaloo , the sauce tasted of vinegar and the meat was in small pieces with bits of...", "stars": 2}
{"review": "A wide variety of Indian Cusine to satisfy your taste buds with! We tried a little bit of everything! \nThis was our second visit to Darbar and plan on returning whenever we are in NYC.", "stars": 4}
{"review": "There was buffet food available and quite a variety.  The food is tasty and not too spicy. Also the seating is convenient and ample enough to hold business meetings over lunch or to meet with colleagues to discuss projects. Can also serve for couples.  Overall...", "stars": 4}
{"review": "We had read about this in a guide book. The restaurant was full with locals. \n\nWe had the afternoon buffet which was good if not a tad cold but this was resolved once they realised. We also tried the lassi's which were amazing. \n\nThere was...", "stars": 4}
{"review": "Found this restaurant on our last night in New York on a recommendation from a guide book well worth the 20 min walk for excellent food, service and price highly recommend.", "stars": 5}
{"review": "Found this from a guide book. Friendly service, fantastic curry, reasonably priced, would highly recommend.", "stars": 5}
{"review": "The service was great from start to finish and the food exceeded our expectations.  We had the Chicken Tikka Masala which we cannot go with out when we eat at an Indian restaurant and it was outstanding.  Good Job!", "stars": 4}
{"review": "We continued our never ending quest for good Indian wherever we go.  This time in New York.  We asked our hotel front desk and he had the good oil on one of his favourite places.  He called ahead for us so when we arrived we...", "stars": 4}
{"review": "Having eaten there last year, and been quite pleased, went back again tonight.\nCan not comment on the food....we were seated by a surly waiter, and our order quickly taken. After almost 30 minutes of a wait, I started to ask where our food was,...", "stars": 2}
{"review": "We chanced on this place and decided to break the rule of having local food and have Indian and no regrets ! The food was out of the world and the service was great. One advice - Helpings are large so check before you order....", "stars": 5}
{"review": "Fantastic Indian meal. Coming from the UK I wasn't sure what to expect but the menu, food choice and quality, and the service were faultless. Highly recommended !", "stars": 5}
{"review": "I highly recommend Darbar, I had a great spicy upon demand pepper chicken and dreamed about it all the next day until i had it again that night!  the food is delicious and very reasonable.  the papadams were feather light and flavorful and the coriander...", "stars": 5}
{"review": "Coming from the UK, we are probably spoilt for choice for Indian Food restaurants, however on our last night in the Big Apple, we thought we would have an Indian meal.\nWe had pre booked our table and when we arrived, were shown to one...", "stars": 4}
{"review": "Real Indian food is served as managed by some Marwari businessmen from Kolkata .\nI was amazed to see the indian green chilly being served with dhania pudding chatni.\nWe ordered for meal like tandoori roti , allo gobi fry, yellow dal fried but we...", "stars": 4}
{"review": "Had a GREAT meal here! Super friendly owner waited on us and made fabulous suggestions. We LOVED the vegetarian house specialty of beet root dumplings in a delicious flavorful curry like sauce. The chicken dish was also excellent! We will be returning here on our...", "stars": 5}
{"review": "went here with hubby and 2 teenage boys - meal was superb - true authentic spices used - staff very helpful and omitted certain ingredients to suit our taste - good sized portions - nice atmosphere reasonable price about £12 a head - good menu...", "stars": 5}
{"review": "We had Indian food after trying out all western delicacies near us in our week stay in NYC. Food was great but was on a costlier side. Ambiance can be improved in the dining area on 1st floor.", "stars": 4}
{"review": "Good values for lunchtime buffet. There are a number of dishes that you can fill up on and they bring you the naan or poori to your table.  There are some hot sauces that you can out on. I have always gone with others to...", "stars": 4}
{"review": "I often hunt down Indian restaurants as it's one of my favorite types of cuisine.  I have learned to cook certain dishes myself.  We found Dabar and were excited to dine there.  The ambiance is lovely, we were seated upstairs where it was nice and...", "stars": 3}
{"review": "We shared a 4 course set meal for our wedding anniversary.  It was a relatively quiet Monday night but the staff were very friendly and helpful.  The good was very tasty and there was a good choice on the menu.  The restaurant was close to...", "stars": 5}
{"review": "My office is a block from Darbar and I've eaten there at least a dozen times. I like being able to grab a plate and serve myself from the buffet, which is very reasonably priced for midtown Manhattan at $13.95. There are a fair number...", "stars": 4}
{"review": "I had the lamb palak. The sauce was flavorful. The lamb pieces could have been tenderer, but they were fine when sliced into smaller pieces - no fat or gristle. The nan was excellent. Our Malbec was very nice. We ate upstairs and it was...", "stars": 4}
{"review": "I live in Netherlands and have tried several Indian restaurants and there are some really great ones. On my trip to NY, I went to this restaurant and was really blown away by the great taste they have. I must say I was impressed by...", "stars": 5}
{"review": "Visited the restaurant on my visit to New york in April 2014 and the Indian Buffet was great, with south indian and North Indian spread.\n\nDo try the Kulfi and mutton curry", "stars": 5}
{"review": "Ate hear before seeing a play in the Theater District. The food was filling and burned some of it off walking to the theater.\n\nGood:\n-1000 point RSVP on OpenTable.com\n-Samosa appetizers (2 per order)\n-Cheese & Garlin Naan was yummy\n-Chicken Vindaloo\n-Shrimp Curry...", "stars": 4}
{"review": "We really wanted to give Darbar at least 3 stars, for we absolutely love Indian food and frequently dine at various Indian restaurants. Alas, all Darbar can qualify for is 2 stars, as a result of multiple flaws in service and management. \n\n1) Not once...", "stars": 2}
{"review": "Lovely ambiance, excellent, impeccable service. Good food. A bit pricey, but it was a great experience.", "stars": 5}
{"review": "So, I had this craving for Tandoori shrimp.  Luckily I was staying couple of blocks away from Darbar, where I have not eaten before.\n\nIt is a small restaurant, white \ntablecloths, and very attentive service. There is a wide variety of menu including a lot...", "stars": 5}
{"review": "First time i try indian food and darbar was really great. Waiters were very nice to us, and the prices are good too. I recomend this place.", "stars": 5}
{"review": "I was in New York on a rainy night and despite vowing to never eat in when in a city filled with such amazing choices, caved and got Darbar delivery for my 6 year old son and me (his choice). It was delicious. Nicely flavored...", "stars": 4}
{"review": "We ate there for dinner. It was nothing to write home about. The main dishes were ok but the samosas had zero flavor. I've tasted better frozen ones. We were able to use a free naan coupon from yelp. I'd look elsewhere for Indian if...", "stars": 3}
{"review": "This is the only Indian restaurant I could recommend. I was never a big fan of the Indian cuisine, for me everything tasted like raw spices, undeveloped tastes, not put together nicely. This one was an exception for me. Even the hottest food was edible...", "stars": 5}
{"review": "Dined here with spouse tonight. Had a sweet lassi, garlic naan, and lamb Melagu. Entree came with basmati rice and we also received papadams with two chutneys to enjoy before our meal arrived. Service was very good. Food was delicious. Sat in the downstairs area....", "stars": 5}
{"review": "WE LOVED Darbar!!! \n After finishing the most delicious appetizers, meal and kheer dessert, my girlfriend and I had the privilege of sitting and chatting with management for a few minutes and really enjoyed meeting and speaking with Gabriel & Mike, the men behind the magnificent...", "stars": 5}
{"review": "Me and my fiancé came here for a meal celebrating our engagement and my pregnancy. When we arrived we were shown to tables downstairs and we were the only ones there, bad start straight away. We could hear other people upstairs however.\n\nI ordered a...", "stars": 1}
{"review": "We had such a great time there. The food is really good. I would recommend the Chicken Korma and their Paneer. We also had the Vindaloo which was really good. The food is great and the price is very reasonable. I stayed in New York...", "stars": 4}
{"review": "Found this restaurant advertised in a N.Y. city guide and was therefore a bit sceptical. But the food was excellent, the service was pleasant, and the location is great. The first course with a mixed array of fried vegetables was outstanding, so was the yellow...", "stars": 4}
{"review": "Ok, I understand that buffet fare can be pretty underwhelming, but you have to do better than this place. This is especially true for Indian food, which does not take too much work to infuse flavor into. Seriously, the flavors were so underwhelming that I...", "stars": 2}
{"review": "Whenever we stay in NY we have dinner at Darbar on 46th street. We reserved a table on the upper floor, which has more atmosphere and is more silent than tables on ground floor, where also the bar is located.\n\nPapadams are always served as...", "stars": 5}
{"review": "I will confess that we didn't know much about this restaurant in advance having found it in a google search of best Indian restaurants in NYC just hours before our visit.  I had been to Tamarind in August with my daughter and wasn't inclined to...", "stars": 4}
{"review": "Darbar is a must if you are craving real Indian food.  We make this a must do when in Manhattan.  Great lunch buffet and dinner menu is complete!  Service is fantastic and professional...Highly recommend!!", "stars": 5}
{"review": "Very tasty meal and extremely good value for NYC. Service was friendly and efficient. Good location in midtown Manhattan.", "stars": 5}
{"review": "My wife and I came to NY for a week's tour and after having lots of American food, we longed for some Indian food (We are from South India). We went there on a Saturday evening around 730 pm or so. The crowd was more...", "stars": 4}
{"review": "Too much food - starters big enough for main meals. Starters of mixed kebabs and fish cakes large but fairly bland. Poppadoms nice but dips unexciting.  Most main meals ok although all seemed smothered in same Marsala  sauce.  Lobster Tikka Marsala a mistake.  Very chewy...", "stars": 3}
{"review": "Lovely food at this restaurant. \n\nLarge portions, great service, great price. \n\nDefinitely worth a visit.", "stars": 5}
{"review": "Real Indian food, very fresh and delicious....huge selection, very good service and the price is very good too.I would recommend it!", "stars": 4}
{"review": "Excellent service, the waiter never let our water glasses get below half full at any point in the evening even when they got quite busy. They were very patient with the fact that we were missing a member of our party and when he arrived...", "stars": 5}
{"review": "Four of us walked from E. 53rd and 7th to the restaurant, perhaps 15 to 20 minutes. The place looked inviting - warm lighting, white table cloths, sparkling glassware.  We were seated with no wait.  The wait staff was charming without being intrusive.   Our friends...", "stars": 5}
{"review": "My family and I came in in the early afternoon and just managed the buffet. Excellent food I must say. Well displayed and excellent taste. Kids loved it too. The buffet is absolutely recommandable at $13 per person ! Service is ok but not too...", "stars": 4}
{"review": "A great find.  Huge selection and delicious food.  Not your run of the mill Indian food.  Upscale but not unreasonably priced.", "stars": 5}
{"review": "Wife and I are vacationing in NYC for 5 nights and stopped in on the first day because it as convenient from our hotel.  We did the four course chef's menu @ $38/ person.  All the food was good.  Service was very attentive and friendly....", "stars": 4}
{"review": "My husband and I love Indian food and try new places when possible while traveling. Darbar had some of the best curries we've had. We came with a group of 8, most of whom were new to curries. Everyone, even 3 kids, loved the food....", "stars": 4}
{"review": "Very nice small Indian restaurant on the East side not far from Grand Central.  I wandered in alone, hungry and thirsty.  I had the chicken Biryani and plain naan and a big Kingfisher (brewed in Saratoga Springs, NY for the US market).  A healthy portion...", "stars": 4}
{"review": "Excellent food, great flavours. Had delivery to our hotel a few nights making it even better value. Well worth trying if you like authentic indian food. Prawn Bhuna was fab!", "stars": 5}
{"review": "It's a tasty place, with quick dependable service. But it's just about that, if you are nearby and want a change with some tasty dishes, though also some pretty basic ones, then this is really good. Mos starters are super - cauliflower, eggplants all good....", "stars": 3}
{"review": "Visited this restaurant on E46th Street twice while in NY in June 2012. It was recommended to us by others that had visited the city. Have to say food and service excellent, it was so good we found time to visit again during our short...", "stars": 5}
{"review": "There are a lot of Indian restaurants in Manhattan and this, I would say, is one of the better ones.  The appetizers were very good, especially the cauliflower dish and the onion fritters.  My tandori lamb chops were delicious, but there were only 3 small...", "stars": 4}
{"review": "delicious food , nice portion size and well presented. the staff were attentive without being intrusive. we had a great meal here.", "stars": 4}
{"review": "We just happened to walk in there and it's a great indian restaurant! Fair prices and good service! When I come back to NYC I def. wanna go there again!", "stars": 4}
{"review": "The Chicken Tikka Masala was very good, the salad was fresh, the service was good, but, it took them a while to get the drinks to the table. Then when they arrived they were tiny. They should have been giving mixed drinks in glasses that...", "stars": 4}
{"review": "Very good indian food at reasonable prices for NYC. They make good tandoori food. Good chicken and goat/lamb dishes. Breads are fresh and delicious. Efficient wait staff. \nThere is another Darbar 2 on east 55th street. Not sure if the management is the same.. I...", "stars": 4}
{"review": "I got this as take-out to eat in my hotel. Great chicken biryani, came with raita, extra raita on request no charge. Delicious garlic naan. Reasonable price for mid-town, very happy with my meal and will be eating there again.", "stars": 4}
{"review": "Thank you Darbar for a fantastic dinner experience, and reminding me how much I love Indian food, and how good it can be.  \n\nThe Chicken Malai (??), a house specialty, was truely delicious.  Everything was top quality from the rice to the papadum.  Even the...", "stars": 4}
{"review": "Went there now 3 times and every time the food was excellent. Doesn't look like much from the outside, but the food is consistently very good and prices are more than fair. Two glasses of wine, Chicken Tikka Masala, rice and naan for one person...", "stars": 5}
{"review": "We had an excellent meal.  The servings were not very big, but the prices were moderate, at least by New York standards.  The service was good.  I would definitely return for dinner.", "stars": 4}
{"review": "we had a really good meal here, all entrees included rice. we would visiy again if we were in the area.", "stars": 4}
{"review": "Our group of 9 had dinner here before heading out to the theater.  We had a quiet table upstairs. Overall the food was excellent - we had a large variety of dishes including chicken korma, garlic shrimp, 2 types of lamb, saag paneer, naan, etc....", "stars": 4}
{"review": "The food was truly very good. My daughter and I see ourselves as Indian food experts. Of course we are no real experts but we do love indian food and wherever we are, we try to have a decent indian dinner. It was very good...", "stars": 5}
{"review": "The Darbar was recommended to us by the concierge at our hotel when we told him that we wanted to eat at an Indian restaurant within walking distance of our hotel. The Darbar did not disappoint. The food was very good, the service was excellent...", "stars": 4}
{"review": "We have visited a lot of indian restaurants in various cities worldwide and this was one of the worst,concerning the food,we had tikka massala and chicken tandoori but was something diferent of what we are used.", "stars": 3}
{"review": "The Darbar is a great place to eat because the food is amazing. It was only a few blocks down from my hotel so it was easy to get to. The staff at the Darbar are friendly and very helpfully. The decor of the Darbar...", "stars": 5}
{"review": "During our last visit to NY we found this restaurant by searching for Indian food in Google. were already very satisfied. This summer we came back to NY to celebrate our anniversary. Originally we wanted to have dinner at Harbour Lights restaurant at South Street...", "stars": 5}
{"review": "Darbar is a charming restaurant in the heart of east midtown.\n\n The amazing buffet lunch (11-4pm) has a wide variety of dishes that will be sure to please just about anyone. Nicely seasoned entrees with an assortment from mild to hot dishes. Friendly servers and...", "stars": 5}
{"review": "The food has authentic taste, the staff is friendly and professional.\nThe restaurant even looks like a fine dining place, which is different from most places that serves Indian food that tastes like it should (the best tasting Indian food is normally served from something...", "stars": 4}
{"review": "Open later than the other restaurants in the area. Nice bar area with large seating area upstairs. Short walk from the hotel I was staying in (Roger Smith Hotel). Most importantly I love Indian food.", "stars": 4}
{"review": "The food was exceptional, the serves were very generous and a very reasonable price. The staff were very friendly and helpful. The thing the cost us the most was the alcohol.", "stars": 4}
{"review": "I've eaten at many of the Indian Buffets in Midtown - Bombay Palace, Utsuv, Nivana, Bay Leaf, Bukhara - this tops them all.  Quite a few more dishes than your ordinary buffet, well prepared and delicious foods, and numerous chutneys.  Good service.  More vegan friendly...", "stars": 5}
{"review": "I visited Darbar twice to take advantage of their best-bang-for-the-buck lunch buffet a while back. Last night, I visited Darbar with my cousin because we both work in the Midtown East area and decided on having Indian food.  I'm glad we chose Darbar for dinner....", "stars": 5}
{"review": "We were 5 people and enjoyed the meal.  Appetizers of onion frittters, veg. samosa, chicken samosa and a puffed rice dish were good.  Entrees were enjoyed except my shrimp dish was supposed to be dry, as it said on the menu, but came with a...", "stars": 4}
{"review": "The restaurant looks run down but the food is amazing.", "stars": 4}
{"review": "The food was fine but not extraordinary in any way.  The highlight was the excellent salad.  We went here after reviewing the menu on the restaurant's website, but many of the prices at the restaurant were $1 to $3 more than those listed on the...", "stars": 3}
{"review": "Very tasty indian food a little over-priced I think, but portions are huge.\n\nThey have lots of options in the menu, it was hard to choose. I had a chicken with cashew iogurt, it was amazing. The naam bread was great too!\n\nWe went for...", "stars": 4}
{"review": "There are better Indian restaurants in nyc than Darbar. I have been to this restaurant twice and on both occasions taste and quality was different. Veg platter, yellow dal and okra were good. On second occasion I had ordered tikka and daal makhani and I...", "stars": 3}
{"review": "Darbar is a good choice for a quiet, fine meal in this area.  The staff members were unobtrusive yet attentive and sweet, and the food was tasty.  The basmati rice was particularly good; the naan was a bit too light/airy for my taste.", "stars": 4}
{"review": "i was staying at intercontinental at 48 street and used to go to Darbar quite often since it was the closest at 46 st .Execellent food .The complimentary  papad is very tasty with the chilli and sweet chutney .food like dal fry, dum aloo,allo gobi...", "stars": 5}
{"review": "The food at this restaurant is amazing. I am Indian, and I find it better than anything. Defiantly try the eggplant korma. We found out the my brother was allergic to peanuts, and the staff made bases from scratch, to avoid any contact!", "stars": 5}
{"review": "I was a bit apprehensive when I went to this restaurant as I always am when visiting an Indian restaurant in the USA.  Why you may ask? As the 1st ones I visited in Florida and California did not live up to my expectations.  Here...", "stars": 5}
{"review": "Good food, good service and reasonable priced. Portions are big.", "stars": 4}
{"review": "Good food  great service and well priced for new york standards.  Tandoori Lanb chops  excellent. Wait staff friendly and very knowledgeable even being a foreighner _ russian to be  exact.  We had a great evening and we will recement this place to any and all...", "stars": 5}
{"review": "Darbar isn't the prettiest restaurant around but it's not unattractive, either.   When we arrived, the hostess offered us a choice of upstairs or downstairs.   Hard to gauge when you can't see the upstairs!    Still, we went up and got a table right near the stairwell....", "stars": 5}
{"review": "I ordered chicken vindaloo, aloo paratha and rice. Well just a simple order like this obviously was too much for this \"fine cuisine\"!! The paratha was very thin with hardly any aloo(potato) - don't try it unless you have too much money to throw away....", "stars": 3}
{"review": "Visited here on a Sunday evening around 9pm. It was close to our hotel and we were very tired so it was the easy option. They have a very limited menu compared to most Indian establishments. They did a Lamb dish I liked the sound...", "stars": 3}
{"review": "The food is very good and the service is great. Definitely order the bread with your food!", "stars": 4}
{"review": "I made a reservation on their website and recieved an email back confirming the reservation only to arrive and them tell us they were closing.  It was our first time in NYC and part of our experience was to eat out at nice restaurants.  We...", "stars": 1}
{"review": "This restaurant should not be missed.  Ask to be seated upstairs.", "stars": 5}
{"review": "Darbar fine indian cuisne & lounge is a fantasitc place to eat, the food is really good, well priced. the venue ( especially upstairs) is very nice and pleasant. we went there five years ago and was still impressed with the service and quality of...", "stars": 5}
{"review": "Went there for lunch and had the buffet. It was a good variety, especially if you're new to Indian food. The service was great, always had full water glasses and fresh bread. The dining area on the main floor for the buffet was very small,...", "stars": 4}
{"review": "The Indian Food at Darbar was very good. We came to New York because we were searching for some really good food! The first night we arrived, we ate at Bay Leaf Indian food, which was awful and over priced, so we came here the...", "stars": 4}
{"review": "Delicious, slightly overpriced, smaller portions, nice atmosphere.  I can't give it a 4 b/c I am used to something different, and the food wasn't as good as I've had but the setting was much nicer, but I don't pay for setting, I pay for food.", "stars": 3}
{"review": "We went to Darbar with my wife, and had a mostly pleasent experince. For the most part, the food was very good, but unfortunately my Tandoori Mixed Grill lacked taste and was pretty dry (except for the small piece of lamb which was to die...", "stars": 3}
{"review": "Can't beat the buffet. Best goat curry in NYC!", "stars": 4}
{"review": "We had dinner at Darbar on a quiet Sunday evening. We're in New York for a week each January, and we like to mix up our dinners and Sunday was decreed Indian Night. The interior atmosphere was one of calm and tranquility, softly lit and...", "stars": 3}
{"review": "Fish Moilee is the best!", "stars": 5}
{"review": "The cafe is adequate but not much more can be said about it. We were there on a day that was not over busy in the Centre, but still quite busy in the cafe.\n  It is fast food at above average prices. I guess once...", "stars": 3}
{"review": "Load up on some pizza or sandwiches while you are perusing the NASA space center.  They have great food and beverages for all people.  The prices are fair and the lines can be long, but great pizza for all.", "stars": 4}
{"review": "This is the place to go after the exhaustive trip through the space center if you are hungry. Was a little bit pricey for me though!", "stars": 3}
{"review": "We had lunch on our visit to the Space Center.  There was allot of space to sit to eat in an air conditioned building getting a break from the heat outside.  Good food a wonderful experience. 5/5", "stars": 5}
{"review": "Yeah, yeah, I know what you're thinking: of *course* there's a cafeteria at a local attraction; I can't *wait* to get a cold cheeseburger and a warm soda!  Well, cast those thoughts aside and head into the Starport.  \n\nMost people see the burger place at...", "stars": 5}
{"review": "For an overpriced cafeteria there were a surprising number of options and fairly decent pulled pork sandwiches.", "stars": 4}
{"review": "Take a break and enjoy the Cafe and surrounding!Good price for every pocket.With the friends or alone I will come again.", "stars": 5}
{"review": "This place has a good selection of cafeteria food.  It is well prepared, tasty and the portions are good.  For the price you get a good meal.  I had salad, a salad bar, and the choices were yummy, but you know, those salads add up...", "stars": 3}
{"review": "We went early in the morning for hot cocoa and coffee since we were cold after our tram ride.  Shared a cinnamon pastry which was delish.  Later on, we shared a bbq pork sandwich and soft drink and it was very tasty.  Lots of room...", "stars": 4}
{"review": "A good collection of food outlets within the Space Center complex. I would have liked the coffee to be a bit more obvious (perhaps I was tired!). The drink vending machines I tried for water didn’t work, so I ended up with iced tea. The...", "stars": 4}
{"review": "After a long morning touring the Space Center, lunch was an eagerly awaited treat. I ordered the Chicken and Waffles combo plate for my wife and I. The item was listed on the menu under a category that stated the plates come with entree and...", "stars": 3}
{"review": "Great place and reasonable I have a season pass and enjoy going every 6 weeks or so. People may pass it up thinking it is expensive but it is not.", "stars": 5}
{"review": "Nothing particularly awful, and a variety of fast food for your visit to the space center.Don't know what you can say about hot dogs.", "stars": 3}
{"review": "To be expected, 28 bucks for five small bags of chis and five sodas.   Clean, lots of seating but simple food and high prices.", "stars": 3}
{"review": "Had lunch here while visiting space center. Had Cheese Burger & Fries with water. slightly above average cost but food was OK.", "stars": 3}
{"review": "Simple food while you are at the center.\nFast food, normal pricing for the area.\nGave it three stars because just average food.", "stars": 3}
{"review": "They've got you here.  If you're here around meal time you're going to eat here.\nThe food is average.  A meal was included in the ticket.  The only issue is the items that looked really good were not included in that price.  It'll get you...", "stars": 3}
{"review": "Lunch was included in our Level 9 tickets. We got to the cafe rather late in the 'lunch hour' and it did seem to take a while to get our hot food, but it was delicious and worth the wait!", "stars": 4}
{"review": "Well, not really. It's food is typical small town diner style food with outer-spaced theme names. But hey, I expected that. Overall the food is nominal.... but the atmosphere, where else can you go to have dinner with an astronaut, see the stars and go...", "stars": 4}
{"review": "Expensive. Food average. A typical food hall tourist trap which shouldn't come as a surprise. Make sure they don't try and over charge you......", "stars": 3}
{"review": "Ok food court. Standard selections. Pizza, BBQ, sandwiches, burgers, chicken strips, etc.  Prices are about what you would expect at any amusement park or stadium so be prepared for that.", "stars": 3}
{"review": "Great options for kids and adults. Love the free refills on fountain soda as long as you keep the cup ! Clean places to eat.", "stars": 5}
{"review": "This has GOT to be one of THE lamest food courts EVER!!!\nThe food SUCKS,is WAY OVERPRICED,the employees act like they are pissed off at EVERYONE,and literally HALF of the places weren't even open!!!", "stars": 2}
{"review": "I have eaten here in my previous visits and told myself never to eat there again but then, me and my mom are already too hungry to go out and too lazy to go back again so we ate there. If you are hungry enough,...", "stars": 3}
{"review": "It seemed like a pretty good place to eat.  There was plenty of room and about 5 different options.  Unfortunately, I didn't find any very appealing.  I chose the cheeseburger and I would have preferred McDonalds.", "stars": 3}
{"review": "We visited the Space Center during the rain storm that flooded half of Houston, and a lot of people didn't make it to work at the museum.  Only part of the Café was open.  Ordered two burgers and two drinks.  The burgers came out within...", "stars": 3}
{"review": "Good selection of food and good coffee for the adults.  Reasonable prices but higher than a fast food places.  If you go when the Space Center opens and have kids it is a convenient place for lunch", "stars": 4}
{"review": "We had a lovely meal here, in between shows at the Space centre. Nice atmosphere and friendly staff too.", "stars": 4}
{"review": "Reasonable quality of food was really hungry but didnt really like what was on offer...the only good part was the coffee..but yeah nice place to relax for a bit", "stars": 3}
{"review": "Reasonable quality food fir a In house lunch stop. Prices are moderate. Had the stir fry fir $9. which was tasty. Variety of burgers available.", "stars": 4}
{"review": "was really hungry but didnt really like what was on offer...the only good part was the coffee..but yeah nice place to relax for a bit", "stars": 3}
{"review": "They run out of food by 1pm almost every day, and the price is way too high. Many dishes are too salty or too spicy with pepper/jalapenos - not sure why they do that.", "stars": 3}
{"review": "Very nice get coffee and sit there for a couple minutes during yr visit. This coffe shop was just one in this area. I was surprised, that there is no food area, because a lot of people planning to stay there all day.", "stars": 4}
{"review": "A good selection of food and drink for all the family with plenty of seating close to the action and exhibits", "stars": 4}
{"review": "$3.50 per slice for one slice of cheese?  Another $3.50 per drink?  They have a captive audience and I see no reason to overcharge.  There is a selection of chicken strips, stir fry, burgers and dogs and food was okay. My recommendation would be to...", "stars": 3}
{"review": "There were a vsriety of selections to choose from all of which were average priced museum offerings.  We bought two sandwiches -- one of which was tasty but the other was dry and unappealing.  For a quick lunch it sufficed but was not great.", "stars": 3}
{"review": "Perfect Design .... Quick Fast Service ...... Nice Atmosphere ...... kind Staff...... with smily Faces...... Lovely Place ..... Thank you for their Service", "stars": 5}
{"review": "The food court offers enough choices that it is sure to have something for everyone in your party. Prices are inline with what you'd pay at any foodcourt. There is ample seating inside and some outside. We ate around 1:00 and most of the student...", "stars": 3}
{"review": "Food is set up in a variety of stations and options range from pizza to stir fry to hotdogs and chicken fingers. This is the place to get a good latte and if you only want to buy a treat and bring food you can...", "stars": 4}
{"review": "Good place for a snack or meal.  Very clean food court. Lots of choices.  With quick service.  Good place to stop and rest during your visit to the Space Center....", "stars": 5}
{"review": "Food is typical fast food - cafeteria line service.  It rates highly because you can find something for all palates - burger lovers, fried food lovers, vegetarians, etc.  This is important when you are taking visitors, particularly from countries other than US.", "stars": 4}
{"review": "Visited with our grandchildren in Kingwood, entertained them for the day.  Had snacks that were healthy alternatives to fast food and coffee that satisfied my wife and daughter-in-law.", "stars": 5}
{"review": "The food was good and the portions were plenty big but it was very expensive for what you got.  You are not allowed to bring any food into the facility, so they've got you!", "stars": 3}
{"review": "Yes there is a lot of choice, think of a mall food court, but most of the food is pretty bland.  Though two perks - the prices aren't crazy and their is a lot of room and seating for families.", "stars": 3}
{"review": "Title pretty well says it all. Average cafeteria food. Not bad but not great either. Still you don't have much choice since this is the only game in town here.", "stars": 3}
{"review": "this is just a regular food court  Just like at any mall across America .  clean and regularly staffed", "stars": 3}
{"review": "I also loved that the calorie and fat count was listed on the menus. It was fascinating to sit and observe the brilliant NASA minds as they sat and socialized over their lunches.  We didn't see any astronauts we knew, but it was exciting to...", "stars": 4}
{"review": "It was nothing special.  They don't allow you to bring food or drinks from outside, so this is a decent option, but it's not great.", "stars": 3}
{"review": "Ate here during the Level 9 VIP tour. The food was fresh, plenty of variety, good value for money. The cakes were delicious, so were the salads. The coffee very decent. The best part was \"having lunch at NASA\" and mingling with some of the...", "stars": 5}
{"review": "We had lunch here on Saturday. We ate late and some counters were already closed. We all had Texas chilli from the first stand, which was better value than some options and a great choice for a cold day. It isn't the greatest place and...", "stars": 3}
{"review": "Over priced & average food.  Exactly what you would expect from an attraction like this.  They do have a wide variety of items to eat & some good coffee thank goodness.", "stars": 3}
{"review": "My family like the starport cafe at the johnson space center.  The food was served fresh and tasted quite well.  Good dining option after or during a visit to the space center.", "stars": 4}
{"review": "Half of the booths were shut when I visited for lunch, leaving a limited choice. The food was adequate as \"fuel\" but not much more than that. High prices as you might expect for a captive audience.", "stars": 3}
{"review": "Sandwich of bread and meat - bread cold and chewy.\nNo Coke products - all Pepsi and we don't like Pepsi. Table area was clean and neat and picked up. Service people on food line were polite and cheerful.", "stars": 3}
{"review": "It's great coming to work and having an opportunity to grab a meal or a snack right outside your office door! \n\nEvery week they post a menu for our convenience and have a great variety to satisfy the pallett of even the pickiest eater! \n\nHealthy...", "stars": 5}
{"review": "The café was fine without reaching any heights. Clean and fair service with good selection. No space food which was disappointing.", "stars": 3}
{"review": "You are paying for the convenience of eating onsite...and that is about it.  Dry hamburgers & hotdogs. Not even as good as fast food restaurants and about triple the cost.  We paid more for lunch than we did admission getting into the place.", "stars": 3}
{"review": "This is actually more like a food court with separate restaurants.  We stopped at the first one on the right, and the food was very good.  There are many offerings for a variety of tastes.  The eating area was crowded on our Saturday visit, but...", "stars": 4}
{"review": "Positives - very broad selection is a food court setting.  You should be able too find something to suit everyone.  It's convenient and spacious.  The theme is kind of cute.  Cons - it's terribly expensive - feels like a space mugging.  The food is only...", "stars": 3}
{"review": "seriously. we all know that attractions have over priced food but this is freakin rediculous", "stars": 1}
{"review": "The food is WAY too expensive for the quality. Maybe once a month they serve something good, but a majority of the time the food is subpar. Their contract monopolizes all other choice, so their is no alternative. for the price of a small sandwich...", "stars": 1}
{"review": "Got my husband food for his birthday. We have been going here for years. Even though we have moved out of the area. The greeter/cashier was so rude she ruined my day. From the time I entered to the time I left. She was extremely...", "stars": 1}
{"review": "Great Mexican food at a great price. Service was a little slow, but it was very busy. Servers were polite, management was on the house floor helping with the flow. I definitely recommend and will go back again.", "stars": 4}
{"review": "My family and I eat there regularly and we do family special occasions there as well. The staff and food are AMAZING! The manager is just BEYOND RUDE! And he really doesn’t care about the establishment. We asked for a table for three on a...", "stars": 4}
{"review": "We were over charged ton two different occasions when visiting this restaurant. They handled the situation poorly and without finesse. The food was not that good. We found a hair in one plate. Another plate had rice and beans that tasted days old. Would not...", "stars": 1}
{"review": "Ordered mixed beef/chicken fajitas to go for 3. We have food left over for 2 more meals at least. Everything was delicious.  Whole process was great. Ordered on phone.  Picked up and paid right in front. Looking forward to eating in soon--just not yet. Thanks...", "stars": 5}
{"review": "Went to get dinner tonight during covid-19. Could not eat in so ordered curbside. A security guard came to our car took our order brought our food and on our way home to eat. It was fabulous we got everything we ordered it was still...", "stars": 5}
{"review": "Service always prompt. Food always hot and margaritas are yummy! Friday nights are worth waiting for a table.", "stars": 4}
{"review": "Four of us met at Tia’s for dinner on a Friday night and “camped out” from 6pm to 10:30pm when they close — as we had so much catching up to do. They always have great friendly service, excellent food, and wonderful (and strong) margaritas....", "stars": 5}
{"review": "My wife and I have been regulars at several of the Mexican restaurants along 290.  Of late, we have tried Tia Maria's on Dacoma.  Enchilada dinner plates are plentiful.  However, if you order food to go – be sure to double-check your order before leaving...", "stars": 3}
{"review": "Tia Maria's is not fancy. our group of 6 meets there almost every sunday. we're never rushed. we order our margaritas then chat about our week and solve many of the world's problems. I've had so many of Tia's margaritas that they are what I...", "stars": 5}
{"review": "Tia Maria’s is now one of my favorite Mexican restaurants.  I hope they are this good every time. This was my first visit.  This is how I remember good texmex tasting growing up (late 70’s-early 80’s).  Their salsa is served hot which is usually not...", "stars": 5}
{"review": "Every time we visit family in Houston,  we go to Tia Maria's.  The best Mexican food in Houston.  Large portions and very moderately priced.", "stars": 5}
{"review": "The food taste very fresh and the prices are affordable. Not too spicy at all. Service isn't very fast but super friendly", "stars": 4}
{"review": "We wanted to try a new restaurant today and ended up at Tia Maria's.   Great food and service.   It was a busy Sunday afternoon but the service was superb.   Very good sweet tea!!  Chips and dip excellent.  Refills at exactly the right time.   My husband...", "stars": 5}
{"review": "And that's about it. My chalupa plate was AWFUL. The guac salad that came on it was so minuscule I almost missed it! Never going back! Don't waste your time.", "stars": 2}
{"review": "Great little Mexican restaurant off 290/610. Excellent Carne Guisada / Cheese Enchiladas/ Queso- very reasonable priced lunch menu - lots of great choices/ friendly service. One of my favorite lunch spots.", "stars": 5}
{"review": "My family has enjoyed Tia Maria’s for many years ~ good food and plenty of it as well as a fabulous margarita special!  My favorite dish is the flour chicken flautas ~ the best!", "stars": 5}
{"review": "Another great visit to Tia Maria’s. In the 30+ years I have been eating here, I have never been disappointed. Our group of 4 talked about going somewhere else for our “reunion” but everyone wanted to go to Tia’s - including a friend who drove...", "stars": 5}
{"review": "We love Tia Maria’s!  We enjoy great service and good food every time. The tortilla chips came to the table warm, and the house salsa, queso and guacamole make for delicious appetizers. Our favorites are the enchiladas dishes. The chicken is tender and the spices...", "stars": 4}
{"review": "Was in town for work and my coworkers brought me here.   The chips were good and warm, but the salsa was weird. Seemed like salsa mixed with refried beans.  I had the chili rellano plate. It was not good. The batter was non-existent. It had...", "stars": 2}
{"review": "We went to celebrate Astros' winning the World Series with family visiting from Miami.  The waiter Enrrrrique was extremely friendly and entertaining.  Service was excellent.  Other waiters attended our table as well for chips, water, drinks, food, etc.  Very impressed.\nMargarita's were tasty & strong....", "stars": 4}
{"review": "Why do I LOVE Tia Maria's and keep coming back since my first time in 1987?  Large portions, cheap prices, great margaritas, family atmosphere, no wait, fast incredible service (all the waiters check on you), excellent chips and salsa, delicious hot food -- including the...", "stars": 5}
{"review": "I was passing through town and wanted some great Tex-Mex.  Tia Maria's did not disappoint.  Standouts included the fresh hot chips, the beef tamale and the cheese enchilada.  Skip the bland cheese dip and order instead either the guacamole or fajita nachos as an appetizer,...", "stars": 5}
{"review": "This has been the go to place for good Mexican food for many years. However, there seems to be some recent changes that are not so good. The food quality has fallen drastically in the last few months and its now less pleasurable to dine...", "stars": 5}
{"review": "The place is a dive, but the food was great!  I had fajitas. The vegetables were fresh and cooked just right. The guacamole was fresh and seasoned to perfection. I heard nothing but praise from the rest of my party who had enchiladas and burritos....", "stars": 3}
{"review": "Took my family there for a birthday celebration. There were 7 of us and we have visited Tia Maria's many times before but usually just 2 or 3 of us, so we were apprehensive on whether the food and service would still be good. In...", "stars": 5}
{"review": "Attended a friend's retirement party at Tia Maria's. The service was great, the beer was cold and the food provided for the attendees was good.", "stars": 4}
{"review": "Last night was our 2nd annual reunion of a group of us that started working together at \"Brookhollow\", near 610 and 290. We eventually all moved to other work locations or moved out of state and lost touch. Anyway, back in 1987, Tia's was our...", "stars": 5}
{"review": "I haven't been here in at least 5 years. Last memory is that the food was great so I invited a group with me. I should have believed what I read on here. The food is below Taco Bell quality. (Sorry Taco Bell)  Really: They...", "stars": 1}
{"review": "Visited with family, great courteous staff.\nPrices are reasonable but have been eating there frequently and lately the taste is bland (even on my usual dishes). \n\nA bit of a surprise and this was one of my favourite restaurants :-(", "stars": 4}
{"review": "This was the worst tasting food I have been served. It was not just one item, but everything. The salsa tasted liked canned tomato sauce, it was horrible. When  \n I asked our waiter if they had any other salsa their reply was no. The chips...", "stars": 1}
{"review": "We were out driving and decided we wanted Mexican for lunch and happened across Tia's. It seemed a little run down and inside was a bit gloomy. But the place was packed which is always a good sign! And we were pleasantly surprised. We had...", "stars": 4}
{"review": "Worth every pennyanytime we go in. Well I'm no fan of TVs while trying to eat, I would rather concentrate on the company I'm with, at least the food here is decent.", "stars": 3}
{"review": "Food was good.  Ambiance was average.  Was there to celebrate a birthday, so sat in the back room.  This was my first visit.  My friends have been many times.  I'm sure I'll be back.", "stars": 4}
{"review": "I've been going to Tia's for about 20 years.they are consistently good. friendly folks and cold beer", "stars": 4}
{"review": "We visit this great mexican food restaurant at least once a week.  Enjoy the margaritas and goot eats at a good price.", "stars": 5}
{"review": "The restaurant is located across the street from the Houston ISD Dyer and Delmar Stadiums. We decided to have a before game meal since it was so close. The chips are fresh and good but the entries are not. The food is bland and not...", "stars": 2}
{"review": "I started going to Tia Maria's with my work friends in 1987 when I worked at 610/290.   We eventually all moved to other work locations or moved out of state and lost touch.  Last night, 8 of us had a reunion and everyone wanted to...", "stars": 5}
{"review": "I have eaten there twice with a co-worker who has eaten there for years.  The first time I had enchiladas, the second time I had beef fajitas.  I was disappointed both times and will not be back.  The good things - fresh chips and homemade...", "stars": 3}
{"review": "As long as I can remember this local place has been a haven for me and my family. I have fond memories of my grandmother who always wanted to come here. The chips are thin and crispy and warm. The salsa is had just enough...", "stars": 5}
{"review": "I had beef fajitas.  The meat was good though the onions were a tad undercooked for my taste.  Salsa is cooked and okay but not spicy enough for me.  Very generous portion of guacamole relative to other restaraunts.  I'd go back but wouldn't say it's...", "stars": 3}
{"review": "We had a retirement luncheon here..  although it seemed chaotic at times, the orders were taken promptly and the food was brought out swiftly... all but mine... I had to mention to the waiter I was the only one without my food... the salsa was...", "stars": 1}
{"review": "We found this gem several years ago and quickly became fans. It is basic tex mex, at great prices, with a few good seafood dishes as well. The difference is that the food is always good - always. The staff is super friendly and helpful--without...", "stars": 5}
{"review": "One of my favorites. Always reliable tex mex. Very fast and friendly service. Great food at great prices.", "stars": 4}
{"review": "Even at noon, during the rush of lunch time, service was excellent and food was amazing! Highly recommend you make your way here!!", "stars": 5}
{"review": "A friend and I randomly stopped into Tia Maria's Restaurant & Cantina and we will visit regularly.  The service, drinks, food and low prices were outstanding.  I ordered cheese enchiladas & house margaritas - these are my standard comparison items for first visits to TexMex...", "stars": 5}
{"review": "This is the kind of place that you must visit when you go to Houston.  Not fancy but good authentic Mexican food at great prices.  Mixed fajitas for two for $20!  You will crave the food afterwards. A note for vegetarians:  ask for the corn...", "stars": 4}
{"review": "Food was great, speedy service. Restaurant isn't much to look at it, it's a little run down but that was fine by us since it was clean and food was delicious and reasonably priced", "stars": 5}
{"review": "Food was outstanding and service just as good.  I will return when the opportunity arises.  I had the beef ribs and flavor was great.", "stars": 5}
{"review": "When I lived in Houston in the '90s I would frequent this place at least once a week: I was a college kid,  broke and Tia's fit the bill for us.  The food was great back then and the drinks were strong - everything pretty...", "stars": 5}
{"review": "there was not only live bugs crawling!! thats right crawling!! me and my husband went to eat here and never again not only was there bugs (roaches) in my food there was a hair in my frozen margareta and the owner has the nerve to...", "stars": 1}
{"review": "We eat at Tia Maria's usually weekly.  The food is good and at reasonable prices.  Enjoy Happy Hour too.", "stars": 4}
{"review": "We have been looking for a very good old style TexMex restaurant and Tia Maria's is it. Great service, atmosphere, prices and oh yea, the food is great! Well worth your visit, you won't be disappointed.", "stars": 4}
{"review": "Went here because they have a trio that plays Friday night during dinner. I got the Shrimp a la plancha. Beans and rice were good but there were only a few over cooked shrimp and huge pile of onion and bell pepper on the fajita...", "stars": 3}
{"review": "Roving guitar trio playing Spanish songs.  Good \"homemade\" food, including flan to die for.  This is a very popular spot, so be ready to  wait....but the wait is worth it.", "stars": 4}
{"review": "The food was good, the band was fun.  Not the best Tex-Mex in the world, but it was not bad.  The \"large\" guacamole isn't that large!", "stars": 3}
{"review": "This is one of my favorite Mexican food restaurants in our neighborhood! The food is delicious and plenty is provided. The service is not always on the spot, but that is probably because of how busy they stay. They are always kind, conscientious, and capable,...", "stars": 4}
{"review": "I was very disappointed with this restaurant after the great reviews that I had read.  I am a vegetarian and usually Mexican is a great choice for me but the only vegetarian items on the menu were cheese enchiladas and nachos, neither of these are...", "stars": 2}
{"review": "I have been eating here for about 2 years now after I discovered it. It meets important criteria that I have for restaurants which is good food at low prices. Tia Maria's has a nice atmosphere with a 3 piece mariachi band playing in the...", "stars": 4}
{"review": "My husband and I live down the street and we love this place! Sometimes we wonder if we should go somewhere else because we eat there so much, but we know what we're getting every time we go. They don't have a great happy hour,...", "stars": 5}
{"review": "sweet and comfortable atmosphere, below avarage flavor", "stars": 3}
{"review": "Nice, large portions, authentic Mexican, fast service, a little over averaged priced but different then the norm", "stars": 4}
{"review": "This restaurant is amazingly inexpensive and has good quality and quantity.  The salsa was fantastic if you like it a little spicy.  The Tex-Mex dinner I had was great.  Almost as important, I did not fell like I was being rushed out the door.  Can't...", "stars": 4}
{"review": "Love this place, not gorgeous but I am Latin and this is very authentic and cheap.", "stars": 4}
{"review": "My family and I go to Tia Maria's on Sundays, about once a month or so. We always have good, prompt service and very good food. The servers are always attentive to our needs and try to please us when we have any request. The...", "stars": 5}
{"review": "Tia's has been around for atleast 40 years.  Their crowning glory is that they were open the DAY AFTER Ike, and served food (and thankfully Margaritas) until the gas in the generator ran out.  \nThe food can stand shoulder to shoulder with ANY on the...", "stars": 5}
{"review": "This is our favorite Mexican restaurant. The food is very good.  Service is FANTASTIC!", "stars": 5}
{"review": "A laid back friendly atmosphere. Good margaritas, cold beer, tasty chips and salsa, all at a good price. Illustrate recommend it to anyone anyday", "stars": 4}
{"review": "Poor service, just good enough..what on earth are folks expecting..fine dining. It's fast food for gosh sakes. When you are stuck waiting for the latest flood to end...what you want is food...and not $6.00 bag of chips. Wendy's delivers..reasonable prices for the hungry. That's about...", "stars": 5}
{"review": "The restaurant is small serving snacks. The rates are not high but service is slow. Food is OK. Overall, good option for transit.", "stars": 3}
{"review": "We were on a lay over and decided on a quick lunch and found Wendy's.  The food was good but the service was just ok.", "stars": 3}
{"review": "This place is supposed to open at 4am. Every week they get later and later. Now they are just verbally saying they open at 415am. This kills people trying to get food and catch the early flight.", "stars": 2}
{"review": "The restaurant serves bread and salad at the airport. Suitable for taking quick bite on the go. Limited sitting available.", "stars": 3}
{"review": "I tried the grilled avocado BLT.  Not a great meal. I would have preferred sliced avocado instead of guacamole.  The service was good, but the food was not.", "stars": 3}
{"review": "We always can count on Wendy's to do it right and have it be fresh and taste good. This Wendy's at Hobby Airport was a good choice, since it was large and busy. Even the flight crews eat there, which is a good endorsement since...", "stars": 4}
{"review": "We had an early flight and needed breakfast. It was just right and surprisingly wasn’t overpriced since you don’t have much choice. The potatoes had too much seasoning, but the rest of the meal was enough to get us home.", "stars": 3}
{"review": "Can you tell by now that most of the reviews have this Wendy's at a very low rating.  I agree and actually turned up sick afterwards.  NOT GOOD.  Puking 🤢🤢🤢🤢", "stars": 2}
{"review": "Any place that's still serving Dasani water, I have to question right off the bat. I don't normally like Wendy's, but this one seemed a little... worse lol.", "stars": 2}
{"review": "This is the one in Hobby airport. Limited menu and slow slow slow service.  Took my 25 mins from when i got in line til i got my food, and there were only 3 people in front of me.", "stars": 2}
{"review": "Waited over 30 minutes for my food. The baked potato I ordered sat on a shelve most of my wait time. I witnessed many customers request a refund prior to receiving their food. Very unclean restaurant. I will never walk back through the doors again.", "stars": 1}
{"review": "In a land of $15 rice bowls, and $6 pizza slices, I was happy to find a reasonably priced meal. $7 combos served fast and friendly. Good food!", "stars": 4}
{"review": "We wanted a variation from sandwiches. We ordered three Suprisingly good salads. They were apple pecan, with pomegranite vinaigarette.", "stars": 4}
{"review": "Caught a quick meal at this airport restaurant in between flights.  The food court was busy, however the staff at this Wendy’s was polite and quick on service.  I would use their services again.\n\nDr. Marc\nPS 63:7", "stars": 4}
{"review": "I wasn't wanting a lot to eat and thought a baked potato would work.  I've had baked potatoes at other Wendy's restaurants before and while they certainly aren't gourmet, they have at least been palatable.  That was not the case at this location.  The potato...", "stars": 1}
{"review": "The staff member, Janice, at this airport location that helped us was amazing. She helped us come up with the most economical way to feed our family, since they don't offer kids meals. Also be aware, their frosty machine is currently broken,", "stars": 5}
{"review": "Really I wait In a slow line after flying in and short on time to find out at 8 pm there's no more chili. Also no smaller value menu type items so smallest burger was 1/4 lb for $5. Not happy with service as well...", "stars": 2}
{"review": "While retail space is very high in airports, this Wendy's does a great job of providing good airport prices with good service and consistent food.  The counter staff is pleasant and eager to get your order and move on to the next in order to...", "stars": 5}
{"review": "Perhaps because they are handling a high number of customers and constantly cooking food, our order was made to order and in just 2 minutes. Friendly cashier, this was the best Wendys meal I've ever had.", "stars": 5}
{"review": "My wife and I were travelling through Hobby airport, Houston during a layover. I decided to have lunch and happened upon a Wendy's. The consignment was extremely busy but very efficient and the food was delivered hot and tasty. Staff did not appear to be...", "stars": 5}
{"review": "As far as fast food restaurants go I have once again hand it to Wendy's: they're a cut above. \n\nTe breakfast biscuit was so decadently buttery that it nigh melted in my mouth. Add the sausage and cheese and an you're on to a 4am...", "stars": 4}
{"review": "The food was great!  However, with the long wait times, we almost missed our plane!  Not your typical fast food wait times.  Longer wait time than any Wendy's I've ever been to.", "stars": 3}
{"review": "For the amount of time it takes to get your food, it should be very fresh.  Other than that, it was comparable to any other Wendy's.", "stars": 3}
{"review": "Although the restaurant was busy, the staff were attentive and fast. As expected, my family enjoyed the fries, strawberry shakes, and the cheese burgers. Overall, the service was very good and fast.", "stars": 4}
{"review": "it was good for a quick bite but  the service was not great. The food was fine but nothing that wowed me at this place. Very full during peak hours", "stars": 3}
{"review": "I just visited the Wendys on 9035 West Rd and Beltway 8. I ordered a single with cheese. It took me 5 five minutes to get home. My burger was stone cold and very old. It tasted stale, and the only bite I took left...", "stars": 1}
{"review": "Stopped by Wendy's in the Houston airport on the way back from a recent business trip. Had the basic Burger and Fries. As expected, they were busy. I found the kitchen area to be messy, debris on the floor, fries etc and the employees just...", "stars": 4}
{"review": "Fast delivery, good food at good prices. The place was almost empty....The place was very clean, the restroom smelled good!", "stars": 4}
{"review": "For a quick bite on the run, this Taco Bell shares the paring lot with the recently renovated Hampton Inn (IAH) so it is very convenient for a quick bite on the run.", "stars": 4}
{"review": "Service at this location was very good. Staff was attentive and helpful. We like, it it was close to our hotel", "stars": 5}
{"review": "I come here every month and the staff is always EXTREMELY friendly. They make the quick fast food visit very nice. More places need to be like this. The employees aren't complaining about their job or life like other places. They are professional and friendly.", "stars": 5}
{"review": "tried some of the new items, not bad, but not that great either, but what can you expect from a taco bell", "stars": 3}
{"review": "Clean, fast service, tortillas were fresh, staff very polite.\nMy wife and I like Taco Bell for fast food, and this one is among the best we have been to.  (Our home town of Seattle has among the worst.)", "stars": 5}
{"review": "Probably one of the nicest taco bells i've ever been too every one here is very friendly and patient.", "stars": 5}
{"review": "This is the second time I have tried a breakfast meal at a Taco Bell.  The breakfast burrito with bacon was very good as was the breakfast burrito with sausage.  The place did not get an excellent as it could use a little cleaning maintenance...", "stars": 4}
{"review": "I needed a quick lunch on a very rainy day. I have the Volcon Quesrto box, It was what I order, served fast and was good for Taco Bell. I will return to this location.", "stars": 4}
{"review": "Food was hot and quick. Place was clean. Good location and not too busy on Saturday afternoon. Will go there again if in the area.", "stars": 3}
{"review": "Missed flight on a Sunday evening- after standing in line for hours to be shuttled off to a hotel for the night, the Subway down the street closed early and the staff was rude.  We ended up at the door to this Taco Bell as...", "stars": 5}
{"review": "For a Vegetarian nothing like yummy Bean Chalupas. Please specify that you only need Bean in them and no Meat. Nice Yummy and fresh as usual.", "stars": 4}
{"review": "If you like Taco Bell - the food is a typical Taco Bell.  The Service was efficient, our order was correct, the food was hot and portions generous.  The restaurant was extremely cold, we kept moving seats trying to find some place the air wasn't...", "stars": 3}
{"review": "Went for lunch with a friend. Extremely cheap. Burrito was ok. Staff friendly and courteous. Prompt service. What else do one need?", "stars": 3}
{"review": "Two people ate for $2.50.  The service was fast and friendly. The burritos were really good.  What is not to love?", "stars": 4}
{"review": "Don’t waste your time trying to go through the drive thru if you have someplace to be tomorrow.   One could almost fly to Mexico and get a real taco in the time it takes to get from the speaker to the window which is about...", "stars": 1}
{"review": "The food was cold and greasy. It took almost an hour just to get 2 soft tacos. The dining room was dirty and the floor sticky.", "stars": 2}
{"review": "Drive thru and walk in were not busy on a weekend night, adequate staffing for shift, order taken and filled quickly and accurately. Three signed handicapped spaces (two for vans) and ramp on sidewalk but no push button on doors. Was in a hurry to...", "stars": 4}
{"review": "I just love Taco Bell . No,I don't go here with my wife I usually make a side step into A Bell and grab a meal n go. Love Em.", "stars": 3}
{"review": "Had a taste for taco bell so we stopped for dinner.  Ordered the combos: nachos bellgrande with a crispy taco and Mexican pizza with crunchy tacos.  The dinners were very good.  Everything was fresh and hot and the chips and tacos were crunchy.  I ordered...", "stars": 4}
{"review": "Well, it is Taco Bell and it was excellent if you like Tacos.  I do from time to time and this place had great fast service. I was looking to get in & out in under 5 minutes and I did, so I was happy....", "stars": 5}
{"review": "I live close to this Taco Bell.  The drive thru is always slow, especially at night.  I went thru at 11:23, the other night, and there were four cars in front of me.  It took 30 minutes to get my food.  Absurd.  Another time I...", "stars": 2}
{"review": "Quick, fast food that is a big hit for everyone visiting !. Friendly cashiers and our favorite fast Mexican restaurant.", "stars": 4}
{"review": "We are in love with Taco Bells crunch wrap.  For the last few years, overtime we go to a Taco Bell, we get a crunch wrap.", "stars": 3}
{"review": "I honestly never knew I liked frozen custard until my first visit to Whit’s. They feature an entire menu of mixtures and you can get them in a bowel or all mixed together in a cup, like a milkshake or blizzard. So far we’ve had...", "stars": 5}
{"review": "They always have chocolate and vanilla and then a special flavor of the week and then you mix-in various things like cookies or candy. You can get their cups or cones or their Whitser, which is like a really, really thick milkshake with mix-ins. The...", "stars": 4}
{"review": "Delicious frozen custard and friendly service.  I just wish there was a bit more indoor seating. There were just a couple of tiny tables inside and it was a very small space.", "stars": 4}
{"review": "I love ice cream but soft ice cream is rarely acceptable. Not so at Whit’s. Only one flavor of the week in addition to vanilla. All great. But my favorite is the grasshopper Whitzer. The vanilla with mint syrup stirred in to the cup it...", "stars": 5}
{"review": "had a chance to taste a few different flavors and loved every one of them.  They were creamy and tasted rich.", "stars": 4}
{"review": "Great Custard right on main street. Highly recommend. Custard was delicious and the staff very friendly.", "stars": 5}
{"review": "I’m not fond of custard but this is better than most I’ve had in the past. The custard liners in my group thought it was great.", "stars": 4}
{"review": "Took a walk down Sandusky after a nice meal. Walked in to Whit’s for a cone. \nI had Chocolate\nAnd Wife\nHad Vanillla. Very good. A line out the door that moved very quickly\nWell worth the wait.", "stars": 5}
{"review": "The quality of the product served at Whit's can be summed up in two words... unbelievably fresh and delicious. I ALWAYS get the Hawaiian Luau \"Whitster\" which is a combination of frozen custard, fresh bananas, pineapple, coconut and macadamia nuts. Need I say more? Not...", "stars": 5}
{"review": "The custard is good and there is normally a line. The location is right downtown with no competition for miles. But the staff is under the thumb of a female owner who is very unpleasant. and therefore it is not a fun place to visit.", "stars": 3}
{"review": "Always a major treat to go to Whit's.  Consistently one of the best custard ice cream ever! Love the Bishop's Sundae, my personal favorite but they have an aray of toppings and sundaes and service is pretty swift.", "stars": 5}
{"review": "I think my frozen custard was called that... It was de-licious! Table out front to sit at and enjoy. The help was very friendly!", "stars": 5}
{"review": "Great little place for your sweet tooth!  A small cup is just right after a meal down the street or around the corner.", "stars": 4}
{"review": "Whit's has the best frozen custard I've ever had! If you are an ice cream fan, you'll absolutely love their creamy and delicious frozen custard.", "stars": 5}
{"review": "Well  it didn't cost a nickel, but then what does these days?  We enjoyed some delicious custard dishes with a variety of toppings.  There was constant traffic and it was a little cool outside, but that didn't stop people from enjoying this custard location. The...", "stars": 5}
{"review": "If you`ve never been here before, they will give you samples including the flavor of the week. The shredded chicken sandwich was wonderful.", "stars": 5}
{"review": "While all Whits lack any sense of style or professionalism, the are great at Custard. Just wished there were more flavor options.", "stars": 5}
{"review": "What better ending to a nice dinner in downtown Delaware, Ohio, than a frozen custard at Whit's.  Their weekly special flavors are incredible (my favorite recently was chocolate covered strawberries).  The service is quick and you can sit outside on the main street of downtown...", "stars": 5}
{"review": "We love watching for the flavor of the week and knowing we can always get our favorite Whitser!  There is usually a line but the staff moves quick so the wait is never too long!", "stars": 5}
{"review": "We take our baseball team here all the time and they have a great selection of ice cream and they also serve hotdogs and hamburgers.they are good about getting everyone served in a good time considering our large group", "stars": 5}
{"review": "This shop has tons of toppings that can be put to n top,or mixed into the ice cream. The portions are very generous. There is a different special ice cream every day. There is usually a crowd so be prepared to wait. Outdoor seating area...", "stars": 4}
{"review": "Drive by on any evening in the warm months and there is likely to be a crowd waiting in line or eating and visiting. Don't let the line scare you...it move super fast and there is delicious frozen custard as a reward for your patience....", "stars": 5}
{"review": "Creates custard around!!!  There is not really much space to sit down but we like the fact that you can go outside in downtown Delaware and grab a bench. This is a great location.", "stars": 5}
{"review": "I had the two special flavors on July 4th - birthday cake and I can't even remember the other one because the birthday cake flavor was so good. There were huge pieces of yellow cake and sprinkles in vanilla custard. Delicious!", "stars": 5}
{"review": "Delightful custard (not soft serve, but softer than ice cream) in a variety of unusual flavors served up by friendly people. I was so happy to seem them re-open last month after their winter hiatus!", "stars": 5}
{"review": "This was my first time to this particular Whit's location and the custard was amazing as usual. Please don't ever change a thing. Every bite makes makes me feel like a kid again.", "stars": 5}
{"review": "I'm absolutely in love with custard!! They have different flavors of the week- ALL of them are delicious!! I don't crave ice cream anymore, but I sure do crave Whit's!!! Yummmm!!!!", "stars": 5}
{"review": "It is always a nice treat to go here on a hot Sunday afternoon after church and walking around downtown. The custard is good just wish they would get coney dogs like their location in Granville", "stars": 4}
{"review": "We love Whits... They let you taste the frozen custard before you even buy it.... Such a great place!!!!", "stars": 5}
{"review": "Whit's gives an amazing array of flavors week to week.  If you have a favorite though check the freezer for it.", "stars": 5}
{"review": "Friendly staff! The frozen custard is sooooo good! I would highly recommend giving them a try!! They have a decent amount of flavor selections and toppings too!", "stars": 5}
{"review": "Great place to get some ice cream (custard) in this charming downtown atmosphere. Not much space to dine inn, but we utilized the on-street seating and go here often.", "stars": 4}
{"review": "Clean establishment. Great flavors of the week. Quick service. Prices are average. Since it is downtown Delaware, can be difficult to find a place to park nearby.", "stars": 5}
{"review": "This frozen custard is delicious.  This is a local favorite.  all summer long you will find families sitting out front eating their frozen custard.", "stars": 5}
{"review": "love most of all the flavors-love Battling Bishop sundae!!! great local,easy to walk to once park the car.", "stars": 5}
{"review": "Love to try the flavor of the day. Have yet to be disappointed. Great for a family outing downtown. Try it!", "stars": 4}
{"review": "The frozen custard is absolutely delicious.  With a special flavor of the week, signature sundaes and Whitzers, birthday cakes and pints and quarts in the freezer you can't miss.  There is something to please everyone.  When I need a quick lunch their shredded chicken sandwiches...", "stars": 5}
{"review": "Excellent frozen custard in Delaware. Located on the main street in town. Easy walk from OWU. Few seats indoors, benches outside.", "stars": 5}
{"review": "Best ice cream in Delaware.  Very good sundaes.  Maybe a little pricey, but oh so good !  Get a scoop and sit on one of the street- scape benches out front of shop and enjoy the evening.", "stars": 4}
{"review": "They have a new flavor every week while always serving chocolate and vanilla. Black raspberry chip is the best. If you plan to go to whits, get online and check the flavor calendar. Make sure you go when the flavor of the week looks good...", "stars": 5}
{"review": "What's not to like about a frozen custard treat? Nothing. Our local Whit's is a great place to take care of your sweet tooth or cool off on a really hot day. The frozen custard is creamy good and if you're a toppings kinda person...", "stars": 5}
{"review": "Great Service, friendly staff. You need to try the Almond Joy flavor absolutely the best . Highly recommend this place for everyone", "stars": 5}
{"review": "The ice Cream is great and the service is very friendly.  They have a very small cone for our 2 year old and it is free.  Great value", "stars": 5}
{"review": "A great frozen custard place in the heart of downtown Delaware. The flavor of the day, old standbys chocolate and vanilla along with a variety of mix ins and toppings make this a favorite of young and old!", "stars": 5}
{"review": "We love how smooth this custard is!  The cookie and ice cream sandwiches are delicious with the black raspberry chip custard.  Also, the \"Blizzard\" like thing they have is good BUT we are always disappointed if we get anything bigger than a small because there's...", "stars": 4}
{"review": "It may not rhyme, but it is scream worthy! Each week offers a new special flavor. In the Delaware Ohio location, there is always a line and people sitting on benches or sidewalk tables eating Whits and watching the world go by.", "stars": 5}
{"review": "We always have loved Whit's!  We appreciate that they always offer samples of the Flavor of the Week.  I haven't tried anything I didn't like there.  It is so much smoother and creamier than ice cream.  The servings are plentiful and filling, and the prices...", "stars": 4}
{"review": "LOVE everything I have ever had at Whit's!!!  The almond joy custard is the best, but you must love coconut!", "stars": 5}
{"review": "Wonderful frozen custard. Very creamy. Vanilla and chocolate always available. Weekly special flavors. Worth stopping for!", "stars": 5}
{"review": "I wish I could give this custard store two different ratings because the custard is delicious. Creamy...full of flavor...good sized portions...rich...spot on. My test for any custard or ice cream is plain old vanilla, nothing mixed in and this was fantastic.  If I were basing...", "stars": 4}
{"review": "The Whit's chain is a good one, delivering fresh and friendly frozen items with a weekly flavor and a huge variety of mix-in/sundae possibilities. This location in particular staffs enough people to manage the demand fairly well, and they tend to stay open a little...", "stars": 4}
{"review": "I was in Delaware one week and visited this small establishment 4 times! I like ice cream, but I LOVE Whit's frozen custard. It is just like the frozen custard that I grew up with...deliciously smooth, cool and creamy. You can get it plain or...", "stars": 5}
{"review": "It's frozen custard..... need I say more. Lots of different variations on the 3 flavors (chocolate, vanilla and flavor of the day) offered. Home made right in front of you, what more could you ask for?", "stars": 5}
{"review": "Whit's Frozen Custard is simply the best custard ever.  They have amazing flavors like, Almond Joy, Buckeye and Sea Salt Carmel.   I would highly recommend.", "stars": 5}
{"review": "Better than any ice cream you'll ever find. The Buckeye Whitzer (peanut butter and chocolate flurry type dessert) is to die for. The line here is usually out the door, but on a warm summer day, I don't mind waiting!", "stars": 5}
{"review": "Service is always fast and friendly.  Chocolate and Vanilla is always available along with a weekly flavor.  Have had some of the hot food and it is delicious as well.", "stars": 5}
{"review": "Very crowded and small and a bit of a wait when we visited, but we were able to sit outside. Service was very slow, but patience and understanding must be practiced by customers in this day and age of understaffed restaurants. However, the food was...", "stars": 5}
{"review": "Sitting inside is counter only. Good coffee. The mushroom omelette was tasty. Blue plate eggs toast potatoes. Potato's alright. \nKnown for Cinnamon roll so son had to try it, his words, \"was not flaky, bready, didn't really have layers. On par with cinnabun. Icing better...", "stars": 3}
{"review": "I really wanted a GOOD burger, so I looked online for good places near me and the internet did right by me. So good, perfectly cooked to my specs and a toasty bun.  My hubby is vegetarian and so many places have nothing for him....", "stars": 5}
{"review": "This place has some amazing food, the place is small but the quality is incredible. The people are pretty nice too. I would always recommend this place. My favorite is the Rueben omelet", "stars": 5}
{"review": "The hamburger Inn has delicious food, fun atmosphere, and great service. Today, Angela was our server, and she was very accurate, kind, and courteous. We really enjoyed our lunch on their front patio. The mushroom and Swiss hamburger was delicious!", "stars": 5}
{"review": "What a great little place for breakfast.  Old style diner set up, quick and delicious.  Very reasonably priced", "stars": 5}
{"review": "Quality and Taste of food has gone downhill in the past year. At first I thought it was a bad day but after 2 more times of dining it’s the kitchen! Food lacks flavor and/or not cooked properly. Only item that has stayed the same...", "stars": 2}
{"review": "It is hard for me to give a diner five stars simply because it is just that - a diner. I might be a food snob, but this place is special. We were headed home from our vacation in Columbus and couldn't find anywhere to...", "stars": 5}
{"review": "Friendly little place downtown, the seating is unique as it community seating no single tables unless you sit outside (Monday seating outside was closed due to limited staffing).\n\nI had the hangover burger excellent, and the waffle fries were ok; if the server was on...", "stars": 5}
{"review": "I absolutely love how homey and lonely this restaurant is!! We had amazing service (from Katie) and absolutely loved the food too!! One of my favorite things about this place other than the service is the ability to watch the chef make your food!", "stars": 5}
{"review": "We had a late lunch here. Diner was not crowded. All staff wore masks. It's all counter seating - three sections I think. Menu had a very good selection of burgers, subs, and salads. We had a bacon bleu cheese burger and gyro \"burger \"...", "stars": 5}
{"review": "Good service,  good food, very reasonably priced, lots of food for the money.  Cinnamon rolls were amazing.", "stars": 5}
{"review": "I love greasy spoon diners and this place is one of our family’s favorite places to eat. The burgers here are very good and so are the fresh cut fries. My kids have had great (and large) omelets here, we love the giant cinnamon rolls,...", "stars": 4}
{"review": "Had breakfast here for the first time 50 years ago as an OWU freshman and they had been serving customers for nearly four decades before that! \n\nThe menu is varied classic diner comfort food - reasonably priced, adequately portioned, and straight forward preparations. No tables...", "stars": 4}
{"review": "Everything was great, the breakfast was awesome, very quick and hot. The service was super, and very friendly the environment.", "stars": 5}
{"review": "Ordered a double burger medium rare. Was the worst sloppiest over priced over cooked burger I've had. They didn't give me napkins. STAY AWAY!", "stars": 1}
{"review": "This is the best diner in the area great food very reasonable prices. Very friendly servers and write downtown with easy access to all the stores", "stars": 4}
{"review": "Walked in to a very interesting, unusual layout. The tables were in a U shape where the waitress could walk in the middle and serve everyone with a simple pivot. I had a 1/2 lb Mushroom/Swiss burger. I though it interesting that they served their...", "stars": 4}
{"review": "This place is a throwback to a much earlier time.  Seating is along several U-shaped counters.  Expect to get to know some new folks.  The burger was great.  However, the server asked how I wanted it cooked and so I requested medium.  It was much...", "stars": 4}
{"review": "This place is outstanding and a must visit place.  There food is out of this world good and will leaving you wanting to come back.", "stars": 5}
{"review": "First visit to the diner and we were looking forward to it after hearing all the positive reviews. \nOur visit, unfortunately, wasn't that good. We ordered apps for before our meal and I asked the waitress to please ensure we get the chance to finish...", "stars": 2}
{"review": "My family decided to stop here for Breakfast on a Sunday morning while visiting.  All the reviews raved about the cinnamon rolls.  I am also going to rave about them. There were fantastic! You could have them warmed or grilled, both ways were awesome. The...", "stars": 4}
{"review": "Hamburger Inn is a landmark in Delaware. We love it best late at night after bar hopping! But the burgers are great anytime. And they are famous for their grilled cinnamon rolls.", "stars": 4}
{"review": "Here's where you can destroy yourself with cinnamon buns and milk shakes of immense size and deliciousness, while being waited upon by a very friendly staff.    The menu is a little skimpy on the veggie options, but my wife enjoyed the portabella sandwich, while I...", "stars": 5}
{"review": "Had the most amazing Rueben omelette at hamburger inn. It is a great location for breakfast with absolutely delicious and reasonably priced food. Would highly highly recommend the Rueben omelette.", "stars": 5}
{"review": "Seating at the Hamburger Inn is all counter seating.  It feels as if you stepped back in time to the 1950s or 60s.  But the food is delicious and it's a fun spot to grab lunch.", "stars": 5}
{"review": "Delaware is a town that takes you back in time and nothing is better than a diner that is 87 years old.  True nostalgia and a greasy spoon with old time favorites. Sitting inside may be hard as they are stools so we sat outside...", "stars": 5}
{"review": "Took too long to get our sandwiches...was asked how I wanted my burger.  I said Medium, it was cooked so well done, it was rubbery.  Fries were limp, greasy, tasteless and tough.  We went because of the good rating from Trip Advisor.  Mistake.  Also, the...", "stars": 1}
{"review": "This is the sort of classic diner you wish every town had. The floors and walls could use a makeover, but the service is fantastic, the burgers are pretty good, the fries are great and the cinnamon rolls are out of this world. I even...", "stars": 4}
{"review": "We were recently introduced to this place by several baseball friends.  There's not a ton of space, and we visited on a Saturday night.  The area was hopping!  Our baseball group ended up dining outside since there was no room inside.  Burgers were amazing and...", "stars": 5}
{"review": "Place seemed kinda seedy inside, but service and food was great. Daughter and i had chili dogs and were not disappointed. Husband had a hamburger with egg on it. My dad had a chicken salad sandwich and he liked it. Waitress was super attentive to...", "stars": 4}
{"review": "Something just fantastic out of the past. Looks like it hasn't changed in 75 years. All food scratch cooked . Real fries, real milk shakes, good waitresses. fair prices.  If you don't like the original old school look don't go there.", "stars": 5}
{"review": "Well...minus the time machine, I got to take a delightful trip back to my childhood.  This is a TRUE diner.  First time visit but certainly not the last.  Service was good, food was good, price was right.  My husband really enjoyed his Hangover Burger and...", "stars": 4}
{"review": "We'd been looking forward to trying this place because we love divey diners!  We drove here for dinner and had the special (burger with chorizo), bowl of chili and fries and a breakfast bowl of sausage gravy over biscuits with 2 eggs on top.  The...", "stars": 3}
{"review": "We went on a Saturday night for supper and we sat outside.  The inside is the 1930's diner but we just wanted to eat.  We've been on the road for 40 days and I've been looking for a good chef's salad and i finally found...", "stars": 5}
{"review": "Hamburger Inn is a unique place. Most items seem made from scratch Seating is diner style with U-shaped counters that encourage conversations with everyone sitting around you. The house made cinnamon roll was absolutely delicious and the waitress gave this to us \"on the house\"...", "stars": 5}
{"review": "This is a real 50s style diner with all-counter seating. Fast, friendly service and great classic diner food at reasonable prices. Breakfast served all day. Outdoor seating when the weather is nice. Stop by and check it out.", "stars": 5}
{"review": "Hamburger Inn is a local staple. It's definitely a diner, but they have unique menu options. I love the portobello mushroom sandwich for example. Their icon is probably the home made cinnamon rolls they sell, delicious as french toast ;) Whether/whenever you're looking for breakfast,...", "stars": 5}
{"review": "We visited here a few years ago and remembered how good it was. Did not disappoint! Great chicken noodle soup. Burger cooked perfectly with great, fresh bun. Chicken fried steak very good. But out of bacon wrapped meatloaf 😢. Loved the \"face\" salad", "stars": 5}
{"review": "Usually have to include a grilled cinnamon roll and it is always good.  The eggs were cooked to perfection and the cheese omelet topped with sausage gravy was put together well.  Service has been known to suffer when it gets busy but no problems on...", "stars": 4}
{"review": "A staple of Delaware. Great breakfasts, but limited menu choices.\n\nLunch and Dinner are about the same....good. They have bar drinks, but I rarely think they make a cocktail or serve a beer! Would be nice if they had tots and more salad choices.\n\nThey...", "stars": 4}
{"review": "Really enjoy having breakfast at this blast from the past restaurant Counter only seating with great service with a wait staff that keeps your coffee cup fun . Good breakfast at a great price and cinnamon buns you must try .", "stars": 5}
{"review": "Was leary when we came in and seen how the tables were set up. But the service was top notch! (thanks Shelly!) quick delicious hot food! Plus the cinnamon roll was hands down the best cinnamon roll I have ever had! We had our first...", "stars": 5}
{"review": "The people at Hamburger In are great.  The owner really gives back to the community!  the food is good. A MUST try is the cinnamon rolls and milkshakes.  Not to mention the burgers and omelets as well.", "stars": 4}
{"review": "Our first visit and not our last.  \nHad a bacon cheese double burger with fries and a soft drink.  Tasty burger and crispy fries. Bun was good but I was really full after so I might skip the bun next time. \nMy wife got a...", "stars": 5}
{"review": "You feel like your stepping back in time a bit with this joint. The food is always fresh, plentiful, and served hot. I’ve become a creature of habit with their mushroom and Swiss burger. They have a big menu and lots of selections. Oh, and...", "stars": 5}
{"review": "great burgers and milkshakes! Everything is god on the menu. You must have one of their cinnamon rolls...", "stars": 5}
{"review": "As an Ohio Wesleyan University alumnae (1977-81), I have fond memories of this Delaware famous diner... The good but cheap food, the nice ladies that served at the counter.I loved the burgers, their pancakes and sausage. Actually I have not been there since I graduated...", "stars": 4}
{"review": "This is an old-timey diner with a series of wrap around counters instead of tables, and vinyl covered stools that spin enough to irritate parents.  Properly seated, you can watch the food prep at the grill in back. The wait staff is attentive and entertaining....", "stars": 5}
{"review": "Enjoyed dinner before a college football game in Delaware. Food was fantastic and eating in a diner that was once a speakeasy in the early 1900's was an experience. Most all seating was bar stool seating and you could watch as your food was prepared....", "stars": 5}
{"review": "had a great burger.  So thick and cooked the way I like.  It was so big and loaded that I couldn't even put it down once I picked it up.  The fries were really good, too, as was the cinnamon rolls.", "stars": 4}
{"review": "Love the atmosphere!  Great service, food, and the best cinnamon rolls...hands down!  Also, they’re open 24 hours every Saturday!!!", "stars": 5}
{"review": "OMG! Gotta try the homemade grilled cinnamon rolls with maple icing. Huge, warm and delicious. Yummy.\nOld style counter service with good food.", "stars": 4}
{"review": "My husband and I stopped there for lunch for the first time and we were pleasantly surprised. We are always ready for a great hamburger and that is what we got! There is only sit up at the counter seating, so don't expect tables. You...", "stars": 4}
{"review": "Loved everything about the place from the old diner vibe to server, Caitlyn, to Megan to the food.  Onion Rings were the Best! Hamburgers done to perfection.  Because we were first timers we received complimentary grilled cinnamon roll for dessert- YUMMY!   Will definitely visit here...", "stars": 5}
{"review": "It’s got the great small town diner atmosphere in a city with a lot going on.  The burgers and fries are fantastic and the cinnamon rolls in the morning are a must try.  If your lucky, you may be able to get one for dessert...", "stars": 4}
{"review": "Friendly little place with friendly staff. Must check their silverware. Many years ago I rated their meatloaf for a major mid-west radio show and it was excellent. Sadly, their latest emaciated offering was badly burnt and inedible. The vegetable medley had been well defrosted and...", "stars": 2}
{"review": "Hamburger Inn DIner is a local favorite in Delaware due to its exceptional cinnamon rolls, large portions, and communal feel. Going any morning, you are likely to find a bit of a wait at the counter and on the patio out front. The place can...", "stars": 5}
{"review": "Stopped in for lunch after hearing so much about this place. It appears to not have changed much in the 80 years it’s been opened.  Burger was average, but the bun appeared to be homemade and was quite good.  Tried the Cinnamon Roll which was...", "stars": 3}
{"review": "Got what we expected, old time feel with good diner food. Hannah was beyond pleasant and helpful. The fries were outstanding. Only complaint was the sauce for the gyro needs some work. Will definitely visit again.", "stars": 4}
{"review": "Charlene was an excellent server/hostess. Always checked on us and made sure we never went without what we needed.", "stars": 5}
{"review": "Let's say we left after finishing our meal feeling full and satisfied. I had the bacon cheeseburger which was delicious and savory. I couldn't figure it out but there was a special spice to their burgers that made them amazing. \nOther than the great tasting...", "stars": 5}
{"review": "Great place to stop for huge portions of delicious diner food. Seating is limited, but the atmosphere is cozy.", "stars": 5}
{"review": "Hannah was my waitress and she moved with the speed of lighting to serve me with drinks and piping hot chicken tenders!! What a great job!!! Would definitely recommend the milkshakes and cinnamon rolls!!!", "stars": 5}
{"review": "Menu items are plentiful, hot food is hot and cold food is cold. Staff is friendly, prices  reasonable, and portions are sufficient. Famous for their cinnamon roll, as is, grilled or warmed up, your choice. Would recommend to anyone who likes the diner atmosphere and...", "stars": 5}
{"review": "I had lived in Delaware 22 years before I made it to the Hamburger Inn. I had the fried pickles and a reuben sandwich. Both were amazing and I can't believe it took me this long to try the place out. Definitely not healthy food...", "stars": 5}
{"review": "I have been coming here for 30+ years and I always get great service and amazing food. Shelly is by far the nicest waitress there, thanks!", "stars": 5}
{"review": "19:15 4th of June 2018,This shop's workers had no service for us.\nSo my family felt so bad. After 5 minutes we left this shop.\nI do not recommend this store any more. \ni guess this store has enough customers.", "stars": 1}
{"review": "We are moving to Delaware from a Columbus, OH suburb. On our trip up there today we decided to give it a try.  First impression, a little bit of a greasy spoon appearance. Still, we sat down at the bar, discovered there was wine on...", "stars": 1}
{"review": "This is a must visit when you come into Delaware.  It's traditional diner food, but you have to try their cinnamon rolls!  They.  Are.  Huge. \n\nThey are probably my favorite place in Delaware to get breakfast, it's just so difficult to find a place to...", "stars": 5}
{"review": "Sadly, the last few times we have gone here, it just seems like the quality of the food has really gone downhill. It also seems to be really lacking in cleanliness!!! It's a shame too cause this was one of our favorite places to go....", "stars": 2}
{"review": "This is a cute little diner with delicious burgers and fair like fries.. i even got by burger is a lettuce wrap..we spent $33.50+ tip for 3 people that included ice tea and two Pepsi's our waitress was wonderful!! We even got a free cinnamon...", "stars": 5}
{"review": "Love all the food I have ever had. Hamburgers with homemade buns. Fresh fair style French fries. Chicken Pot pie. Can’t wait to try Breakfast.", "stars": 5}
{"review": "Great place to experience...if you go on a nice Saturday afternoon you should expect to stand and wait for a seat. You have to embrace this as part of the charm...great food and hard working staff...classic diner with a few menu surprises...", "stars": 5}
{"review": "Family and I visited recently.  I had the bacon blue cheese burger, hand cut French fries, and an ooey, gooey, cinnamon bun that was grilled. Food was really good.  Service was attentive.", "stars": 5}
{"review": "My husband and I stopped in to try ...what else...but their hamburgers!  The sandwiches and fries were very good.  We also tried the grilled cinnamon roll, which was also good.  The people were friendly, and the restaurant clean.  We really enjoyed the diner atmosphere and...", "stars": 4}
{"review": "This was my first visit to the Hamburger Inn Diner. It reminded me of a luncheonette counter with all of the stools, no tables.The atmosphere is fun and everyone is in a good mood. And why not? The warm cinnamon buns are amazing. I had...", "stars": 4}
{"review": "We visited for lunch this unique spot in Delaware Ohio.  The staff were very friendly, helpful, and fast. The food choices were ample and the quality and quantity of what we ordered were excellent!  Go for the cinnamon roll and stay for a great burger...", "stars": 5}
{"review": "Great, friendly staff. Awesome burgers and the cinnamon rolls are to die for! Anxious to return to try more items from their menu.", "stars": 5}
{"review": "It’s a diner. You’re gonna sit on a stool at a counter. The waitresses are going to be quick and attentive. The burgers are going to be amazing. But don’t you dare leave with out having a grilled cinnamon roll topped with ice cream!!  Wow!!...", "stars": 5}
{"review": "Great place to experience history as seated along a counter with townies and travellers elbow to elbow.  One can not help to make conversation with perfect strangers as all find commonality in the love of the experience....and the love of the cinnamon rolls.", "stars": 5}
{"review": "The Hamburger Inn has operated in Delaware, Ohio, since 1932.  It's an old style diner with stools around counters, and they are known for their breakfasts and lunches.  At breakfast, the cinnamon rolls are a delicious treat and large enough to share, especially if one...", "stars": 4}
{"review": "this restaurant takes you back to the stools and close up servers/ You sit in rows that curve so the the server can reach your plate. it is no place to take a date or anyone dress up too much.  just good home-town.  located near...", "stars": 5}
{"review": "We love the Hamberger Inn, it is one of the originals in Delaware.  It has counters and stools only.  All homemade food and soups.  You can get breakfast, lunch or dinner any time they are open.  They also have an outside patio so you can...", "stars": 5}
{"review": "Very nice small place. Had the old diner feel but felt like we have been going there for years. Food was really good, almost all was fresh homemade cooking. Service was excellent even got a free homemade cinnamon roll for first time visit. It just...", "stars": 5}
{"review": "Katie was our server and she was great! Great food and fast! We'll be back! Everyone was friendly and efficient. This is a must if you're in town!", "stars": 5}
{"review": "Erica Ware waited on me and did an outstanding job explaining the menu! The food was delicious and hot! If you are ever in Delaware and are looking for great food at a reasonable price you can't go wrong at hamburger inn and a must...", "stars": 5}
{"review": "Great Burgers, great service and friends. Have to try home made pies and cinnamon roles. Food made to order.", "stars": 5}
{"review": "First time at Hamburger Inn.  Had heard a lot about it, so we thought we'd give it a try.  The place is small, the seating is barstools unless you want to sit outside, and it's very busy.  The staff is friendly, the food is good,...", "stars": 4}
{"review": "I've been here several times. It's always good and the service is always great. I wouldn't say it's the best food ever but it's consistently good and the atmosphere is fun. Their cinnamon buns are great.", "stars": 3}
{"review": "We were in town for a near by auto race and stopped in Hamburger Inn after a long day at the track.  A true American diner. Only seating is at the counter, just like back in the day. Breakfast, lunch and dinner served all day....", "stars": 5}
{"review": "Love their milkshakes cinnamon rolls and hamburgers of course. If you're strolling down downtown Delaware you have to stop at the Hamburger Inn.", "stars": 5}
{"review": "Outstanding menu, so much to choose from. Hamburgers are great and the French fries are very tasty. We also tried the onion rings which were very good. A small friendly casual diner that brought back many childhood memories.  The wait staff was attentive and very...", "stars": 5}
{"review": "Mom and I  ordered Chicken Pot Pie. It was hot when it was brought outside to us. Half hour later or less it was extremely hot to eat. I am glad it was fantastic but it shouldn't be so hot. Mom kept blown on it...", "stars": 4}
{"review": "Great old time counters with best burgers in Delaware.  Their breakfasts are to die for and bet you can't eat it all.  Don't pass on the cinnamon rolls", "stars": 5}
{"review": "I have been wanting to come back here and eat for months now (since I first saw the place).  We live about 60 miles away and last time we were here everyone wanted to eat across the street. The wait was definitely worth it.  The...", "stars": 5}
{"review": "Hamburger Inn Diner really is a diner! No tables, just stools at the counter. I had a more modern burger--the Greek burger--and it was delicious. The service was fantastic and the pricing reasonable.", "stars": 5}
{"review": "Great burger and milkshake.  The waitress was very attentive and I loved all the old pictures and paraphrenalia inside.", "stars": 5}
{"review": "Authentic Diner established in 1932, you need to stop and have a quick bite at the counter! Great atmosphere inside or out plus the food is great. Serving Pepsi products (sorry Coca Cola lovers) this is like stepping back into the world war 2 era...", "stars": 5}
{"review": "I stopped by the Hamburger Inn on my way back from Columbus for breakfast, after being referred here by staff at the hotel I was staying at and I was not disappointed with my experience. Now, it is very small and if you go during...", "stars": 5}
{"review": "Stopped for a quick bite. Turned out to not be quick at all. Ordered drinks. Took 15 minutes to learn no glasses were clean. Waited some more. Finally got to order after sitting for 40 minutes and the wait for food began. Sadly, wasn't worth...", "stars": 1}
{"review": "I just had an amazing greek omelet here, filled my entire plate it was all I could do to eat it. The service was friendly and fast. Was just a short walk from OWU campus. Great find!", "stars": 4}
{"review": "Try the gyro burger for something different. The atmosphere is stools and counters, but the classic burgers and thick shakes make up for the lack of ambience. College kids, families and friends all mixed to together. Have fun eat here if you are in Deleware,...", "stars": 4}
{"review": "We have eaten here for about 50 years, and over the course of time has gone from one of our favorite diners to \"ok, we'll give it a try once a year to see if it has gotten any better.\"  A recent visit showed that...", "stars": 4}
{"review": "Went to Hamburger Inn Diner on Saturday June10th. Arrived at 5:30 pm and sat outside at a table was a perfect evening to do so. there was a couple sitting at another table who had a pitt bull pup with them, was annoying for they...", "stars": 3}
{"review": "Perfect stop downtown for a Burger and onion rings. Waitress said everything was made fresh and it tasted as such. Very delicious. Seating outside on the covered sidewalk on a beautiful evening was a plus!!! Definitely check this one out.", "stars": 5}
{"review": "I assumed that a place called, The Humburger Inn, would have awesome burgers.  I was wrong.  This small, hole-in-the-wall place is quaint, but the burgers were below average.  \nThey were McDonalds sized-patties and not very tasty.\nI hear the cinnamon rolls are the real reason...", "stars": 2}
{"review": "Nothin good be finer than an original diner. This is not a \"fake\" representation, but truly authentic with only counter seating, well worn counters, friendly wait staff, and a faint smell of cigarettes in a former time in history. \n\nThe food for breakfast was just...", "stars": 5}
{"review": "This is a local favorite of mine! Very good burgers. This place definitely has that old school diner feel. Always have good conversations here with strangers and servers alike! Food and service get a high grade for me, the only thing I would warn you...", "stars": 4}
{"review": "Had the blue cheese bacon burger with fresh cut fries.  Yummy!  I also took 6 of their cinnamon rolls home for breakfast tomorrow.  Can't wait!", "stars": 4}
{"review": "Everything is always very tasty and you never leave hungry. \n\nGreat staff, great patrons and atmosphere. \n\nJust think the breakfast has gone up in price as several items require sides as add-  ons.\n\nStill though,  great place to dine any time of the day.", "stars": 5}
{"review": "My wife and I visited the Hamburger Inn for breakfast this morning. We have lived in Delaware for 10 years but this was our first time (I've recently retired and taking full advantage of my new freedom).  The service was great and the food excellent!...", "stars": 5}
{"review": "Looking for a hamburger and a super cool diner atmosphere. Good food, the server was efficient (she was a veteran). Price outstanding and downtown Delaware a neat place to be.", "stars": 4}
{"review": "First time ever eating here!  Loved it.  Buckeye milkshakes are great!! Many shops around.  I had breakfast and a friend had a sandwich and fries.  Pics are on another phone or I'd include in this post.  Everything made fresh and cooked to order. No complaints...", "stars": 5}
{"review": "As a Delaware resident I find myself getting breakfast almost every Sunday. The cinnamon roll is something you have to get whether you do fried or warmed up. It's also great to take home.\n\nThe lunch/dinner is great too. I recommend the double bacon cheeseburger....", "stars": 5}
{"review": "We stop in for breakfast or lunch here when out for a day trip. Fantastic cinnamon rolls made fresh and a wide choice of breakfasts. Lunch is good to at very reasonable prices. We go to lunch here for.....their hamurgers.!", "stars": 5}
{"review": "I love this place! Old style diner, the staff was great, friendly and quick. The food was good, came out timely and hot. I had the hash while everyone else had a version of eggs, potatos and meat! No complaints - finally had silence from...", "stars": 5}
{"review": "This is a place that has been around for a long time.  We had eaten here before but thought we would try it again as we were driving through.  Staff were great, food was good too.  Huge menu with anything you could think of.", "stars": 4}
{"review": "If you want to roll back time and enjoy the way things used to be, you should get to Hamburger Inn Diner. The atmosphere is great and if you can be seated in Kaylyn's area, even better! Hamburger Inn Diner is fortunate to have someone...", "stars": 5}
{"review": "The HI Home fries with cheese and onions, chocolate milkshake and a sliced and grilled cinnamon roll are the three things on my list for my last meal on the planet, whenever that may be! Just a great, classic diner downtown....not a faux-retro experience like...", "stars": 5}
{"review": "This place is very clean, the staff are as nice and engaging as can be, and the layout is truly the exact same as Old fashioned diners.\nI came for breakfast, I tend to be a very healthy eater, and I am a vegetarian. I...", "stars": 3}
{"review": "The daily special was really good, a breakfast burrito. The waitress kept my coffee cup full. A nice way to start the day.", "stars": 5}
{"review": "Had heard great things about this restaurant.  While the food was OK, it was nothing exceptional.  Don't feel the need to go again.", "stars": 3}
{"review": "This place has been around forever and I still think its better then the new place across the street. Don't let the old look fool you its is old but good counter setting.like a grill should be.", "stars": 4}
{"review": "We decided to try Hamburger Inn.  The service was horrible - we sat outside and the waitress kept forgetting about us.  She never checked on us to refill our drinks and then took forever to come get our check.\n\nThe table had what we thought...", "stars": 1}
{"review": "We saw this diner when eating at another nearby location and walking around Delaware after dinner. We decided to come back to eat there before leaving the area, and it was not a bad decision.\n\nThe storefront is simple and non-descript, with a few sidewalk...", "stars": 5}
{"review": "My boyfriend and I went out to breakfast. The diner was busy. Our service was poor. Maybe our server was new... \n\nWe were given our food, which was good, but our coffee was never refilled. Then we get the bill without being asked if we...", "stars": 2}
{"review": "The first thing you should know is that this is a real diner experience with real diner food. Don't go in looking for a table, inside it's all bar seating. They have a few tables outside when weather permits. The second thing you should know...", "stars": 4}
{"review": "I rated the Hamburger 5 Star because of the service, food and atmosphere (friendly).  It is not a fancy high-end place, but the food is good home cooking and the prices are great.  This morning, we had French toast, one of regular Texas slices and...", "stars": 5}
{"review": "Always a good choice. We went in during a \"First Friday\" event when everyplace nearby is packed. Even with a full house we didn't have to wait for a seat. Our server Emily was great.  She was taking care of a bunch of people, but...", "stars": 5}
{"review": "It doesn't look like much on the inside but this place was great.  We walked in and the people behind the counter immediately treated us like we were one of their regulars.  We had the grilled cheese sandwich with onion rings and a cheeseburger with...", "stars": 5}
{"review": "We camp seasonally nearby and discovered the Hamburger Inn this year. We have been here several times. The cinnamon rolls are awesome . Actually everything is awesome. We mostly come for breakfast but dinner is great too. My daughter loves that we can get breakfast...", "stars": 5}
{"review": "Business trip to Delaware and I missed breakfast. I was told by locals about the place. Had brunch at 1030 and went in with a bad mood. I left so happy I couldn't believe it. Staff was happy and friendly and the customers were too....", "stars": 4}
{"review": "The seating is interesting in that it's a counter and bar stools. The stools seem to be placed a bit far from the counter though so I was a little uncomfortable. The menu is pretty big! Lots of choices! I had the bacon blue burger....", "stars": 3}
{"review": "I stopped for lunch.  As soon as I walked in the door, I knew this was the place for me - loved it.  I had the bacon-wrapped meatloaf - it was great.  My daughter had the hamburger and enjoyed that as well.  My meatloaf was...", "stars": 5}
{"review": "After long runs at Delaware State Park, the guys and gals of Team Possum head to Hambo for amazing breakfast/lunch. I'm a big fan of the omelets and burgers. And you of course can not visit without finishing the meal with a warm cinnamon roll....", "stars": 5}
{"review": "The four of us had some quality food for brunch. From sausage gravy and biscuits, the Hangover Burger, eggs, bacon & toast to a three egg omelet. Quick, polite service from Tonaya kept the coffee flowing.", "stars": 4}
{"review": "My son had a \"hangover burger\" that included bacon egg and cheese and he said it was a game changer. So great! The perfect end to a long day of running around the lacrosse field. He could not have been happier. I also enjoyed my...", "stars": 3}
{"review": "We were with a large group and stopped in for lunch.  The restaurant is truly an old fashioned counter style diner, so we all were not able to fit inside, but they had enough seating outside to accommodate the rest of our group.\n\nService was...", "stars": 5}
{"review": "Haven't been to Delaware (where I grew up in the 1960's) for nearly 30 years so I had to get a cinnamon roll.  They now have outdoor seating as well as the original U-shaped counters.  Trip down memory lane!", "stars": 5}
{"review": "No tables, just old-fashioned diner seating.  Quick service, cheap food.  NOT for you if you're on a low-calorie, low-fat, low-carbs, low-anything diet.  I had breakfast there for three mornings and discovered their old-fashioned biscuits and gravy.  Thick gravy, big biscuits.  Good job, Hamburger Inn!", "stars": 5}
{"review": "Yum!  Especially the cinnamon rolls.  Go when you are not in a hurry.  Fantastic service, food and atmosphere.", "stars": 4}
{"review": "This restaurant is so awesome.   Sarah was very friendly and fast.   Great food!  One of our favorite places in Delaware.   Corned beef hash is from scratch.   The hand cut fries are like fair fries.   Delicious!", "stars": 5}
{"review": "I would have liked to give a good reason to visit here as I do like these types of restaurants. However my experience was subpar at best. First i did not be get what I ordered despite repeatedly saying what I wanted. Then they don't...", "stars": 3}
{"review": "We lived in Delaware for years, and came back for a visit, one of the first places I wanted to go was the Hamburger Inn for a grilled cheese with bacon, and home cut fries!! It was as awesome as I remembered it to be!!...", "stars": 5}
{"review": "First - pretty nice diner.  Right in the main drag in downtown Delaware. Inside seating is a one of those old school counters that doubles back a couple times so that a server can get to twice as many people.  But when we went, no...", "stars": 4}
{"review": "I had the Gyro, and it was great! My waitress was Olivia and she was very nice. I didn't realize they had a full bar as well 😀, I ordered a Bloody Mary that was very good. I highly recommend and the prices were very...", "stars": 5}
{"review": "Overall, good food. Total greasy spoon, but hit the spot. Staff is friendly. Portions are good. Comfort food. Definitely a breakfast or lunch joint.", "stars": 4}
{"review": "A local good eating place. Prices are a little heavy for breakfast but the food is pretty good. Parking can be tricky but worth the walk.", "stars": 5}
{"review": "This place has great burgers, hence the name. My favorite is the hangover which has a fried egg on top. There are 3 counters with swivel stools surrounding three sides. Seating is community style which encourages conversation with your neighbors. The portions are large and...", "stars": 4}
{"review": "Best breakfast and the homemade cinnamon rolls are to die for!! Their hamburgers are awesome as well as the daily specials.", "stars": 5}
{"review": "AS stated the burgers and chili are the best very flavorful and fast service.  Friendly waitresses and a convivial atmosphere.  Small town with a garnish!", "stars": 5}
{"review": "We are lucky locals in the The Hamburger Inn is just a short drive away.  Definitely a go to place when it comes to great burgers at a great price.  Highly recommend, but don't expect anything fancy.  Our server, Drew, was one of the best...", "stars": 4}
{"review": "The food is great.  There is a little bit of wait on weekends since it's the old diner style seating but it's worth it and they will brink you beverages for free while you wait.  I have never had a bad meal here.  We have...", "stars": 5}
{"review": "The best thing served are the maple icing cinnamon rolls. They also have very good sandwiches... hence the name!", "stars": 4}
{"review": "I liked this cute classic diner! The burgers are grilled to order and fries were hot! Also enjoyed some chocolate cream pie and had to try a cinnamon roll based on the recommendation of our server- they were both excellent!! We had our toddler with...", "stars": 4}
{"review": "I had been told that this was the best breakfast spot in town so I had to check it out.  One of the best diners I've been to!  They have big u shaped bars to sit at and you can watch them cook for you....", "stars": 4}
{"review": "Had breakfast at the Hamburger Inn for the first time in a decade and it was a good as I remembered.  They spiffed up the outside of the place but the inside is still mostly as I remembered though they serve booze now!  \n\nThe staff...", "stars": 5}
{"review": "Not impressed at all the hamburgers wasn't very good and after seeing good reviews of this place. We maybe just went on a bad day. Service was slow and the food was sub par. Your miles my very", "stars": 2}
{"review": "Just north of the busiest corner in Delaware, Ohio sits a icon from the past. 1932 in fact.\nThe Hamburger Inn was a nice surprise for my lunch stop in Delaware. Lots of nice friendly people and staff and very good food. The burgers are...", "stars": 5}
{"review": "Hamburger Inn has been my favorite place to go for a meal since I came to Delaware for college. They've got great food and a great, old-timey diner atmosphere that ultimately forces you to meet new people. Their burgers are great, they have amazing milkshakes...", "stars": 5}
{"review": "Great fun place to sit at an old fashioned counter and enjoy some tasty American classics. Hamburgers, hot dogs, cheese fries and shakes...all real good.", "stars": 5}
{"review": "I've always ate at Hamburger Inn, and for the last 6 months I've been a waitress here. Burgers are fantastic! Handmade Milkshakes, Homemade HUGE Cinnamon rolls from scratch. Definitely a local gem you don't want to miss :) Plus we serve beer now and have...", "stars": 4}
{"review": "Prices have gone up way too much. Has lost the hometown diner feel and value. Can spend the same amount of money at a more upscale restaurant for a family of 3.", "stars": 2}
{"review": "Excellent food with a hometown, nostalgic atmosphere!  This restaurant has stuck around so long for a reason!  The food is plentiful and home cooked to perfection and the choices are many!  You can't go wrong if you are looking for American classics!", "stars": 5}
{"review": "Hamburger Inn has been recommended by the locals.  Ordered the sides scrambled eggs and bacon along with multi grain toast.  Got a great cup of tea in tea pots.... Brook is very prompt along with her new employee.  Love the layout of this place.  I...", "stars": 4}
{"review": "The service here was good and food was well priced.\n\nDespite this, coming from the UK, i found the food overly greasy and very heavy. Despite what i think, my american girlfriend enjoyed the food.", "stars": 3}
{"review": "I love the Hamburger Inn!\nI wanted good dinner food, that was reasonably priced, and fast and heard about the hamburger Inn and went to see what all the hype was about.\nI walked in and the atmosphere was wonderful !\nJust like the dinners...", "stars": 5}
{"review": "I had the biscuits and gravy along with a  cinnamon roll and a sweet tea. This is a huge portion with 4 biscuits and a savory sausage gravy. It filled me up for hours. The cinnamon roll had a maple icing, and was freshly baked...", "stars": 5}
{"review": "I have lived in Delaware, Ohio for 15 years and had never been to The Hamburger Inn.....shame on me, I know. Today, my husband and I went for breakfast.  As soon as we walked in we were greeted with a wonderful \"Good Morning\"!  Everyone was...", "stars": 4}
{"review": "the Hamburger Inn has a reputation that has only 5 arabic letters..........CHILI........ it was reputed to be the best Chili in Ohio and now I firmly agree...... it's just so different but it's just so good!!!!!!!!!!  Everyone around me had the chile and a hamburger.......", "stars": 5}
{"review": "food was adequate but once again pricing is yuppie related. service was marginal and atmosphere is below average.", "stars": 1}
{"review": "stopped with friends from church to enjoy the place,eat on stools,and  get great food cooked to your order", "stars": 5}
{"review": "Breakfast all day. Love love love the cinnamon rolls. Be sure to order the hang-over burger (all day). Super kid friendly, too.", "stars": 5}
{"review": "We stopped by around 9:00 pm. The wait staff was very friendly and was helpful as to what to order. We ate the hamburgers and fries- very good. Tessa was our waitress, told us about the fried cinnamon rolls- of course we had to try...", "stars": 5}
{"review": "Anyone eating at this restaurant absolutely, positively MUST get the Cinnamon Rolls. They are unbelievable!", "stars": 5}
{"review": "Soggy fries,  inattentive waitress, order incomplete. \n\nFinally gave up trying to get the forgotten mayo for my BLT. The waitress would not look our way or, heaven forbid, walk to our end of the restaurant. Even when we were ready to leave she saw us...", "stars": 2}
{"review": "We have been coming to the Hamburger Inn for many years.  It's delicious diner food.  Most of its greasy(but sooo good), but then look at the name of the restaurant! We always have great service, the girls are very busy so sometimes there's not a...", "stars": 4}
{"review": "Visited on 8/29/2015. Place was recommended by the family we were visiting. To me, this is an old fashion style restaurant. Small outdoor seating, but indoors is all U style counters. The server walks in the middle of the U shape counter to take your...", "stars": 4}
{"review": "This is a unique diner with everyone sitting at the counters.....you have to visit to understand. The hamburgers and cinnamon rolls are huge and delicious! Definitely a good place to stop if you love old diners and are looking for a great place to eat.", "stars": 5}
{"review": "Opening in 1932 and they still have the counters and bar stools.\nGreat burgers and Awesome breakfast. Close to a college so weekends are packed for breakfast...so get their early. Food is always prepared correctly.", "stars": 3}
{"review": "Great old fashioned burger restaurant. Get a double or 1/2 lb burger. They get really busy at times but it is definitely a delicious burger restaurant.", "stars": 5}
{"review": "Been to Hamburger Inn a few times. The first few times, the staff seemed very friendly and like a place you want to go to all the time. The last few times my boyfriend and I went, the wait staff doesn't even seem to want...", "stars": 4}
{"review": "A lot of food for the money! Prices are cheap! The cinnamon rolls are beyond delicious! Service was great!", "stars": 5}
{"review": "It doesn't look like much from the outside, but the food here is awesome.  The hamburgers were perfectly cooked.  Definitely get a cinnamon roll.  They are the size of your head!", "stars": 5}
{"review": "You have to try the cinnamon buns with maple icing. Delish!\n\nTheir omelette are really good. My favorites so the Greek omelette with thaziki sauce.", "stars": 5}
{"review": "I had excepted a bit more for our experience due to all the reviews and attention the place has received, however it was nothing out of the ordinary or no wow factor.\n\nMy husband and I went on a Sunday morning, there was no wait...", "stars": 3}
{"review": "Wonderful old fashion diner. The hamburgers are amazing, and you have got to order the buckeye milk shake, it's heavenly. My husband, grandson and I were very pleased and had a wonderful dinning experience.", "stars": 4}
{"review": "We were in Delaware visiting OWU and stopped in for breakfast. The place was almost full, but there were three seats open and we sat. Service was good, prices very fair, and the food is excellent!  A great little diner. Stop in sometime.", "stars": 5}
{"review": "Had the cinnamon roll french toast and it was great along with several slices of bacon cooked to perfection - not soggy and not overly crisp.", "stars": 4}
{"review": "Prepare to sit at the counter! Because there are no tables just an amazingly circuitous counter. Breakfast and lunch are served all day. From the scratch made cinnamon rolls to the hamburgers, there's something for everyone. An lets not forget the home made pies!!", "stars": 5}
{"review": "My husband and I had a nice lunch here,  The service was great.  My husband appreciates a place that regularly uses chocolate ice cream for chocolate shakes and not vanilla ice cream.  I had the Portobello sandwich and my husband had a hamburger, the fries...", "stars": 4}
{"review": "Always love fresh cinnamon rolls and the earlier the better because they have been know to run out :-)", "stars": 4}
{"review": "Although much of the Hamburger Inn food is delicious .........don't miss the cinnamon rolls, best pancakes EVER and skillfully prepared eggs and breakfast potaoes.\n\nGreat old fashioned diner feel in a historic location in beautiful downtown Delaware!", "stars": 5}
{"review": "First visit. Our waitress was very nice and suggested we try the hamburgers. Friend and I both had the Bacon Cheese Hamburgers. We had the smallest burger but it was large, cooked right and on a very fresh bun. We both thought the burgers were...", "stars": 4}
{"review": "The homemade soups and daily specials are excellent and priced fairly.  The signature burgers are average at best.  Third shift breakfasts are huge and tasty.  Cinnamon rolls are baked daily and are very popular for take-out.", "stars": 3}
{"review": "Hamburger Inn is the classic burger joint.   Located in the heart of downtown Delaware, Ohio.  Nothing fancy, just good old fashioned diner food.  \n\nWe walked in to the Hamburger Inn and saw counter seating only.  I loved it, reminded me of the drugstore diners when...", "stars": 4}
{"review": "Other than the interior, there's just nothing special about it. I've taken my 8 year old boy there twice. He was thrilled with the old school counter seating, but I can't say the food was anything great. It's about the quality of cafeteria food.\n\nThe...", "stars": 2}
{"review": "The \"Lumberjack Breakfast\" was a great way to start the day and kept me full enough that I did not need to stop to eat on the way home. The gyro omelet is also delicious.", "stars": 5}
{"review": "We eat here about 3-4 times a year.  The burgers are always good on a nice bun.  I am fond of the chili which has a strong peppery flavor - rather than tomato.  Also worth trying are the pies.  They have added beer in the...", "stars": 4}
{"review": "How all diners should be! A good hamburger & plenty of options to keep the kids happy. Prices are reasonable as well. The one downside with little ones is the seating...all stools. However they do offer one of the high chairs that clamp on the...", "stars": 4}
{"review": "I was travelling with a business partner and noticed the highway sign near the exit off of US 23.\nThe town of Delaware, Oh has lots of small town charm in its' downtown. The diner experience here was incredible.  The burgers are super tasty and...", "stars": 5}
{"review": "This is a really great place with really great food.  All the inside seating is counter seating so you may have to make some friends while you eat.  The food was really tasty and didn't take long either.  The server was really sweet and made...", "stars": 5}
{"review": "A real original...A diamond in the rough! Nothing fancy, but great food & personal service! Can watch your food on the grill. Open 24hrs a day!", "stars": 5}
{"review": "Great little diner with good food at the right price.  Like stepping back in time.  Milkshakes are superb.", "stars": 4}
{"review": "Whenever I travel through Delaware I eat here.  The burgers are still great.  Do not pay attention to the naysayers.  The fries are excellent and the pies are superb.  All at a reasonable price.  I recommend this place.", "stars": 4}
{"review": "This place is a very cool and retro diner. The seating is three giant u shaped bars, so you will be sitting next to people you may not know, but they all seemed friendly. Staff was all nice and attentive and reminded me of the...", "stars": 4}
{"review": "I absolutely love this place. It's a fun retro throwback of the 1950's diner. They have a fantastic breakfast menu that is so reasonably priced. The burgers are massive and delicious. A huge menu and great prices. A must in delaware!", "stars": 5}
{"review": "This is your classic \"greasy spoon\" restaurant.  Burgers, fries, chicken and breakfast menu at any time of the day.  If it is on the menu and they are open, the are serving anything on the menu.  Food is good quality, not cheap by-products.  An above...", "stars": 4}
{"review": "I started eating here years ago because of the prices. I used to get the biscuits and gravy and a huge chocolate shake made in one of those old machines that gave you about two and a half glasses of shake. They put the whole...", "stars": 4}
{"review": "Went recently on Saturday for lunch. The walls have been painted, bathrooms remodeled, and they are now serving beer! The food was still amazing and the service was the best I've had there. They now have one person that runs the cash register so you...", "stars": 5}
{"review": "Was looking forward to eating here again, as it had been a few years. Service was good, and place was busy with lots of OWU students. I ordered a burger and fries, and was disappointed in the fries. Burger was great, lots of fresh pickles,...", "stars": 3}
{"review": "I am a very regular reviewer on Trip Advisor and have never had to write such a negative one...but this one is well deserved. Two couples traveling north for the weekend; saw the reviews on Yelp and decided to give it a try. The positives...great...", "stars": 2}
{"review": "Whenever I am in Delaware, I always stop at the Hambuger Inn. I love going for breakfast on a Saturday morning.  It's a chance to get reacquainted with what is going on locally. All of the wait staff greet you with a friendly smile and...", "stars": 5}
{"review": "My husband and I were on our way from Indianapolis to Northeast Ohio. We were not traveling the interstates. I checked the Tripadvisor Delaware, Ohio website and saw the Hamburger Inn listed. We decided to try it since it was open on Sundays. We had...", "stars": 5}
{"review": "Have been there for breakfast and lunch on at least 3 different occasions with the same satisfied results, content and wanting to return to eat there again as soon as possible. Week-end breakfast is busy, had to wait for seats, but the manager served drinks...", "stars": 4}
{"review": "We stopped here for breakfast while visiting family.  I had a hamburger and shared a grilled cinnamon roll with the rest of our party.  The burger with lettuce, onion, and fried egg was the best I've had in quite some time and the cinnamon roll...", "stars": 5}
{"review": "We have not been here in years...Loved the breakfast. Pancakes...YES! But my husband went for the burger and fries and I was so jealous! The best homemade fries ever! We will be back for the doughnuts.", "stars": 5}
{"review": "Been going there for 40 years so I have a good frame of reference. \nSince the new owners have taken over I think the place has gone downhill....food is not nearly as good as a few years back, totally different crowd (yuppies and college students)....no...", "stars": 3}
{"review": "I absolutely love this place! It is a go to when I don't feel like cooking and just want a good burger. I always get the single, fresh cut french fries, and a cup of chili. Always a wonderful meal that I cannot finish. The...", "stars": 5}
{"review": "Locals like to come here for breakfast, but plan to sit on stools around the little bars.  In the summer, it is nice to sit out front.  However, all other times you get to sit close to your fellow diners.  Food is average, but Hamburger...", "stars": 3}
{"review": "While we were dining several customers complained their food was bad. We had breakfast meals that were very good. Then we ordered a piece of cheesecake. It fell apart in crumbles. Was bad tasting. Wife refuses to eat there again.  This is not the Hamburger...", "stars": 1}
{"review": "I took 2 girlfriends to have a fun lunch.  The hamburger sandwich was less than tasty served on a small (day old) white bun.  The atmosphere is not cozy and the service was not great even though they were not busy.  This place was recommended,...", "stars": 2}
{"review": "Known for their delicious hamburgers and baked goods, this place is a favorite of ours when we are off diets and want good old fashioned hamburgers, fries, ice cream, pie and a 1950's experience. This place is well known and the food is tasty.", "stars": 5}
{"review": "Your typical diner that shows its age.  Place could use a good cleaning.  Food (breakfast) was hot, but average.  Would I go back, yes, but it will not be my first choice.", "stars": 3}
{"review": "A Delaware city icon.  This place has been here for YEARS and the food is, and always has been great.", "stars": 4}
{"review": "The counter snakes around to maximize the seating. It's basic grill food, you know, the flavor's on the griddle. Their cinnamon rolls are big, fresh and delicious!", "stars": 5}
{"review": "Just do not like the atmosphere. Do not like the food.", "stars": 1}
{"review": "Great menu selection, great service, try the cinnamon rolls.  Although the previous owner passed, it has kept the \"tradition\" and remains a staple here in Delaware, OH.", "stars": 4}
{"review": "i loved everything about this old time feeling restraunt!!!", "stars": 5}
{"review": "We went here twice while visiting Ohio Westleyan -- it is a short walk from the college.   The food was good and very reasonably priced and its a diner so that's the fun part of it.   Yes, it could use a little updating but the...", "stars": 4}
{"review": "I went to Hamburger Inn based on the ratings on Trip Advisor, I have to say this is the first time I have been led astray.\n\nI was greeted by a friendly waitress when I walked in and she quickly brought me a drink.  This...", "stars": 1}
{"review": "This is a Delaware tradition for a hamburger. Unfortunately food is just average diner quality and service is often poor.", "stars": 2}
{"review": "stop on way south on 23, what a great experience! 2 had breakfast, 2 had lunch, but all had the cinnamon rolls! moderately priced,great service, with good food. not cheap bacon,or biscuits. and fries and home fries were excellant...", "stars": 5}
{"review": "The Hamburger Inn is a Delaware institution and a must-visit for breakfast if you like greasy spoons. It was great 20 years ago when I was a college student in Delaware and I still go back regularly. I highly recommend the corned beef hash.", "stars": 5}
{"review": "Don't bother with Tim Hortons, Cracker Barrel, Waffle House etc, go into downtown Delaware and have breakfast at the Hamburger Inn.  The only tables are out on the street...we preferred to sit at one of the 3 U-shaped counter areas and eavesdrop on the locals....", "stars": 4}
{"review": "I love going to out-of-the-way local diners, and this one didn't disabbpoint. One of my favorite things to find on a menu is deep-fried pickles, and theirs are battered and very tasty. The burgers are very good, and the fries are excellent! They also have...", "stars": 4}
{"review": "What you expect for a diner.  Now open later on weekends.", "stars": 3}
{"review": "One of the fun parts about going to the Hamburger Inn was the old greasy-spoon diner aspect of it (emphasis on old).  Well, it's now an updated but still quaint diner with a nicely expanded menu and (finally) expanded hours.  I'm glad they kept the...", "stars": 3}
{"review": "When's the last time you had a burger at a place where they grind their own meat, a bake all their own breads. I think that I am officially going to be a regular for breakfast, lunch and dinner. I mean seriously you can get...", "stars": 5}
{"review": "good food but dirty restaurant...very greasy diner type", "stars": 2}
{"review": "The only positive of this restaurant was that the lighting was bright and the wait staff were ok. The food was mediocre at best and the booths felt crammed", "stars": 2}
{"review": "We ordered dinner boat for two.  It was good.  It is a typical party tray.  I wish they can include more individual sushi.", "stars": 4}
{"review": "I only buy the sushi so I can't say anything about the other food but I really enjoy it! I have been to several other place and they are one of the best. I feel their prices are similar to other sushi places. I love...", "stars": 5}
{"review": "I would have put negative stars for this establishment. I ordered salmon Toro which is overpriced to begin with.  It was brown and smelled so I requested refund.  They told me no one complained. I ordered 4 overpriced pieces and it was not edible!  They...", "stars": 1}
{"review": "For a \"to-go\" order, four rolls cost around $30.  It came with wasabi and packets of soy sauce and napkins.  Maybe the dine-in experience would be better-- but I've similar quality for a lower price elsewhere.", "stars": 3}
{"review": "Amazing everything. I highly recommend. Bento box full of goodies! Fast service. Great tea and it came with soup and salad not pictured.", "stars": 5}
{"review": "Very authentic sushi house.  They even have sushi rooms if you want to sit on the floor.  They do have regular tables too.  We ordered 3 raw rolls.  They were very good.  That wasn't very pricey but the meals were expensive.  The sushi boat would...", "stars": 4}
{"review": "Stopped in for a late lunch and was not disappointed. Very large menu... hard to choose. Service was great, food was delicious. They have special prices on appetizers during happy hour. I will return!", "stars": 4}
{"review": "We had “sushi en special lunch box” for $15.50 with miso soup and a salad.  It was more than enough for one person for lunch.  Presentation was very good.\nThis is a very clean and Japanese looking restaurant though the chef was not a Japanese....", "stars": 4}
{"review": "My husband and I stopped for lunch, they never disappoint!  My husband had the Hawaiian roll and spicy tuna (the best) both delicious. I had the rice noodle bowl, first time and full of flavor and lots to eat. I would have again, but all...", "stars": 5}
{"review": "While visiting Polaris fashion place I found this small restaurant out side of the mall. I ordered tempura shrimp sushi and a diet pop. The Sochi was good, the drink was just a can of Diet Pepsi.  I’d go there again.", "stars": 4}
{"review": "I think that they have the BEST miso soup! Great bento box. I like their Korean food better though. Great sushi!", "stars": 5}
{"review": "My first visit to Sushi En was by chance during Happy Hour. I ordered spicy tuna roll and sake, which came in a small screw top bottle and too much for me since I was driving. No problem. My server sealed it and I took...", "stars": 5}
{"review": "Great,tasty sushi and very extensive menu. Definitely one of the best sushi spots in Columbus area. We were served quick and with a smile", "stars": 4}
{"review": "Stopped in for dinner recently and left really disappointed.  Our order included a bowl of soup (best thing we had, can't remember the name but the broth was amazing), a seaweed salad (large portion and average), 5 pieces of sushi (Octopus, supposedly bluefin tuna which...", "stars": 2}
{"review": "Visited with my 16-year old daughter, who was wanting to try sushi that wasn't take-out. I found this to be a typical, if small sushi place. You order from the menu, or write down your a la carte order. We had a salmon roll and...", "stars": 3}
{"review": "We went to Sushi En based on previous reviews. While the service was okay, the food didn't live up to expectations.\nI had the Katsu Don.  Large chunks of pork, not crispy, and the whole dish was poorly seasoned. Unfortunately it reminded me of cheap...", "stars": 1}
{"review": "My friend an I are not from the area and found this place with the help of Siri.  We ordered 3 rolls and they were VERY good.  Unlike some rolls, these were larger so also quite filling!   Our service was great.  We will definitely eat...", "stars": 5}
{"review": "Nestled near the Rave movie theatre, this little gem never fails to hit the mark. \n\nSushi is fresh, tasty & M-T 3:30-6p happy hour with 1/2 price veggie rolls, apps & sake can't be beat. \n\nChoose the sushi bar or tatami mat room. \n\nThe veggie...", "stars": 5}
{"review": "Ate here not impressed with the sushi. Also we found a Asian markets about 10mins from this restaurant that was epic. They and the freshest sushi I've had in years yummy. Wouldn't come back here 5 dollars per the fish eggs rolls... paid 6 for...", "stars": 3}
{"review": "I was here for sushi with a business partner.\n\nIt wasn't cheap but the quality of the food and the location as I was in Polaris was perfect.\n\nThe waiter was attentive but not overly attentive. Considering the distance from the coast the food was...", "stars": 5}
{"review": "The sushi was delicious, service was on point. The only drag was the space was kind of tight. It's a small place even by sushi bar standards. The bang for your buck factor was meh. I've had just as high quality sushi for a little...", "stars": 4}
{"review": "Nice simple atmosphere, serves both Japanese and Korean cuisines along with their sushi.  Many choices on their authentic menu.  I had two pieces of hamachi nigiri sushi.  The yellowtail was good but not buttery or great.  I almost felt as though it was too cold...", "stars": 3}
{"review": "We've been to Sushi En many times, usually before or after movies at Rave Polaris. The food has always been fresh, well presented and in the reasonable price range for sushi in Columbus. The restaurant itself is fairly non-descript, a little cramped, and the service...", "stars": 4}
{"review": "I stopped by Sushi En for lunch last week.  They did not really have any lunch specials that looked interesting.  I have seen much better specials.  I ordered and the rolls came out.  They were fairly standard sushi rolls.  They weren't over the top, but...", "stars": 3}
{"review": "Sushi En seriously has the best Sushi in Columbus. I love that you can watch the friendly chefs prepare your order. I usually order the spicy shrimp, but have enjoyed a variety of sushi rolls and all are excellent and very fresh.", "stars": 5}
{"review": "Stopped in here for Valentine's dinner after a movie.\n\nExterior:  this restaurant is located at the west end of a building which includes a movie theater, a pub, a dessert place of some kind, and another business.  There is plenty of parking available in the...", "stars": 4}
{"review": "I do like this place. It is a pleasant-looking place by Polaris Mall. The service is good.  I have to disclose that I don't eat much raw chunks of sushi, so someone else can speak to that kind of item. I love their salmon teriyaki...", "stars": 5}
{"review": "I have eaten at Sushi En dozens of times and have never had a disappointing meal.Service is usually very good, the fish is always fresh and the chefs do a great job of making the rolls just the way you want. Love the Double Crunch...", "stars": 4}
{"review": "Sushi HAS to be fresh! Theirs was superb. Stopped out of the blue as I had an evening appointment before heading home. Quickly greeted, I sat at the bar. Two well appointed sushi chefs worked diligently as I watched them work with their hands. Fun...", "stars": 5}
{"review": "First visit to this bustling restaurant. Had three sushi chefs plus kitchen help and enough servers to manage a busy Friday night crowd. Sushi menu is large with standard items and rolls. Nice selection of appetizers. Fish was very fresh. Servings adequate sized. Saba a...", "stars": 4}
{"review": "I've been to several sushi places around Columbus but I just tried Sushi En recently and found it to be the best one in Columbus so far in my humble opinion.  I especially liked the \"Special #2 with soy paper\" and the \"All In\".", "stars": 5}
{"review": "Average sushi at best. Ordered the Regular Sushi plate and the selection was quite bland. 1 tuna, 1 salmon, 1 shrimp and 8 more pieces of tough chewy white fish (maybe one was a tuna as well) and one was a cooked heavily marinated eel....", "stars": 3}
{"review": "My wife and I came here as a special treat to our youngest son trying out japanese food...it started great, but as soon as we were approached, we we disregarded!  It seems that in this restaurant, if you are not a big enough party, get...", "stars": 1}
{"review": "This place is hands down the best sushi in Columbus! I would there every day if I could. My favorite roll is the sweet potato. It is amazing. Absolutely love this restaurant!!!!", "stars": 5}
{"review": "Sushi was excellent and we tried some Korean dishes when we visited and it was delicious!  The server was friendly and bagged our food up so that's always nice.", "stars": 5}
{"review": "We are sushi novices and so got the Firecracker and Dragon Rolls.  Both were excellent and were great together.  Waiter was very knowledgeable and helpful.  Love that the menu notes items that contain raw for us sushi amateurs.  Restaurant is a small storefront but very...", "stars": 5}
{"review": "Enjoyed a lovely dinner-for-two off the menu last night with my honey. We typically hand-pick items off the menu and decided to go for the second of two \"Dinner For Two\" offerings. For $50 we got a ridiculous amount of food: 2 miso soups, 2...", "stars": 5}
{"review": "I enjoyed every lunch I had here (sushi, Bento box).  The food was good and the atmosphere was relaxing.", "stars": 5}
{"review": "Multi time customer to Sushi En and never disappointed. Always fresh and Consistant.\nLove the Firecracker roll as a meal.", "stars": 5}
{"review": "My husband and I had lunch here on a Sunday, late afternoon (around 2:30 pm). Service was outstanding, especially considering there was only one gal working the entire place. Their menu is quite extensive, definitely something for everyone. We had the spicy tuna roll and...", "stars": 5}
{"review": "Great food and excellent service.  Sushi was slow to arrive but this was because of a very busy night.  Great food is worth the wait.  I had nigiri and specialty rolls, all were outstanding.  Wife had yaki soba and she loved it.", "stars": 5}
{"review": "I stumbled upon Sushi En and had take out service. Service is very casual there, which is fine, but was somewhat of a surprise. I had miso soup both nights --- very good. I had never liked it before, but am coming around! I also...", "stars": 3}
{"review": "Sushi En has the best Sushi in Columbus. Very Large variety. Great service. Make sure to check it out.", "stars": 5}
{"review": "this is my fav sushi place in columbus.  you would never think looking at it from the outside that it would be as good as it is.  excellent service, short wait, they make it in front of you(as any sushi place should) prices are reasonable,...", "stars": 5}
{"review": "We do not eat fast food often but when we do we do it for quality and convenience. With that in mind McDonalds is usually reliable choice. The McDonalds in downtown Hudson is dated, on the dirty side and understaffed. Stopping with granddaughters at busy...", "stars": 2}
{"review": "McDonalds is a fan favorite for kids and business travelers.  The food is always the same ... so if you like it in one place, you'll like it in Hudson, too.", "stars": 3}
{"review": "No golden arches or red and white fascia.  More wheat beige abd Hershey chocolate brown.  The sausage biscuit was hot, fresh  and tasty.  Staff was efficient and prompt from the cashier to the delivery person.  Keep a peeled eye so you don't miss out.", "stars": 5}
{"review": "Signature Crafted Bacon BBQ sandwich for $4.99 and make it a meal for $7.09, so I said I'd like that. I was asked if I wanted a drink. Yes, Diet Coke please. That'll be $8.64. When I asked why I was upcharged, I was told...", "stars": 3}
{"review": "My husband and I stopped at this McDonald's on the way home from visiting my uncle. From the outside it was quaint not looking like your normal McDonald's. When we got inside, it was a different story\n The material on the booths were in an...", "stars": 3}
{"review": "This is your basic McDonalds, but it is clean and well situated in Hudson. As with most McDonalds, always check your bag in the drive thru line to make sure they gave you what you ordered. For some reason this one has always been a...", "stars": 3}
{"review": "People who were in the drive thru had to walk into the store to ask where their food was.  Manager was a little rude to staff and didn't say a word to me when she handed me my food.", "stars": 3}
{"review": "I have been happy with this restaurant preparing the order correctly.  The food always is hot and doesn't se as if it has been sitting.  They are fast and for McDonalds, they do a nice job.", "stars": 4}
{"review": "found a large gray hair in my food and wanted my money back, they called the hudson police on me. those born-a-again freaks tried to get me out of the place without giving my refund........", "stars": 1}
{"review": "I like going to ACE HARDWARE in Hudson, Ohio.  The people are friendly there, and the place is really bright.  My wife and I have been to several spots in Hudson, as you can tell, and I was asked to bring something home to eat,...", "stars": 4}
{"review": "Great coffee shop near our hotel. Iced black and white latte was very tasty! Fall spice latte was good too.", "stars": 5}
{"review": "Flavorful coffee. Hot. Illegally hot coffee, in a good way. I miss hot coffee at coffee shops. But the shop gave me a very hot cup of coffee and I’m so happy. And the coffee tasted very good.", "stars": 4}
{"review": "Traveling through found this wonderful little place.  Latte is nice and strong- yum!  Bagel breakfast sandwich fresh and made to order.  What a nice find.", "stars": 5}
{"review": "Stopped in again and was closed at .9;02 pm on a Saturday night.  Last time we were here the coffee grinder was not working.  What is the problem here?", "stars": 1}
{"review": "Stopped in on a Saturday night at 8:53 pm and was told we could not get a mocha because they were getting ready to close.  Door says they close at 11:00?  This place seems to close early a lot!", "stars": 1}
{"review": "We stayed across the street for a long weekend and wanted to give this cute cafe a try. \n\nI had the Triple Threat Latte - Butterscotch, hazelnut & vanilla - and my spouse had the Carmel Macchiato. The triple threat is triple good. You must...", "stars": 5}
{"review": "My friends and I usually meet for coffee a couple times a month here on the weekends. We always go early as the place tends to fill up by 10am on Saturday mornings. I like high-octane coffee so I usually have a double or triple...", "stars": 4}
{"review": "Gives a good cup of coffee in a comfortable setting. Just a nice winter stop. Friendly people who can talk coffee.", "stars": 5}
{"review": "I’ve had a friend post on FB that he goes here quite a bit so while we were in town we stopped in. So glad we did!  I absolutely love coffee and this place knows how to do it right!  Great coffee and the atmosphere...", "stars": 5}
{"review": "When I walked in at 7am there was a staff member right near the door and I was surprised I wasn’t greeted. I walked up to the beautiful bar (the bar, set up and decor is awesome, especially being a dog person!) and the staff...", "stars": 3}
{"review": "I bought a pound of Sumatran beans for less than $15 and I received a free cup of coffee, my choice. I’ve tried several pounds of beans from Central America, Ethiopia, and the Sumatran. All are well roasted dark coffees, but the Sumatran is my...", "stars": 4}
{"review": "This is a very nice establishment that offers a variety of beverages and adds a nice touch by offering coffee in an actual coffee cup, like at home. Plenty of seating and and outlets to charge devices. Free WiFi. The only drawback was the encounter...", "stars": 4}
{"review": "Heading back to Stark Co and were looking for a cup of coffee. Saw their sign on Rt 8 so stopped in. Service was great and the food very tasty. Had an everything bagel with spinach, egg, onion and provolone and a bagel with ham,...", "stars": 4}
{"review": "We needed some coffee while on the road. We were going to stop at a chain, but we saw Nervous Dog's sign. What a great shop! The barista was very helpful when we said we didn't want coffee too sweet. She said they had a...", "stars": 5}
{"review": "Great coffee.  Ordered a light roast.  Got the option of getting a mug or paper cup.  Relaxed atmosphere and pleasant servers.", "stars": 5}
{"review": "I came here while visiting family for Christmas. Really good coffee and breakfast sandwich. The staff is very friendly but sometimes gets a little overwhelmed with the crowd.  But, it's worth the wait.", "stars": 4}
{"review": "Came in while waiting for a friend and ordered a smoothie. Ordered a large that looked more like a small,  was cold but looked like it was made with artificial products. No natural small chunks or that froth at the top most ones have.  It...", "stars": 1}
{"review": "So, you are in the suburbs and want that great coffee of your urban experience? I recommend Nervous Dog. I drink soy in my latte and ND has good soy for their Baristas to use. Great selection of beans and the atmosphere is comfortable despite...", "stars": 5}
{"review": "They have great coffee and coffee drinks, and some really fabulous pastries. They are always will to adapt one of their excellent  sandwiches or wraps for a vegetarian. It's just a really nice place to relax.", "stars": 4}
{"review": "The folks at the Nervous Dog make the best coffee.  They also have delicious treats. The place is quiet and the baristas are very friendly.", "stars": 5}
{"review": "I love coming here for coffee and their Asiago bagel on my way to work. Since it is on my way to work I typically go drive through. My drive through experience can vary from waiting 5 minutes to 15 minutes for them to make...", "stars": 2}
{"review": "The atmosphere is cool, the coffee is unique.  I was really impressed with this establishment especially when the baristas walked me through what I was getting and how they would make it.  So many drinks hide the coffee with other flavors and I liked that...", "stars": 4}
{"review": "Stayed at the Staybridge Suites, right next door.  This was a quick and easy stop for coffee.  It was very very good coffee.  It wasn't strong and bitter like a Starbucks.  It was cheaper than a Starbucks too =)", "stars": 4}
{"review": "They have a great selection and a fantastic atmosphere. There people are always friendly and helpful. The drink menu is quite extensive, almost intimidating, but the staff will answer any questions you have with a smile.", "stars": 5}
{"review": "I've always had a great coffee at this bar.  Prices are a bit steep so one may not want to go all the time.  But you'll never be disappointed.", "stars": 4}
{"review": "We have taken two trips to the Stow area as a few day \"getaway\" and discovered this great little coffee house on our first trip.  We were impressed by how comfortable and cozy this space felt when we entered. Like a perfect local coffee shop,...", "stars": 5}
{"review": "I loved the fun drink options! They were out of vegan pastries but the latte I got was so good - and I can always go back! Really friendly staff, fun atmosphere. Nice to see a non-Starbucks place. Very cute.", "stars": 5}
{"review": "the staff are great and friendly and nice atmosphere . free internet to do your work or just surf the net .", "stars": 4}
{"review": "This is a nice twist if you're sick of the big chain places.  I've never had \"real\" food here, but the coffee drinks are well-made and the staff is always really nice.\n\nParking is plentiful and one advantage of being a non-chain is that you're...", "stars": 4}
{"review": "While in Stow for business, I stopped by the Nervous Dog for lunch. I was pleasantly surprised to see they had several vegetarian sandwich options. Everything was very fresh and it was a great casual lunch. The coffeehouse itself is very cute and has fun...", "stars": 4}
{"review": "In town for less than 48 hours, I needed a place to do some work for a couple of hours, and this place hits the spot.  It has a hip, independent and unique style - total opposite of the Starbucks corporate feel.\nIt is not...", "stars": 5}
