{"review": "Not exactly busy but took a full 20 minutes to get my small order, and overheard the guy in front saying the same, meanwhile in his 20 min wait they had ran out of something in his order,meanwhile, unapolgetic staff who dont appear to care...", "stars": 1}
{"review": "Went to kfc sidwell Street to treat my grandson. Wait time wasn't bad. Unfortunately that was the best part of the visit. Chicken was dry and barely warm. We decided to eat in. It was absolutely freezing in there. Colder than outside. Ended up leaving...", "stars": 1}
{"review": "Walked in and walked straight back out, tables were filthy, food all over the floor, chairs everywhere with tables having no chairs around them, went to the chicken shop around the corner, at least it is clean there.", "stars": 1}
{"review": "Door says open on a Saturday until midnight but was locked shut and a single employee inside cleaning wasn’t responding at all when asked through class store front if they were open or not, at least 10 other people arrived to try and get in...", "stars": 1}
{"review": "Banging awful and why didn't I read the reviews first?! Dirty and the food apart from the corn on the cob and that was nuked in the microwave! Poor staff didn't have a clue either! Lots of unhappy customers complaining about the same issues.", "stars": 1}
{"review": "Got a delivery and the chicken was slimy and had bones in it! The chips were all soggy and came with no ketchup! Why oh why would it not come with ketchup I don’t know. Instead of ketchup there was gravy which in my opinion...", "stars": 1}
{"review": "The food is good but they take the mick. Colonel  sanders is dead yet he would have been faster than the employees at this kfc. Just hurry up it took 30 mins for us to get our food.", "stars": 3}
{"review": "despite been the only people in the store, they got my order wrong, when asked to change it was asked \"what do you want me to do about it?\" then after changing the wrong item only I said the food would be cold only for...", "stars": 1}
{"review": "There's an overweight blonde girl, think her name was Tiffany. whom is a MANAGER may I add. Absolutely stunk of marijuana and was completely unprofessional. Would be a better place with better staff", "stars": 1}
{"review": "Ordered through Deliveroo, I had a double zinger burger meal which arrived so fast, was hot and looked like one of their adverts (which never happens). The chicken was cooked perfectly - so crispy and the inside moist. There was a good amount  of sauce...", "stars": 5}
{"review": "Ordered delivery tonight fully loaded normal fillet, ended up with a zinger burger and chicken was so dry... I was really looking forward to it tonight. But chucked some of it away", "stars": 1}
{"review": "Ordered from deliveroo at 9.30pm for a £40 family order last night they accepted the order, then at 10pm the arrival got later and later, by 10:45 we called deliveroo who said the driver would be with us within 4mins. 30 mins later still no...", "stars": 1}
{"review": "With KFC being a well known chain it is shocking that its allowed to be run by the people here in this branch in Exeter. \nWalking in at 8.30pm on a Sat evening, it was quiet but the photos show how bad the place was....", "stars": 1}
{"review": "No food, took an hour 5 minutes for them to ring up and cancel the order. Customer service was dreadful too did not explain anything about a refund.", "stars": 1}
{"review": "Went here before the football on boxing day and had one person serving, while there was at least four in the kitchen. However, the person serving was too busy doing orders from those who had ordered on the screens to be able to actually jump...", "stars": 1}
{"review": "I've not had a KFC in ages, and so was quite looking forward to my Chicken strip lunch meal. the outlet was busy, uncleared tables and masses waiting, we ordered using the new touch screen thing and then began to wait., after 35 minutes called...", "stars": 1}
{"review": "Nearly every table was uncleared, every bin was brimming with waste - spilling onto the floor - some clear tables were still dirty - food was passable - I have never had KFC before and have no wish to try again , The place wasn't...", "stars": 2}
{"review": "2 work colleagues and I waited over 25 minutes for our food! The chicken was hard like it had been sitting under a heat lamp for hours! The staff seemed inexperienced and not very sympathetic, the tiled floors were very greasy and slippery.", "stars": 1}
{"review": "Been working close by for a year and been here over 10 times, every time the order takes 15mins+, talk about fast food!! Terrible service and understaffed", "stars": 1}
{"review": "As a regular consumer of the colonel’s finest, I feel obliged to warn others of a particularly disappointing experience I had in the early hours of 22nd June 2019 on the Sidwell Street KFC.\n\nWhile the food was as expected, the service sadly did not...", "stars": 1}
{"review": "I stopped in here to get some lunch. It’s filthy. The counters, floor, kitchen. The staff were paying me no attention either, left without getting served.", "stars": 1}
{"review": "What happened to KFC? Particularly the sidwell St store, its no longer a treat but always a bitter disappointment. You pay over the odds for cold food, you rarely receive the correct order. After the moody staff corrected my order for the second time and...", "stars": 1}
{"review": "We got there for fun and drinks and it was not good enough:  prices too high for what we got, the Manager was not versed in good communication, the staff were just shuffling around and the service was chicken on a tray, no plate or...", "stars": 3}
{"review": "I came here on my lunch break from college with some mates. When we got here there was one person before us and we ended up waiting for 15 minutes before we got served. There was only 4 people working behind the till and I’m...", "stars": 1}
{"review": "Food was good ( love the new chips) although only one person serving so service was slow.\nRestaurant itself was filthy and \nI had to clean the table myself before I sat down. Makes me wonder how clean the kitchen is ????????\nThe staff were...", "stars": 1}
{"review": "If you are looking for fast food, do not come here. The food is to the usual standerd but the service speed is really poor.", "stars": 2}
{"review": "Not happy !!! Quiet restaurant but still missing items and cold , not busy at all , would of drove back but why should i spend more money of mine !! Gave this kfc another chance tonight but still terrible!! Also never having slaw or...", "stars": 1}
{"review": "Ordered 6 pieces of chicken via Deliveroo. Couldn’t have been simpler. Without even touching upon the faulty app which didn’t work properly, my concern is that I received only FOUR pieces of chicken. What’s the matter? Somebody have difficulty counting? There really is no excuse...", "stars": 1}
{"review": "Waited Over 30 minutes for a order when it wasn’t that busy ,  always messy , and takes always takes a really long time", "stars": 1}
{"review": "My family and I love KFC. The food is lovely and fresh and the staff and very helpful. Would recommend", "stars": 5}
{"review": "Went to get a couple of ice creams tonight and the young lady was so engaging and making work a fun place to be, I would love to work with her, good asset to you kfc \nD Dines", "stars": 5}
{"review": "Was quiet but lady got our order wrong which was fine but manager seemed angry with me like it was my own fault and ignored situation. She had a very large hicky on her neck which did not look very professional. A team member had...", "stars": 1}
{"review": "Not the fault of the staff but as I walked in there were 4 or 5 very disgruntled customers waiting.i had an extremely long wait for my food and alot of it wasn't available so had to be changed.The staff on shift were clearly under...", "stars": 1}
{"review": "We love KFC and it is a treat for us but the last few times it has been horrendous.  We won't be going again. After queuing for ages, we finally got our food, got it home, the order was wrong - on more than one...", "stars": 1}
{"review": "I feel totally embarrassed and degraded as being shouted too by a supervisor (I'm guessing, tall with glasses and braces) as you do not accept £50 notes in this branch apparently?!\n\nFortunately I had my credit card on me as I am awaiting a new...", "stars": 1}
{"review": "Arrived here to a massive queue and 3 very disgruntled staff members! The menu had been hit by something so half of it was black and I couldn't read it. Ordered my lunch and was told no sweetcorn got beans. Tad rude! Whilst waiting on...", "stars": 1}
{"review": "A couple days ago I paid for a meal and then when I got home half of it was missing. I phoned up a few times but no one ever answered. Finally tonight someone answered and I spoke to the manager who fed me a...", "stars": 1}
{"review": "One day I will find a kfc who can actually get an order correct.. No beans then uncooked chicken and when I returned it the me,her of staff had to get someone else to help as they didn't understand what I was saying.. Always food...", "stars": 1}
{"review": "We decided to stop off for KFC after a night out with the children who decided it was this the wanted to eat.\nDue to previous bad experiences with another KFC outlet, I wasn't so keen, but, as the kids wanted it, that's what they...", "stars": 3}
{"review": "Went into the store to order a meal this week and stood there for around 30 seconds whilst the duty manager, who was stood at the till, gave an evil stare to someone in the restaurant stood by the bin.  Eventually the manager decided to...", "stars": 1}
{"review": "Quick, easy service despite being a busy time of day. The bins were overflowing but that’s fair enough since it was so busy there. Good food, good service, would recommend for a quick meal.", "stars": 4}
{"review": "The dirtiest, unclean KFC ever \nStay away\nToilets over flowing, every table covered in rubbish\nFloors covers in napkins\nGo to another KFC or a different fast food restaurant", "stars": 1}
{"review": "Poor place, not like the old days - South street is worse.... yet Sidwell street remains one of the worst KFCs I have ever been to - the area manager should be sacked. Hygiene, staff and food rotation is the issue. So basically it is...", "stars": 1}
{"review": "Ok where to start. The place needed a good clean. The bins were over flowing, the floor covered in rubbish. They could not serve hot drinks,  but the food was ok.", "stars": 1}
{"review": "I went in today at about 4pm to grab some food before work. The girl serving was moaning to her supervisors about how long she had to stay on the till she then walked away talking to his back and didn't  acknowledge me at all,...", "stars": 1}
{"review": "Slow service, dirty, most tables were either full of rubbish because the bin was full or hadn't been cleaned. Will never visit again!", "stars": 1}
{"review": "Called in here on Saturday night before 11pm - seating area was closed, but there is a \"standing\" area and a couple of seats in the window.  2/3 people before us, so not busy. Was not impressed with the state of the place in that...", "stars": 2}
{"review": "Painstakingly slow and completely incapable of taking an order. Avoid at all cost if you're not a huge KFC fan", "stars": 1}
{"review": "The staff were very courteous and service was very prompt. It is on high street with good sitting arrangements", "stars": 4}
{"review": "When you go to KFC you know what you will get, some are poor quality or dirty, this one was good.\nThe food was freshly cooked, served by a helpful member of staff and the price provided good value", "stars": 4}
{"review": "Tried the new hottest Zinger , prefer the normal Zinger, great chicken tho as usual and plenty of space to eat it. Love the hot wings and original chicken.", "stars": 4}
{"review": "I prefer BK to the other fast food outlets.  I can get my military discount on the meals I order.  Packed as usual but I got served quite quickly.  The food was really good and hot.", "stars": 3}
{"review": "Last time I got a take away from here, when I got home the two pots of gravy both missing. \nToday I ordered extra chips & they where missing. \nWhen I was eating my meal two other people had to ask for missing items not...", "stars": 2}
{"review": "Stopped for quick bite to eat on way back from Portsmouth. Not the quickest service I've ever had, but staff were very polite and professional. Food was tasty and hot, but a few items in our order were wrong (chips instead of corn on cob...", "stars": 4}
{"review": "Popped in for a burrito recently and enjoyed it. Service was quick, food was hot and the table was clean. Even the chips were hot for a change. Bonus!", "stars": 4}
{"review": "Went here tonight with the wife for a quick bite to eat, staff were polite and we were served very quick as I was calling out my order a number member of staff were already trying it up so when we got the food it...", "stars": 5}
{"review": "Always end up here after being out or coming back late from somewhere & it's so good it's now open late! The staff are great and the food is always super have to love colonel!", "stars": 4}
{"review": "Sorry what a joke !!! Went into KFC to get a bucket for tea ... It's was its usual untidy self ..Waiting ten minutes only to be told .. No chicken on the bone for 10 minutes .. I don't think she realised half the...", "stars": 1}
{"review": "Tonight I visited KFC and I am appalled by the service that was delivered to me. Customer service is a main priority in a fast food business (trust me I know) and what i received this evening was disgusting. Whom ever was serving me was...", "stars": 1}
{"review": "By the time I got there, they were just opening. Because of this, I had good, fast service at the tills and collecting my order. I was also the only one in the restaurant too, which I wasn't surprised by. Overall it was a pleasant...", "stars": 5}
{"review": "We have used this KFC after visiting the cinemas in Exeter. It's convenient, we pass it walking back to the car. However we have had enough of the dirty place! Tables not cleared or wiped, floor dirty, toilets really disgusting I have had to report...", "stars": 1}
{"review": "Standard KFC so I enjoy this restaurant. Annoying when people have been saying \"greasy\" when all KFC is greasy. Definitely good for a hangover.", "stars": 5}
{"review": "gone down hill lately this pulled chicken looks like a load of rubbish in a bun awful very disappointed", "stars": 3}
{"review": "Although it seems always busy there are loads of seats.\nFood is prepared with clean oil until some other KFCs.\nFriendly service.", "stars": 4}
{"review": "Disgusting! My chicken was so greasy I couldn't eat it, I complained and was offered a different type, but it had made me feel so sick I said no. The children's chicken popcorn wasn't much better, and for some reason came with a fruit winder...", "stars": 1}
{"review": "I have frequented this KFC in recent times to find out that things had improved vastly since my last visit early last year, I noticed that they have a new restaurant area and things had improved that is until last Sunday 16/6/2013 where staff seem...", "stars": 1}
{"review": "Why are all KFC's full of miserable staff?  As usual cold, soggy chips, wraps which taste like yesterdays leftovers and watered down drink.", "stars": 2}
{"review": "Due to guest evening( after refurbishment) unable to purchase anything.We use this restaurant on a frequent basis, very poor that kfc did not give any consideration to the many  customers who turned up to eat, lets hope they have all  the menu available on our...", "stars": 1}
{"review": "food was really easy and well cooked and tables and floor spotless", "stars": 4}
{"review": "More often than not, you place your order, get given it... and it's wrong.\n\nOr something that really winds me up from this store... you order several things, they put it all in the paper bag for takeaway, then say oh it's going to be...", "stars": 2}
{"review": "It's KFC - what else do you want?  Very conveniently located by the Odeon cinema so perfect for that late evening indulgence.", "stars": 3}
{"review": "Nice and clean and just KFC. Not much to say about this really", "stars": 4}
{"review": "Came here for midday lunch and had the spring rolls with Doner boxes, the meat was really delicious and the salad was fresh as well", "stars": 5}
{"review": "the food was good and the staff was really friendly, here from italy and really enjoyed a lot , will come back again if we can!!!", "stars": 5}
{"review": "The food was amazing and the place was really clean, staff was friendly and they suggested us some good items on the menu as well, will be coming back", "stars": 5}
{"review": "Excellent staff and very good customer service all the time murtaza is the best person there in German kabab very fresh food we ate", "stars": 5}
{"review": "best kebab place in exeter love the meat and very friendly staff. must visit place in exeter for kebabs highly recommended as it is also halal.", "stars": 5}
{"review": "Visited with my spouse and had a wonderful experience. The food was fresh and hot. The staff was very welcoming especially the manager who made sure everything was spot on ! Kuddos to the team", "stars": 5}
{"review": "Excellent Food, Great Service! Food was served hot and fresh and staff was very cooperative. \n\nHighly Recommended for people who are meat lovers!!", "stars": 5}
{"review": "Had  a great experience, wonderful food, friendly staff, neat and tidy lobby, kabab was fantastic, highly recommend must go for it", "stars": 5}
{"review": "Lovely experience with my fam.The resturent was neat clean and tidy and food is always amazing and delicious.\nWould love to come back", "stars": 5}
{"review": "if you are hungry there is no place other than german doner kebab,thier sauce will make you addicted love them .highly recommended", "stars": 5}
{"review": "Great food and quality service especially kebab are amazing yummy. Service was amazing especially rizwan was really helpful.", "stars": 5}
{"review": "Went with friends and thoroughly enjoyed the food. Was a good environment, very clean and the staff were great. All very useful and very kind.", "stars": 5}
{"review": "Tried the doner box with fries and the food came out hot and fresh, it tasted good and was barely filling as well ...a good try if you like kebabs", "stars": 5}
{"review": "This place is great for a kebab, the sauces are really good and the meats are not at all greasy, will be coming here soon ahain", "stars": 5}
{"review": "Had the chicken doner wraps and they tasted really good, the portion size is filling and the salad was really fresh as well", "stars": 5}
{"review": "The food was good and the staff was really polite...portion sizes are good and filling as well will definitely be recommending to others", "stars": 5}
{"review": "Tried the og kebab on the gdk app and it was on offer it was really good for its price and it tasted great as well ............", "stars": 5}
{"review": "Came in here for a kebab and it tasted really good, would definitely be coming back to try more stuff and will recommend to other people as well", "stars": 5}
{"review": "Had symptous meal the taste was very good.Specially doner wrap would love to come back again. Thank you riz for quality service.", "stars": 5}
{"review": "Always have the doner box with fries and salad amd they always give me extra saune...really love coming to GDK, food is amazing", "stars": 5}
{"review": "Came here and tried the kebabs, they were good, the food is halal which is a great bonus so would definitely be coming back here again", "stars": 5}
{"review": "Came here for the first time too try a kebab and it's safe to say it's not disappointing at a,food is great and everyone is really polite Nd friendly", "stars": 5}
{"review": "Lovely food and lovely service. Happy with my meal and staff were efficient and friendly. Would probably go back again.", "stars": 5}
{"review": "Had the boxes and they were really nice, will be tryibg more stuff on the menu soon, great atmosphere as well, friendlybstaff.....", "stars": 5}
{"review": "I came here with my friend and tried veggie doner, this was the first time for me trying it. I would say it was good to try this.", "stars": 5}
{"review": "Wonderful!great  ambience excellent food, very friendly staff they are very welcoming and helpful…ver cozy and clean.highly recommended place 10/10", "stars": 5}
{"review": "Absolutely loved my experience at German Doner Kebab in Exeter! The flavors were a symphony of delight, and the service was top-notch. The kebabs were succulent, the atmosphere was inviting, and I can't wait to go back for another delicious meal. Highly recommend!", "stars": 5}
{"review": "I came here with my friends the kebab was amazing and the female staff taking our order was kind as usual and the interior decor was nice and clean. My friends and I had some wraps and some kebabs, and it was tasty. Props to...", "stars": 5}
{"review": "I went with my family in town and decided to have some food my son insisted me to go to German doner  kebab.I was so surprised they had such a great food with clean and tisy atmosphere love it.", "stars": 5}
{"review": "The chicken doner wrap is really good to try it you like kebabs, the staff is polite and the atmosphere is decent as well!!!", "stars": 5}
{"review": "Went in for lunch and the meat was really good, it felt very light and the staff gave us extra sauces as well, had a good time!", "stars": 5}
{"review": "1st time at GDK & liked it, had the mixed meat, nice n tasty just didn't like eating out the box it came in bit fiddly. The dips that came with it were tasty too, i would go again but might need one of the...", "stars": 5}
{"review": "Had the original kebab as it was a part of the mad January offer and it sure was worth the money!! Absolutely smashing!!!!", "stars": 5}
{"review": "Great food. Brilliant service! Tasted delicious, very polite staff. The salad was particularly good. Meat a lot less salty than previous visits which we appreciated.", "stars": 5}
{"review": "Sunday mid day lunch and tried the doner boxes with fries and salad, the meat melted in the mouth and the sauces definitely added flavor", "stars": 5}
{"review": "The food was nice and the atmosphere was very friendly as well, staff helped us and they were very welcoming, coming back soon", "stars": 5}
{"review": "Visited the place today and it was really good, the food tasted delicious and the staff helped us decide what to eat as well", "stars": 5}
{"review": "Brilliant as always. Really friendly team! Would definitely stop by even at busy periods. Came on a busy Saturday and it was very smooth", "stars": 5}
{"review": "It was an absolute delight to have our Wednesday lunch at German Doner Kebab! definitely living up to its name, good food and great service!!", "stars": 5}
{"review": "The lady on the till was very kind and friendly and she suggested me the krunch burger, it was really good and definitely worth giving a try!!!!", "stars": 5}
{"review": "The food was really good and the staff was really polite, would definitely be coming back here!!!!!!", "stars": 5}
{"review": "had an amazing dining experience at German Doner Kebab in Chelmsford. The food was not only delicious but also served promptly. The staff were friendly and accommodating, making us feel welcome from the moment we walked in.", "stars": 5}
{"review": "Tried the Doner wrap and the spring rolls and they were outstanding, the staff was really polite as well and the ambiance was great too", "stars": 5}
{"review": "Good eas good aöf the stagf was really polıte as well, the sprıng roll ın partıcular was amazıng great one", "stars": 5}
{"review": "Durham wrap was amazing with chilli cheese sauce hit and melted was very nice would recoevwryone to try it yih will love it .", "stars": 5}
{"review": "Went in for a kebab and tried the mix meat it was really delicious and the sauces were amazing as well, would come back here again for sure", "stars": 5}
{"review": "Great food I came for lunch stire was really tidy and service was quick Rizwan served us amd guide us about SKK very easy to order.", "stars": 5}
{"review": "Great foood and quality service would love to come back again . Their kebab are lovely specially with sauces garlic one amazing.", "stars": 5}
{"review": "great food great service had a wrap with chicken and flaming fries and the mango juice is really good", "stars": 5}
{"review": "Lunch and kebab no place other then German doner kebab Exeter . Signature sauces are amazing so tidy environment❤️", "stars": 5}
{"review": "The food was really good and the staff is really friendly, I would definitely recommend this to everyone.", "stars": 5}
{"review": "The food was really nice the meat melted in my mouth and the sauces tasted really good as well, is a must try for all kebab lovers!!", "stars": 5}
{"review": "Had the orignal kebab and it was really delicious, the place was pretty clean and staff were friendl as well", "stars": 5}
{"review": "We came in to grab a quick bite andnitbwas really delicious, will come back again and try different things as well", "stars": 5}
{"review": "Rate the service highly! The food is always fresh, haven’t ever had a bad experience…baring in mind this is our favourite place to grab a takeaway from. 10/10 always. Highly recommend xx", "stars": 5}
{"review": "Great service and food really love the hospitality and food,chilli cheese bites are yummy especially with garlic sauce.", "stars": 5}
{"review": "The food is good, wraps with chicken or meat, fair price, good portion. Usually they serve your food very quickly.", "stars": 5}
{"review": "If you love kebab must visit german Doner kebab their meats are juicy and breads are amazing .recommend it.", "stars": 5}
{"review": "We came here and the staff was lovely, the manager also gave us a delivery rider discount and we really enjoyed the food", "stars": 5}
{"review": "the food was really good and the atmosphere was very nice as well, the staff was really helpful and polite", "stars": 5}
{"review": "Always love coming here, have the best food and best service. Staff always friendly and place is nice and clean my favourite place to eat in Exeter", "stars": 5}
{"review": "Great food with lovely staff.Panini was amazing with flaming fries really love it .highly recommended.", "stars": 5}
{"review": "We went to GDK and the kebabs really tasted and gave the flavour of German kebab, absolutely delicious and great taste!!", "stars": 5}
{"review": "Amazing service experience with rizwan live it. Kebab are great service is very nice and tidy love you come back", "stars": 5}
{"review": "Great service, really tasty food perfect Portion size. Customer service from  rizwan.\nThank you ! !", "stars": 5}
{"review": "The food was really good and the staff were really friendly as well, we will definitely be coming back here to try more stuff", "stars": 5}
{"review": "Yummy dinner with German dinner kebab.kebab are lovely secret sauces are lovely especially garlic sauce was amazing.", "stars": 5}
{"review": "Great food with quality serivce. Will love to come back again .highly recommended to all my friends.", "stars": 5}
{"review": "We had the boss box take out and it was really good the flaming spice tasted absolutely delicious!!!", "stars": 5}
{"review": "How can I leave a review that reflects reality? I am a real person who has actually been to this restaurant and not a single reviewer who thinks it is the best place in the whole world. Food is gross, customer service is unpleasant and...", "stars": 1}
{"review": "Great experiment with Rizwan .Lovely experience and amazing food with comfortable environment. Highly recommended", "stars": 5}
{"review": "The food was really good and the place was really clean and hygeine, will definitiely be coming back here", "stars": 5}
{"review": "The place is really clean and the food is really tasty, the kebabs were very flavorful and delicious", "stars": 5}
{"review": "I went with my family in town and decided to have some food my son insisted me to go to German doner  kebab.I was so surprised they had such a great food with clean and tisy atmosphere love it.", "stars": 5}
{"review": "Lovely experience with my fam.The resturent was neat clean and tidy and food is always amazing and delicious.", "stars": 5}
{"review": "amazing customer service and a very friendly atmosphere i would 100% recommend and it was also terrific food", "stars": 5}
{"review": "I was very impressed with the standard of food at this establishment, Thankyou gdk Exeter!!\nMy panini had the perfect amount of chicken aswell", "stars": 5}
{"review": "The og kebab was spectacular, the chicken melted in my mouth and they gave us extra garlic sauce as well", "stars": 5}
{"review": "Some of the best kebabs I have had in a while. The place was clean and service was quick. Staff were friendly. Definitely coming back and would highly recommend.", "stars": 5}
{"review": "Amazing food and great atmosphere in the restaurant, it was absolutely amazing and I will definitely be coming back", "stars": 5}
{"review": "I had the best expiernce with murtaza,Majhindar,Akhsay they were amazing !!! The best in the business !!", "stars": 5}
{"review": "The food was great and the service was absolutely stellar, will be coming back here definitely!!!!!!", "stars": 5}
{"review": "Food was good and the staff was very helpful as well, would be coming back here again to try different things on the menu", "stars": 5}
{"review": "Decent food. It was clean. Decent staff service. Peaceful ambiance. Probably would go again in the future.", "stars": 5}
{"review": "Me and my wife were to have lunch at your doner Kebab, which was very deliciously prepared by your chefs. We thank you very much. Special thanks to Manjinder Singh.", "stars": 5}
{"review": "Very good food nice experience good service frendly staff,nice location.l hardlopen recomand this place in Exeter", "stars": 5}
{"review": "Visited German doner kebab today and it was such a lovely experience, the staff was really polite and helpful and the food was smashing", "stars": 5}
{"review": "The food was absolutely amazing and the meat melted in our mouth, we were extremely happy with the experience!", "stars": 5}
{"review": "had lunch today at GDK exeter and tried the chicken kebab, it was really nice especially all the sauces tasted lovely", "stars": 5}
{"review": "Food was good and atmosphere was lovely as well! The kebabs tasted amazing will definitely be coming back", "stars": 5}
{"review": "Kebabs are done right in this place without any doubt.amazing place for eat in when you want quality kebab in clean and tidy environment. Manjinder was lovely while serving us.", "stars": 5}
{"review": "What an experience with Riz guided us to SSK easy to order. Lots of options especially veggies is amazing.", "stars": 5}
{"review": "This place is spacious with great food taste and options. Tried a few veggie option and those were delicious.", "stars": 5}
{"review": "Food was amazing love it especially hilal option.recommend all my friend s move to exeter. Lovely atmosphere and clean and tidy .", "stars": 5}
{"review": "Served by Manjinder with a smile! Food was excellent quality and warm. Would recommend to anyone visiting Exeter to try.", "stars": 5}
{"review": "Came in today on my lunch break & had the best service from Murtaza as always & amazing food from Akshay. Will be back again soon. \nThanks guys!", "stars": 5}
{"review": "Food was amazing quick service and friendly staff and services and restaurant was clean and quiet for a nice lunch", "stars": 5}
{"review": "The food was really nice and the staff was also really helpful! They gave us extra sauce and it tasted amazing as well", "stars": 5}
{"review": "Really nice atmosphere, great food and good price the owner is amaizing and really funny the employees are very friendly and always there to help", "stars": 5}
{"review": "I recently tried the kebab, and it was absolutely fantastic! The flavors were rich and authentic, the meat was perfectly seasoned and tender. The service was quick, and the portion size was generous. A delightful experience – I'll definitely be back for more!", "stars": 5}
{"review": "The food was amazing and the staff was very nice as well, we had a sit in order and the food was hot and delicious", "stars": 5}
{"review": "The kebabs were really nice the meat melted in the mouth and the sauces added flavour as well will be visiting again", "stars": 5}
{"review": "Good food and Ruchi was polite and helped us decide what to order, the doneer boxes especially were amazibg", "stars": 5}
{"review": "Amazing experience with Rizwan.Download the GDK app and it is very easy to order.Store was very neat never saw such kebab shop it’s posh kebab with great taste.highly recommended.", "stars": 5}
{"review": "Great place to eat food. Staff are very kind and polite. The food is really tasty and I would recommend everyone to come here.Rizwan was amazing in service", "stars": 5}
{"review": "Love kebeb. Especially German doner. Staff is lovely and staff is really helpful on SSk .Highly recommended", "stars": 5}
{"review": "my daughter liked her meal and she thought the employees were nice. good food. good customer service. 10/10.", "stars": 5}
{"review": "Great quality food and excellent customer service from Manjinder and colleagues. Whole family really enjoyed the meal!", "stars": 5}
{"review": "Good service and employees are kind and helpful I was very impressed by how fast the food came out it was hot and fresh", "stars": 5}
{"review": "I had an excellent experience at GDK Exeter, staff were friendly and helped me through ordering my food, answering all questions I had about the menu\n\nFood was fresh and portions were very reasonable I would reccomend to anyone looking for a quick meal", "stars": 5}
{"review": "If you love kebab then innexter there is no place to go except German doner kebab .Ther clean and tidy restaurant along with fresh salad along with hot meat will attract you.Rizwan and Manjinder  was really helpful on till.", "stars": 5}
{"review": "What an experience with Rizwan and Murtaza it was a wonderful meal especially in busy time services was quick and hot serving.love to come back again.", "stars": 5}
{"review": "when i was visit first time in GDK exeter first impression was very good of the staff specialy manjinder singh and also he was make very yummy kebab for us i was like it now i usally go there for eat and i was specially...", "stars": 5}
{"review": "Manjinder see is very cooperative which one working in a kitchen as well as ruchi have very nice nature both guys are fantastic because of these guys I every time visit GDK as well as food is very lovely and hygiene", "stars": 5}
{"review": "I couldn't wait to tuck in so no before photo but an after photo. Amazing as always super friendly staff and amazing food thank you", "stars": 5}
{"review": "Visited the gdk exeter staff is supper quick service is excellent would recommended it to everyone.", "stars": 5}
{"review": "Had a great time here at this lovely restaurant. Was very helpfully assisted by a professional, yet exciting, and quite frankly joyful employee by the name of Murtaza. Thank you", "stars": 5}
{"review": "Good food, prompt service, Murtaza was particularly helpful and made me feel special, food was delicious", "stars": 5}
{"review": "Food was great quality and fast, Rizwan made my ordering process enjoyable and very easy, will definitely  be back😁", "stars": 5}
{"review": "Been here for dinner today and the panini was absolutely delicious, loved the taste and the staff helped us choose it as well, amazing experience!!", "stars": 5}
{"review": "good food always get the wrap and its very nice always giod to be back here at gdk amazing experience as always", "stars": 5}
{"review": "The food was really delicious and the staff was very polite, helped us with the orders and suggested what we should get!", "stars": 5}
{"review": "Saturday lunch today was amazing at GDK! We ordered kebabs and tge taste was amazing, would definitely visit again", "stars": 5}
{"review": "Restaurant clean and tidy . The service was quick with fresh meat and and salad .love to eat gym box 🫶🏻", "stars": 5}
{"review": "Amazing kebabs with delicious melting meat, the sauces were amazing and the staff was friendly and polite!!", "stars": 5}
{"review": "Great kebab, lovely sauces and good portion size. I was impressed with how fast I was served, even though there were quite a lot of customers.", "stars": 5}
{"review": "We’re regular customers here due to the consistently high standard of food and service. Have tried most things on the menu now and never been disappointed. A real gem in the heart of Exeter.", "stars": 5}
{"review": "I am very impressed with the quality and service I received from German doner kebab food was very good and staff were friendly", "stars": 5}
{"review": "Lovley bit of donner kebab from the Germans service was very good and I’ll definitley be back for more👀", "stars": 5}
{"review": "i have rated this a 5 star review due to the sheer excellence and professionalism that i can clearly see that's gone into making this next generational food, my solo journey has led me to a place or raw satisfaction and pure joy which all...", "stars": 5}
{"review": "Food and atmosphere was good, place was clean. Kebab was great with lots of meat and salad, overall a great experience! Will be back!", "stars": 5}
{"review": "Had a great time here at GDK. Had their OG Kebab and the Fries and Salad Doner Box with their exceptional sauces. The customer service by Shuay was also great!", "stars": 5}
{"review": "Went 2 days in a row, first day they didn’t take card and was cash only but only told you at order point which meant you had to wait in the queue before getting out! \nSecond day, call it fast food! More like slow food...", "stars": 1}
{"review": "Only person waiting to be served. 5 staff chatting behind where the food is served a couple of them made eye contact and knew I was there. Stood there 5 minutes didn’t acknowledge me or speak just kept chatting didn’t sample any food. Went next...", "stars": 1}
{"review": "Cold chips Dry Chicken was the worst meal We have had in a long time really hard to find anything positive to say it was clean", "stars": 1}
{"review": "In general I'm not a fan of using drive thru as you will order a chicken sandwich, then drive 30 miles to find out it's tuna.\n\nHowever on this occasion KFC did a phenomenal job not only was all my food there and bang average...", "stars": 5}
{"review": "Thought I was hungry and this deal looked just the job as I pulled into the drive-thru, however by the time I'd ordered/paid/collected the rather unsavoury pong (stale cooking oil?) pervading the area had stunted my appetite. Undeterred I drove the short distance home and...", "stars": 2}
{"review": "This is, in my opinion, one of the best fast food outlets in the region. \nThe food is freshly cooked, and served by friendly, helpful and efficient staff. The seating area is always clean and tidy. A good restaurant.", "stars": 5}
{"review": "having been totally bamboozled by the touch screen menu in mcdonalds KFC means a normal queue and easy to understand menu.The staff answer question without making you feel old and hopeless.", "stars": 5}
{"review": "Grandaughters likes a feast from here when we are looking after them on a Saturday.\nOnly beans and gravy as sides\nOnly Fanta as a drink choice\nNo sauces\nWe chose the beans as sides,one tub was full of beans,other tub had a few beans...", "stars": 2}
{"review": "Fast food outlet in Dalton Park quick friendly service reasonably priced good fast food.\n\nThis outlet also has a drive through and can get very busy.\n\nWhile we were there the public area could have done with a clean.", "stars": 4}
{"review": "All I need to say is fantastic !  Good food , friendly staff, reasonably priced , good variety , just Great !", "stars": 5}
{"review": "You have got to try their take home ready meal, Seafood Lasagne, it is absolutely delicious, lots of fish, prawns etc  and much lighter than a beef mince lasagne, ask Howard (the owner) nicely and he will even prepare it in one of your own...", "stars": 5}
{"review": "Looking for the best lunch in town, look no further! Just one visit to the French Deli and you'll know why Howard and his team have queues of people stretching out of the door some days! All made fresh the deli offer sandwiches, soups, jackets...", "stars": 5}
{"review": "Excellent family owned business. Always had excellent baguette/sandwich and lasagne! Def worth a visit.", "stars": 5}
{"review": "The French delicatessen is my go-to on a daily basis.  The proprietor and staff are all so friendly they make me smile for the whole day.  They inject a lot of fun into their work and the customers enjoy going there.  The food is absolutely...", "stars": 5}
{"review": "The food is excellent and staff are friendly and efficient. I would recommend the deli for a quick lunch to go or for catering, always excellent.", "stars": 5}
{"review": "Great little deli with sandwhiches and baguettes made fresh! Have often had their lasagnas when having friends round to save on the cooking! \nDefinitely recommend the Sausage and Bacon morning Baguette! \nAlso have great deals for students!", "stars": 5}
{"review": "Have been a customer of the Deli for several years.  Always found the food to be of top quality (especially the pasta salad ) and the staff are always very friendly.... the service is quick also which is not always the case in some of...", "stars": 5}
{"review": "We regularly pop in here for a panini, which are always delicious. \nGreat choice of cheeses, particularly when looking for a few different varieties for special occasions. \nFriendly service & always happy to help with recommendations. \nThoroughly recommend the fresh & frozen take away items,...", "stars": 5}
{"review": "We were shopping in our local town and fancied a bite to eat and didn't fancy usual fast food so we visited the deli \n All I can say is WoW the selection and freshness is brilliant and the stuff that you can buy to heat...", "stars": 5}
{"review": "In my opinion the French deli offers the best food in town and is ideal for students looking for a spot of lunch. Variety of food from filled baguettes to a cup of soup! Staff are always very polite and make you feel very welcome....", "stars": 5}
{"review": "Always pay the deli a visit for breakfast when I'm out on my bike,food is always fresh and damn good value.all the staff are brilliant.\nThe range of food is astounding and tasty.\nCan't wait to visit again soon.", "stars": 5}
{"review": "My wife and I have visited the French Delicatessen a number of times. The food is always very nice and a reasonable price. There is plenty of choice so everyone should be able to find something they like. They provide a quick and tasty lunch...", "stars": 5}
{"review": "A really delightful place, staff exceptionally helpful and friendly nothing too much trouble. Food delicious especially the lasagna. Really cant fault. Quality food at affordable prices", "stars": 5}
{"review": "We visited here today for lunch during our visit to Stourbridge.\nMy wife opted for the Brie and Tomato Panini and I fancied the Sausage and Onion Baguette, hot of course.\nI had a coke and my wife had a Latte, which she said was...", "stars": 4}
{"review": "We had reserved a table. I would advise anyone going to do this as it can get busy and its not that big an area.\nVery friendly staff and staff were knowledgeable on the food items in detail which was very good and helpful as...", "stars": 3}
{"review": "I'm a local and I come here regularly to get lunch. I always normally get the £2 baguette of the day as it's the cheapest option in terms of baguettes, but they also do really nice looking pastas, lasagnes and paninis. If you're looking for...", "stars": 4}
{"review": "I'm a student from a local college and I absolutely ADORE this place! \nI normally go for either soup or a panini and both are to die for - and the student offers/discounts top off the French Deli experience.\n\nDefinitely recommend if you love great...", "stars": 5}
{"review": "This is a great deli! Fantastic place to eat, great range of meals and lunches prepared from scratch and at reasonable prices. Highly recommend!", "stars": 5}
{"review": "I visit the French deli at least twice a week, the runny egg sandwiches and Brie pannis are amazing. The Danish Toblerone Cake and Rocky Road are my favourites ! The food is resonably priced and the staff are very helpful and welcoming . I'd...", "stars": 5}
{"review": "Customer service is lacking not a smile amongst the team, pot luck who gets served as there seems to be 2 queues so you just get a muddle of customers looking confused. Food is usualy nice however pasta today is soaked in mayo making it...", "stars": 3}
{"review": "Great food consistently. Come here regularly for lunch when I'm in Stourbridge and it's always delicious food. Wish I could come more often.", "stars": 5}
{"review": "I've had many a lunch from The French Deli and I can highly recommend them, my personal recommendation is to try the stilton and red pepper baguette - my favourite. To be fair everything here is high quality. The soup is delicious too - I...", "stars": 5}
{"review": "Have used this deli ever since it was opened by a genuine French food-loving chef and his wife.  Superb from day one.  Still maintaining the high standards it sets across the broad food range in which it specialises.  Superb vegetarian lasagne (large and small).  Our...", "stars": 5}
{"review": "Wonderful venue for lunch. Ate here today with an old school pal. French onion soup was delicious, followed by a fish pie and bread and butter pudding. All washed down with a bottle of Fitou. Excellent food, excellent ambience, excellent food. What more does a...", "stars": 5}
{"review": "Always up for going here for a sandwich, they are amazing!! Lasagne is great too! Made freshly in front of you, reasonably price too!", "stars": 5}
{"review": "I highly recommend popping in here if you are nearby for a snack or light lunch. All the food is freshly prepared and tastes delicious every time. You can buy sandwiches to home cooked foods such as lasagne, and they will even hear it for...", "stars": 5}
{"review": "Food is always fresh and tasty, staff are friendly and hardworking, loyalty card state is great, a brilliant local business :)", "stars": 5}
{"review": "Friendly and Fresh, best baguettes in town.  They all know what they are doing - Have been going for years. Rupert", "stars": 5}
{"review": "Been here a few times and always had a great service. The sandwiches are fresh and good value. The breakfast sandwiches are also particularly nice. The best by far though is the pork pies and take home lasagne!", "stars": 5}
{"review": "On the night my partner asked me out, 29 years ago, we visited the French Deli and bought pretzels.  I used to go there a lot because i was a student and the pizza they made was a real treat.\n\nToday, my partner and I...", "stars": 5}
{"review": "Have popped into the french deli a few times over the last 5 years, the range of lunch time treats they offer is fantastic. Always a little pick me up when I feel the need to treat myself to something a little different.", "stars": 4}
{"review": "Staff so friendly and extremely helpful. I collected a lasgna for six people and it was absolutely delicious, never tasted better and everyone commented on how fab it was. So easy just pop it in the oven you have no work to do, you can...", "stars": 5}
{"review": "Love the quality of the food so much here! My favorite part is when you walk in the door the smell of the homemade food is just divine! The quality is always great and the price is good.", "stars": 5}
{"review": "Special place for excellent food. Light and easy in the day. Very special at night. Exceptional for event nights. Not cheap but very well worth every mouthful.", "stars": 5}
{"review": "I must be missing something here.\nBeen here many times over the years and made a conscious decision to not go back as thought the staff were aloof and food not brilliant.\nBeen in recently and yet again was disappointed \nAloof staff, long wait not...", "stars": 2}
{"review": "Always a fresh selection of food in offer for fair prices. My personal favourite is the student discount soup with a Demi baguette! Friendly staff - would highly recommend. Wish there were more seats outside though...", "stars": 4}
{"review": "This is an excellent sandwich shop / deli with many delicious filings on different breads and a good selection of deli produce. The staff are very friendly and the food is excellent value. Much better than Subway. They really fill there baguettes/ sandwiches. There's a...", "stars": 5}
{"review": "My brother in law and I popped in for fresh pasta and a large bowl of salad with dressing to share between us, we sat out side in the sun to eat and happy bunny s we were..\nFresh cooked food for two 7 pounds...", "stars": 4}
{"review": "Enjoyed coming in for baguettes and soup during college, super tasty and fresh. can’t wait till you reopen so I can visit again ❤️", "stars": 5}
{"review": "Jerk chicken salad. Best ever. So reasonable and very generous portions. Can’t wait to try more. Very busy - can see why. Excellent warm customer service too. 10/10", "stars": 5}
{"review": "Bought a number of lunches from here. Hot food is good. I can recommend lasagna in particular.\nThe Baguettes are brilliant.Brie is amazing.", "stars": 5}
{"review": "We popped into the French Deli to try their lunchtime panini special, sweet chilli chicken. I can say without any doubt this won’t be our last time. Great food with very friendly staff.", "stars": 5}
{"review": "More of a Cafe than a Deli. Now have seats to sit indoors and eat too. Fantastic food and friendly service. Always seems busy which helps everything be so fresh.", "stars": 5}
{"review": "Visited recently and was very surprised by the totally refurbished French Deli. It feels so clean, warm and welcoming. Food all looks really good and fresh, staff very polite and cheery and the addition of tables means you can sit in the warm and enjoy...", "stars": 5}
{"review": "We enjoyed our food at the French Deli, a couple of us had the leek and potato soup, which was delicious. We decided to eat outside because the weather was nice however a member of staff came outside and told us ‘these seats are only...", "stars": 3}
{"review": "Lovely staff and great quality food. The range of choices and flexibility is amazing.\nThey also have a range of student discounts.", "stars": 5}
{"review": "Called in  by chance, so glad we did. Welcoming smile as we entered. Nice menu, vegetarians and vegans also catered for, plus they will make any combination you desire.\n\nHome made fresh soup, served in a large cup, they looked a little surprised when I...", "stars": 5}
{"review": "Plenty of choice on the menu, but we only really wanted a coffee: we settled for coffee and croissant (with jam and butter) for a more-than-reasonable £1.95 each.  Very pleasant to sit and watch the world go by: will return next time we're in the...", "stars": 5}
{"review": "This deli is a great place to grab a quick lunch. From soup to cottage pie. It's great food on the go. \n\nIt's great for students offering a 10% discount. But this does mean at the collages lunch time it can be very busy. But...", "stars": 5}
{"review": "Great local deli. Always drop in for lunch, varied choice and fairly priced. Note: avoid the local 6th Form lunch breaks it can get very busy, call in early to collect lunch", "stars": 5}
{"review": "Came in tonight hope to get a quick bite to eat with my children. Starters came out ok but we had been waiting very long time for the mains. I was going to say I had a bad experience however the bar ladies approach and...", "stars": 5}
{"review": "The Beaufort arms was arranged as the location for our meeting point with Friends who I was picking up, who I'd then take to Portishead. After a 3 hour drive, I drove past the past the pub and turned around as I could see my...", "stars": 3}
{"review": "Our group of 15 people had a pre-booked, pre-ordered Christmas lunch on 11 December. Service from bar, kitchen & waiting staff was timely, efficient and friendly,  meal was good value for money and the event was a success.", "stars": 5}
{"review": "Pub has just been refurbished but it is far to dark now not like it's sister pub, the Sandringham. the Beaufort is not very big and should have been done in light colours \nfor a larger effect. As usual not enough staff and tables we...", "stars": 2}
{"review": "Parking fine issued. I was not informed I need to register reg when I visited with my elderly gran.\nFood was poor.", "stars": 1}
{"review": "Great food in a cosy pub which we stumbled on then our train was delayed \nGreat atmosphere and service as well would highly recommend", "stars": 4}
{"review": "Welcomed with a huge smile - a well presented bar and eager to help staff. Drinks purchased and food ordered without any delays, very friendly waitress called Phoebe attended to us throughout our meal - great value would return and recommend-", "stars": 5}
{"review": "Had to meet a business colleague as they were coming In to parkway from the moment I arrived I was subject to some of the best customer service I have had in a long time greeted upon arrival .\nAlthough I had not booked when...", "stars": 5}
{"review": "All the staff are very rude and very unprofessional every time they are angry and treat you like garbage also their parking will lead to a fine of 85£ 😅 so be careful u don’t need a place like that it’s sad because the place...", "stars": 1}
{"review": "Ate here sunday 16th July at 7.30pm onwards. There seems to have been a party for a football club while trying to trade for general customers, surprising for a sunday evening. A lot of noise and music was blaring. There was no trouble but it...", "stars": 2}
{"review": "Why can't you sell half pint measures ? I was in the pub last night and was told it was not policy to sell soft drinks in half pint measures. I therefore had to buy a pint of orange juice, two pints of soda and...", "stars": 1}
{"review": "Lovely ice cold drinks in a nice friendly pub,, staff helpful and knowledgeable,, food great quality,, lovely village setting…..", "stars": 5}
{"review": "Went in for drinks with friends what a massive improvement staff all seemed to be enjoying there selfs we all had a great evening", "stars": 5}
{"review": "It’s been a month or two since I was last here and although it was never an amazing place, now it’s even worse. Little staff, confusing menus because they’ve ran out of food, ran out of ice, people taking food orders didn’t pay attention and...", "stars": 1}
{"review": "I didn't think things could go downhill since I last reviewed in October of last year, but it has. I'm an occasional visitor - say once or twice a week - but there just aren't enough staff. The queues just to get a pint are...", "stars": 1}
{"review": "There was no food available although people were eating \n\nOne person serving at the bar, which resulted in long waits \n\nA generally dirty pub with a tired interior \n\nI don’t rate many establishments this bad ( read my other reviews around the world) but this...", "stars": 2}
{"review": "Came on the 16th April for some lunch and drinks. The outside area had a lot of rubbish on tables but thought nothing if it. Walked in and it was pretty busy, would say it’s very popular with the locals . Got our drinks and...", "stars": 1}
{"review": "I had the gammon steak, unfortunately the Gammon was overcooked and dry the egg was also overcooked the yolk was hard, the peas slightly undercooked and hard… i would recommend finding somewhere else to eat, I will not eat at this restaurant again..", "stars": 2}
{"review": "The Beaufort Arms used to be a friendly welcoming pub but since Jim the manager has left it has gone way downhill. We went for a quiet early evening drink on what is usually a quiet Tuesday, The girls behind the Bar were clueless, there...", "stars": 1}
{"review": "2weeks running, food not good. \nLast week chicken not cooke, it went back to be cooked then the rest came back cold. This week gave the benefit of the doubt \nHad a beef roast, beef was tough, roasties- well I don’t think they were, more...", "stars": 1}
{"review": "Visited recently after making a booking online for 6 people and a dog. Upon arrival it was busy with many people at the bar waiting to be served by the 1 bar person who really was not up to the job. After waiting for some...", "stars": 1}
{"review": "Has to be the most unorganised and disgusting pub/restaurant I have ever visited. All the staff are clueless and rude!  I can only think the half decent reviews are locals trying to save a pub that should quite frankly shut down. If there was an...", "stars": 1}
{"review": "We had a load of residual giftcards to use up & as there wasn't a queue @ the bar Alisha patiently scanned them all.\n\nThank you! :-)", "stars": 5}
{"review": "Beaufort is our local and overall a great place for drink, food and service. Definitely recommend it.", "stars": 5}
{"review": "Just had a very disappointing visit. The roast was below average - hard roast potatoes and vegetables and one of our party had soup, that was served with a tiny piece of bread. Asked for more bread but were told that’s all you get with...", "stars": 1}
{"review": "I thought the waitresses and the man behind the bar were incredibly friendly and courteous, the food was delicious, the atmosphere wonderful, and the pub is just over the road from Bristol parkway station, it's the perfect place for drinks or food. I totally recommend...", "stars": 5}
{"review": "It was really busy & we had a 50% off voucher & a gift card to use but Hollie was really patient & polite.", "stars": 5}
{"review": "Popped in for the lunch as we live nearby. Great, friendly service and food was great considering low prices. Will definitely come back soon.", "stars": 5}
{"review": "We were a party of 18 for a birthday.  We pre ordered our food.  The service was not too good, for example we had to ask for steak knives as could not cut without.  We ordered some coffees at the bar, one was accidentally knocked...", "stars": 1}
{"review": "Very much enjoyed our visit, service and food was lovely.\nLoved that it was dog friendly, so that ticked the big box for us. \nWe will be back. \nStaff were lovely and food was served hot,.\nNot much waiting time for food to arrive.\nToilets...", "stars": 5}
{"review": "Myself son and Granddaughter visited the Beaufort arms Stoke Gifford for a Sunday Dinner the food and service was excellent my Granddaughter Imogen who is seven had an adult plate that she thoroughly enjoyed and made a point in saying it was delicious she insisted...", "stars": 5}
{"review": "Visited as a family of 6 for a birthday and from the get go it was just terrible.\n\nSent drink backs three times before asking for a refund and for a glass of water (and was refunded for my partner as well ‘to avoid complaining’)....", "stars": 2}
{"review": "Meals were good but the big let down the app signal is so poor ended up going to the bar to get served, they need to get this sorted out it's  not the first time that this has happened in the present climate", "stars": 5}
{"review": "Having read some of the other reviews I was slightly nervous of visiting this pub near Parkway station.\nAs it turned out the free parking was incredibly easy to log in.\nThe staff were friendly and helpful.\nThe food was good but I can not...", "stars": 4}
{"review": "I was totally shocked when I received a parking charge notice for £85! Yes £ 85!!\nI live in Devon and was meeting a friend who had travelled by train from Cheltenham.\nWe decided to have lunch at the nearest pub, the Beaufort Arms, Stoke...", "stars": 1}
{"review": "Choose this restaurant because it has a great Vegan menu. \n\nTurns out I was not served vegan food; the burger was actually not vegan and it also came with cheese. I ate the meal thinking the staff were trained to know what vegan actually is...", "stars": 1}
{"review": "Turned up at my due time with friend. Then I was refused entry as I wouldn’t use there trace & track ap. I had explained that I’d had trouble using  the ap with government giving me false alerts. I was quite happy to give my...", "stars": 1}
{"review": "Have been going to this pub for years but has really gone down hill recently.\nFood was below par last visit and booked a table for drinks and even though had the booking confirmation was told that I should have booked a minimum of 4...", "stars": 1}
{"review": "Live close by so stopped in on Sunday lunchtime for a drink. Host insisted we use track and trace as it is a legal requirement, we don’t have the app and challenge him regarding it being a legal requirement. He lets us have a table...", "stars": 2}
{"review": "Friday lunchtime visit with prebooked table. First problem was overcoming the compulsory app purchasing which occupied 20 mins. The staff were helpful and the food arrived quickly But ... Lasagne burnt , Scampi burnt, Chicken “curry” was breaded fried chicken dumped on rice and separate...", "stars": 2}
{"review": "Visited on Sunday lunch time. Very well organised. Nice outside seating area with really nice views of the church and the green. The staff are always great here, but I wanted to give Chantelle, our waitress, a mention. She was lovely, attentive and we had...", "stars": 5}
{"review": "A friend booked a table for 4 of us for drinks on Sunday evening.\nWhen we arrived - about 10minutes early (and expected to have to wait) - we asked that although our booking had been for drinks only, would we be able to get...", "stars": 5}
{"review": "Visited on Saturday , very safe, table service , social distancing enforced , well done Jim and his team, Pauline.", "stars": 5}
{"review": "This ember inn chain needs to up its game. It makes a lot of money from local custom but doesn’t invest a penny back into it. It’s very run down. The exterior paintwork is flaking and looks a mess. The toilets are a disgrace. Filthy....", "stars": 2}
{"review": "I booked a table for lunch today with a pre order taken the day before as we knew we were on a tight timescale to get back to work. Our drinks were ready on our arrival and food out as we were seated. This meant...", "stars": 5}
{"review": "Enjoyed a fabulous meal in The Beaufort, chose the 2 course evening meal & brilliant value. \nWould recommend the Katsu curry! \n\nSocially distanced & staff working very hard to ensure safe surroundings & rules adhered to in these strange times.\n\nWould definitely be returning and...", "stars": 5}
{"review": "My friend and I dined here today having not seen each other for two years. She doesn't know Bristol well so I suggested after her train journey we met at this pub. I booked a table for lunch service. From the start the staff were...", "stars": 5}
{"review": "Visited Tuesday with friends the staff were helpfully polite donated to please unfortunately let down by the sirloin steak chewy fatty replace with worse stake need quality control", "stars": 3}
{"review": "Been here a few times the place is very nice.The staff are always friendly but always seem to be to busy to really help you.I think this is because embeinns keep the place short staffed.The food here is not the best here.Seems like most of...", "stars": 3}
{"review": "The food was excellent and has been on many occasions in the past, this is worth the five stars.  \n\nTo get the parking charge waived after its been issued, simply pop back to the Beaufort, speak nicely to the manager and his staff who will...", "stars": 5}
{"review": "I have received a parking penalty notice of £85 after visiting the pub between 20:03 and 20:33 on 15/01/20 for a drink whilst waiting for a train. It was dark and I could not see any signs. None of the bar staff advised me on...", "stars": 1}
{"review": "Enjoyed lunch with an old friend over a couple of pints of good beer.  Fish & chips was OK.  Service was friendly.", "stars": 4}
{"review": "Popped in with my son for brunch just before Christmas. The lady behind the bar was so lovely, she made us feel very welcome. We ordered two sausage sandwiches which came out very quickly. Having read some of the earlier reviews, Parking charges are clearly...", "stars": 5}
{"review": "Sunday lunch while in the Bristol area visiting family was excellent. The staff were friendly and helpful, the food was great and reasonably priced, and this cottage-style pub gets bonus points for having a special vegetarian menu in addition to their non-fat version (which itself...", "stars": 5}
{"review": "If you have a little while to kill before a train then this is a good spot and only a few minutes walk away. The staff behind the bar are fast at serving as well as being friendly. Best of all they remember previous orders...", "stars": 5}
{"review": "I live in this village and the Baufort Arms is now the best that it has been for many years , the service is very good and the menu excellent often being changed.  The Landlord Jim, is doing a fantastic Job of running this village...", "stars": 5}
{"review": "A great place for good pub grub. Travelling as we are it’s great to find a hotel with good atmosphere and good food. Scampi and Vegies for my wife and I had the eye fillet steak with chips, pease mushrooms and fried tomatoes and onion...", "stars": 4}
{"review": "1 star for staff - they are very good.  1 star for ambience.  1 star for the fact you can take in dogs.   Minus 1 star for the fact when arriving for lunch today with friends who work nearby (on an hours lunch break) we...", "stars": 3}
{"review": "Excellent venue, we booked a table at this popular pub. It has a great ambiance and was very busy. The food was ordered at the bar with popular meals catering for everyones needs. \nIt is wheelchair accessible and the food was  served promptly, popping hot...", "stars": 5}
{"review": "Excellent service, great food ,staff very friendly and helpful. All areas very clean and tidy it was busy and even so there was no wait to be served. Place we will definitely visit again.", "stars": 5}
{"review": "Bland food and staff thought they were doing us a favour by serving us, food waste mostly tasteless and cold, the dessert was coved in literally cold custard, and to cap it all 4 of us missed the sign that said pay and display, yes...", "stars": 1}
{"review": "****BEWARE*********\n\nI have also been caught by the lack of signs and incurred a £100 fine for a 30 minute stay\n\nI attended a colleague leaving drink, parked for 30 minutes on 1/8/19 at 5:30pm to say goodbye and wish my colleague good luck.\n\nThere...", "stars": 1}
{"review": "Arrived in the pouring rain and ran inside. Unfortunately didn't notice the signs about validating parking at a console inside and didn't see any console (probably would have dismissed something like that as a gambling machine). Have just been stung with an £85 parking charge...", "stars": 1}
{"review": "I don’t understand why the guy with the Assassin Creed tattoo and the pink ear stretcher is in this type of service. Obviously he dislikes his job and treats customers like so. Awful attitude.", "stars": 1}
{"review": "A dog walk, then off to the Beaufort for brunch on Father’s Day. \nThe family decided they would join myself and my wife. Children and grandchildren all wanting a variation on the breakfast menu. \n15 variations. All brought out quickly and as ordered. \nJim the...", "stars": 5}
{"review": "Called in for an hour with friend for an after work drink.  there less than 1 hour and now have to pay£50 right away or £85 if I dont argue!!!", "stars": 1}
{"review": "I have been going here for years \nAnd this year the flowers and hanging baskets are looking extremely beautiful well done Beaufort arms", "stars": 5}
{"review": "It seems like one rude man behind the bar is on a mission to see the Beaufort crumble. His customer service is abysmal and tars the otherwise somewhat mediocre reputation of the pub.", "stars": 2}
{"review": "We used to come here for a few drinks every week but there has been repeated incidents where the barman serving us has been very rude and attitudey. The other bar staff are all very polite and helpful but one member has ruined it for...", "stars": 1}
{"review": "Went to have my birthday meal yesterday and had a voucher for a free bottle of prosecco. I informed a barman I preferred not to have the bottle with my meal but to get it afterwards. He suggested that I paid for the meal first...", "stars": 3}
{"review": "Excellent simple menu really nice fish done in beer batter, not too crowded on the night we went. But trying to return several times since, its always been just too packed to find a seat which is a shame as we would very much like...", "stars": 4}
{"review": "We go here regularly, the real ale and lager are consistently good as is the atmosphere and he friendly staff. Try a Monday evening for cheap real ale, £2.49 per pint.", "stars": 4}
{"review": "The staff here are friendly and have great banter. Food is nice proper pub grub. Bit further than our local so only visit every so often", "stars": 4}
{"review": "Sunday lunch with family. Food lovely and hot, staff polite and helpful.. Going again soon with friends.", "stars": 4}
{"review": "Went for a family birthday meal, ordered antipasti, steak, sweet fries, gammon and fish, so nicely cooked and tasted so nice, good value for money, will be coming back very soon", "stars": 5}
{"review": "The food was bad bad bad !!! We didn't enjoy it at the time and even less so in the middle of the night . We've been to this pub for food before and enjoyed it (a change of chef?) , most definitely a change...", "stars": 1}
{"review": "Went here for a family get together, wasn't many staff working but we got served quickly and food came out quickly,  all of the food was good, I had 16oz rump steak with chips, veg and pepper sauce, the steak was done as I asked...", "stars": 4}
{"review": "We met at the pub but hadn’t booked a table. We were told it would be a 45 min wait. We had ordered a drink already so decided to stay.  \nNice pub atmosphere with a festive feel. Lots of tables booked for Christmas meals. We...", "stars": 4}
{"review": "Compared to London prices this is very good value pub with decent cooking. Mains are £10-12! After 5 pm two coctails for £7. It is very spacious local pub and we had a corner table. It starts filling up around 6.30 pm. We will return...", "stars": 4}
{"review": "Tuesday night visit to local pub. Plenty of seating in cosy corners. Lots of styles of seating from comfy sofas to high stools with plenty of tables and chairs for dining. Good food choices with reasonable prices. Decaf coffee very nice with added bonus of...", "stars": 4}
{"review": "This Public House has just recently allowed dogs into the bar area, the first pub to do this in Bradley Stoke. Lovely large bar area,  very attentive and friendly staff. My sister and I shared the Camembert cheese as a starter which was delicious, followed...", "stars": 5}
{"review": "I ordered steak which was promoted as coming with mushroom, onion rings and chips. It came with half a mushroom. Not impressed", "stars": 3}
{"review": "This is a nice place to visit on a sunny day as they have some outdoor seating, In doors are a bit dark. Food is acceptable and served quickly. The car park and the place is super busy on Saturday evenings.", "stars": 4}
{"review": "Good variety of drinks and extensive menu however the standard of the food at this establishment is below par. It’s very basic and over priced. I won’t be eating here again and spending money on their food however I enjoy drinking here. See photo for...", "stars": 3}
{"review": "Great visit from start to finish. \n\nLovely couple of hours spent with family having a meal and a natter. Staff were superb as always. Meals were delivered fresh and hot and was checked for satisfaction half way through. \n\nPlates were cleared promptly and we were...", "stars": 5}
{"review": "A small group of us visited The Beaufort for Sunday lunch. We had booked a table as it was for a birthday celebration. Service was extremely slow with no apologies made, we waited an hour in between courses. When the mains came they were somewhat...", "stars": 2}
{"review": "This was our first visit and was chosen as within walking distance of where our grand daughter lives. We were pleasantly surprised, was not crowded and told to choose a table. Waiting time for meal was average and portions average, not too expensive, if in...", "stars": 4}
{"review": "I will get straight to the point the food was cold a and chewy, we all had roast beef and you had to have a chain saw to get through it. We when sent it back and then got snotty looks from the staff.\n\nI...", "stars": 1}
{"review": "A lovely brutish pub, excellent setting, cosy relaxed a fantastic location for meeting g with friends and family of all ages. A very extensive menu, something for everyone. Good selections of beers and wines. Service was very good even on a busy mid:week evening. Highly...", "stars": 4}
{"review": "What a great team you have! Popped in Friday night and it was busy! The bar staff was fab and on point with serving us all especially the tall lad (Jordan, I think) 😁 who was friendly and welcoming with me and my friends. Great...", "stars": 5}
{"review": "Just popped in for lunch, had a great burger and nice fries. The service was swift and the weather good. Good place for a quick lunch.", "stars": 5}
{"review": "Good pub food, great staff, friendly atmosphere and able to alter the menu to sort dietary requirements", "stars": 5}
{"review": "Good food, quick service but what a mess the place was in with finished plates and forks etc on over 50% of the empty tables\nRemember you don't get the second chance at a first impression", "stars": 3}
{"review": "Used to regularly eat here and at the brooks in Bradley Stoke as both Ember inns! Always used to have a decent menu but over the last year  there seems to have been a marked decline in the menu and very noticeable price increase particularly...", "stars": 2}
{"review": "Best pub in the west\n\nThatchers on tap or you're tinpot\n\n#upthevillage\n\n-Thatchers gold index £3.60 a pint", "stars": 5}
{"review": "The is my wife and I's local pub. The staff are always very friendly and the food served is always of good quality and value for money", "stars": 5}
{"review": "I met a friend here for lunch. We only had a hour like most of the lunchtime business. The food was good but by the time it came our drinks were gone and we were having to rush. So if you have time well worth...", "stars": 3}
{"review": "A great pub - lots of locals always there but also room for visitors as next to Parkway Railway Station. Lovely out look over a local village green.  Different places to sit within the venue, always a quiet space to be found :)\n\nLots of...", "stars": 4}
{"review": "Called in with friends.  Saturday evening.  We had booked and glad we did as it was very busy.  Food was good, hot and served quickly.  Waiting staff and bar staff really friendly and helpful.  Few things were off the menu but still lots to choose...", "stars": 4}
{"review": "If you're stuck at the railway station for any period, this is a great place, five minutes away with excellent food, drink, welcome and service.", "stars": 5}
{"review": "On a recent overnighter in Bristol I went to this pub as it was very close to the railway station and motorway . Having tried one of their fine ales I thought I would try something from the food menu as I had watched some...", "stars": 5}
{"review": "I came here for sunday dinner with the family we all had the Sunday beef I must it's was one of the best Sunday dinners we have ever had will definitely be trying it again", "stars": 5}
{"review": "Food was amazing! It was served quiclky and hot! Really friendly, welcoming staff! This place has a great atmosphere. Will be visiting again very soon. X", "stars": 5}
{"review": "Had a wonderful time with guests and bar staff. Was served fast and the food was perfectly seasoned. Bar staff were friendly and the atmosphere was great all around would definitly come again", "stars": 5}
{"review": "I tried the big breakfast for the first time and it was great , it even comes with a free tea or coffee the guy that served me David was fun and had a laugh with me", "stars": 5}
{"review": "I usually know what I want to put in a review & I write it very quickly. This one has been over a week as I couldn't decide what to write because everything was OK.\n\nThe Service was fine, the food was fine, the surroundings...", "stars": 3}
{"review": "Well I shall not be coming back to this pub again. I have been coming there for 2 years and the food as been good. But went there last night and the food was cold. Staff would not believe customer and one was suppose to...", "stars": 1}
{"review": "Had roast dinner  staff were kind and polite beef seasoned perfectly. Gravy was nice and the overall atmoshphere was peacfull", "stars": 5}
{"review": "Went here as it was close to Parkway station. The drinks were fine, it looked like there was a good choice of beers. The food was OK. I had the chicken and bacon salad.Would have been better if the salad had more than a quarter...", "stars": 3}
{"review": "The service was good to start. we were moved from where a big party would be. Service at the bar was sporadic because of the number of people. We had been told of a 25 minute wait but it was nearer 40 minutes.\nThe food...", "stars": 3}
{"review": "As a famous Hollywood actor would say....this place is \"SMOKING!!!!!\"\nTop food, top drinks, top service.....🗿", "stars": 5}
{"review": "This pub doesn't look like much from the outside, but the food is really good. We had fish and chips and pork belly. Excellent value for money. Would come here again. Would be a 5 star review, had the door not constantly been banging -...", "stars": 4}
{"review": "Was served quickly and politely. Steak perfectly seasoned. Friendly atmoshphere eaton mess was delicous and filling", "stars": 5}
{"review": "Great food - especially breakfast, great staff and a very warm welcome!!! Manager and his team go out of their way for visitors.", "stars": 5}
{"review": "My friend and I missed our train from parkway station so asked someone where we could get a cheeky wine.  Well what a welcome Jim the manager talked to us about our preference on wine and we chose a lovely bottle of sauvignon blanc.  We...", "stars": 5}
{"review": "I have been meeting friends here for a drink for the past couple of years and have too say it's the best it's been for a long time good beer and great staff", "stars": 5}
{"review": "Me and a mate went here for a cheeky friday beer or 6. Great selection of real ales that keeps us coming back, we're not interested in drinking the same old stuff and they keep bringing in excellent beers all the time. Nice local pub...", "stars": 4}
{"review": "Recently enjoyed a great meal here. The food was cooked to perfection and such good value for money. The staff were really friendly. There was a lovely atmosphere. There were lots of locals enjoying a drink after work. Really glad we chose to eat here...", "stars": 5}
{"review": "I no longer live in the Stoke Gifford area of Bristol. And only visit occasionally. I must say it was difficult to choose an ale due to the abundance of choice. But I chose the draft Bass, it was clear and had a superb taste....", "stars": 4}
{"review": "Work meal\nPretty poor overall mine\nCold most of it and overcooked gammon\nVery over priced for the quality of the food.\nEmber inns i think.\nNot great and wouldn't return.\nShame.", "stars": 2}
{"review": "Stopped here regularly weekdays just for a couple of there great selection of beers and sometimes the food.\nThe beer has always been spot-on but the food does vary between okay and not okay. It is pub grub I suppose and you get what you...", "stars": 4}
{"review": "Went here with family eight of us before going to see a show. Put on a nice table set for eight. Service was quick as we were limited for time the staff were amazing. The food came out quick and hot everybody was happy with...", "stars": 5}
{"review": "As our local we visit a few times a month for dinner and/or drinks. Food is reasonably priced with the menus updated regularly and fussy eaters catered for! Service is usually quick but we are warned if longer than 30 minute wait, staff have even...", "stars": 5}
{"review": "Maddie was great and made sure my son had a great time thank you will be doi g it again  so of us were good with the food", "stars": 4}
{"review": "Very nice food,lovely manageress.Been there few times but definetely will go back again! \nGood value!Highly recommended!", "stars": 4}
{"review": "16/11/2016 @ 7pm\n\nOkay, we have been here before, but this one was very special for my Step Mum at a very young 89 😃\n\nSo booked as normal and the whole evening just went fab. Staff truly lovely, thank you so much ❤️\n\nIf...", "stars": 5}
{"review": "My husband and I visited the Beaufort for a late dinner the service was fast the meals we had were lovely presentation was good worth a visit .value for money friendly pub", "stars": 5}
{"review": "Went for a meal here last night, not been here for at least 15+ years when it was part of another chain, as soon as we pulled in the the car park the amazing aroma of the food hit us. Inside was like a traditional...", "stars": 5}
{"review": "Ate here last night, my wife and I had the 2 course menu with steak and chips, my daughter had the shields steak and chips. for the adult meals, the steaks were cooked rare and reasonable quality (good value) with a nice portion of hot...", "stars": 4}
{"review": "Me and my wife come hear for lunch once a month for lunch in the week. Super food. Lovely staff and a great selection of ales. Try the Timothy on draft..", "stars": 5}
{"review": "We called in this pub for a Sunday lunch and had the beef and turkey . The food arrived on cold plates and the presentation was poor the veg were under cooked there was no stuffing on the turkey dinner and could not have cranberry...", "stars": 2}
{"review": "This is my local and I eat here about once a month with my partner or friends. The food has much improved over the past few months, I suspect this is due to a change of management. On this visit my partner and I both...", "stars": 4}
{"review": "Great pub with good choice of drinks. Go here before Exeter City hone games as close to the stadium  we find it very relaxing  to sit play pool and talk before game. Prices are very reasonable  as well. Will definitely recommend  to fans to go...", "stars": 5}
{"review": "This place is wonderful. Full of character, and very easygoing. Charming staff, pool, table games. Great selection of drinks. A proper pub!", "stars": 5}
{"review": "Used to be such a good pub but what has happened? It's £5 for a small glass of wine, there's never anything in stock, food has got smaller and worse. I echo other reviews on this. Avoid. Will never be frequenting this place again.", "stars": 1}
{"review": "This pub used to be good.  It had good burgers and a great atmosphere.  Since then, food quality has only gone down with the introduction of the '2-4-1' deals they have on Tuesdays and Wednesdays.  Waited nearly an hour for our food, buns stale, burgers...", "stars": 1}
{"review": "Nice atmosphere, the barmen/women are very nice. A little expensive (for a student-y place), but I'm from surrey so it was cheap for me", "stars": 5}
{"review": "Horrible. Really Horrible. \n\nWe were a big group that had preordered weeks ago (about 40 people). Had to wait over 2 hours for food and when it came it was less than impressive, however several people did not even get the food they ordered because...", "stars": 1}
{"review": "I went into this pub with a group of 5 friends, we went up to order burgers (the only items on the menu) and after the 3rd person had paid we were told they only had 3 burgers left... We were clearly all ordering food...", "stars": 1}
{"review": "Excellent atmosphere, friendly staff!\nPerfect for a quiet drink in the afternoon!\nThe interior has a fantastic design, very calming and the choice of music is superb! \nWill certainly be visiting again!", "stars": 5}
{"review": "Ordered two burgers on a Monday, both burgers were included in two for one deal. Was told we couldn't have two for one on the burgers because the two burgers had to be the same, even though this was absolutely not mentioned on the menu....", "stars": 2}
{"review": "I've had great pub grub here many times and the beer is excellent. It's in a Student area of Exeter so it's always lively with a friendly vibe during term times.", "stars": 5}
{"review": "I have frequented 'The Vic' with friends whilst being at university, but in the last few months it has gone downhill significantly. My recent visit fell on the night of the pub quiz (Tuesday), which always fills out the whole pub. However, it appeared that...", "stars": 2}
{"review": "Visited here morning of 1st March, lovely cafe & not too big, welcomed by a lovely guy who explained how everything works. The food was top notch & maybe the reason is because it’s not a massive place, holds maybe 30 people? Loved that there...", "stars": 5}
{"review": "Amazing breakfast spot, member of staff always there to help, waffles are dank. 100% recommend pulling up to this place.", "stars": 5}
{"review": "We absolutely loved our experience here! Amazing value for money for all you can eat food! The food was tasty and the staff (we were served by a gentleman called Tom) was absolutely lovely, friendly and helpful. The atmosphere was great and the restaurant was...", "stars": 4}
{"review": "Lovely good all you can eat breakfast.  Good fresh produce and plenty to choose from.  Fresh cooked pancakes were to beautiful and so much choice of topping.  Plenty of choice of juice and tea and coffee. \nMy only criticism would be that I’m not keen...", "stars": 3}
{"review": "awesome , fresh , cooked properly you can choose exactly what you want ( i don’t like hash browns or beans on a breakfast ) quality bacon sausage eggs , black pud , everything , each table has its own toaster , no queuing at...", "stars": 5}
{"review": "We have been here around 4/5 times now. And we are super surprised how yummy the food is- everything is cooked perfect and for everything you can eat it’s really worth the price. Today we had the best customer service to date - a lovely...", "stars": 5}
{"review": "So, we went Christmas Shopping in Exeter and came here for breakfast.  We had the bottomless breakfast,  eat as much as you want, coffee, tea, juices as much as you want.  Sweet tooth? Waffles that they will cook for you and then you can add...", "stars": 5}
{"review": "Highly recommend,lovely Tom went above and beyond to find us a table for are large family he even helped us up the stairs with a large pram,lovely food,set us up for the day.", "stars": 5}
{"review": "Very nice atmosphere, many options for breakfast. The guy who works there and helps you out is a very kind and helpful person. Honestly, I come here all the time and would highly recommend it!", "stars": 5}
{"review": "OMG. What a find on a day out to Exeter.   Welcome was the best I've had.  Very friendly staff and extremely clean environment.  All food is cooked fresh as they work.  Lovely selection of got food.  Pancakes were delicious with maple syrup and I had...", "stars": 5}
{"review": "Came here for a bit of brunch and did not disappoint. Very good value for money with the free drink refills and waffles at no extra charge. \n\nMy first time trying a waffle and it was amazing, along with the cooked breakfast. \n\nAlso a big...", "stars": 5}
{"review": "Great visit here, greeted by a really enthusiastic and friendly guy who couldn't do enough for anyone. \nAll the staff were really friendly and diligent. Tables clean and tidy and lots of choice for food items. I mean it's a breakfast buffet at the end...", "stars": 4}
{"review": "Really rude staff who act as if you’re an inconvenience if you try and interrupt their conversation.", "stars": 1}
{"review": "Came here with my parents for a delicious Bank Holiday treat after hearing such rave reviews from them. To say I was not disappointed was an understatement. The food was fresh, tasty and hot, whilst also being constant and never having to wait for more...", "stars": 5}
{"review": "Have been to Brody’s twice now and both times have been wonderful! The cooked breakfast is lovely and the waffles are excellent! The amount of toppings and sauces are really good, I think the price is really good considering it’s unlimited food and drinks! Have...", "stars": 5}
{"review": "Really nice concept but unfortunately as buffets can be, the food wasn’t the hottest or freshest\n\nThere wasn’t the biggest selection of breakfast items but definitely a good selection and the DIY waffles were great. Better coffee would improve it\n\nI imagine when it is...", "stars": 3}
{"review": "It's a shame about the price hike, hadn't been for a while but were allooking forward to it...... Bit cannot justify £13.95 x 4 just for one meal, went tesco and spent £9 and cooked a fry up for 4 people. We used to go...", "stars": 2}
{"review": "Although there is an abundance of fresh items try finding a seat...! Best time to go is once all the students have retired home otherwise you may have a long wait.", "stars": 4}
{"review": "Greeted by a charming young lady. Impressive choices for everyone at breakfast. I am a fan of breakfast food all day; this place was just marvelous. Free refills, help yourself. Very artfully set out with nice design features and quirky food service options. Cant recommend...", "stars": 5}
{"review": "Went to Brodys the morning after a concert and it was a really nice relaxed and friendly atmosphere. The food was really tasty and you could help yourself to as much as you wanted for a very fair price. There was so much choice too....", "stars": 5}
{"review": "Excellent day trip to the Exeter branch. Great variety of food and drinks available for us. Would recommend for any hungry people.", "stars": 4}
{"review": "Good food and the chef behind the counter was agressive, which I loved! I threw a sausage at him and he reacted so quickly he chopped the sausage in half with his global knife before it got near his face", "stars": 5}
{"review": "Not the best..\nThe cook behind the cooked food is really aggressive!\nI saw him 3 times\nShout at customers for trying to use the waffle machine. But there was no staff to help.. and he shouted at me Because I used the chipolate tongs...", "stars": 1}
{"review": "Amazing breakfast probably one of the best breakfasts I’ve ever had, well worth the money :) I would be returning sooner if I only lived closer.  but the next time we are up this way we will return", "stars": 5}
{"review": "Brodys is the perfect place for breakfast in Exeter\nGreeted by helpful friendly staff and shown to our table. \nWide range of breakfast food, fresh bread and your own toaster on the table. \nFood was cooked perfectly and nice and hot.  \nGreat value for money...", "stars": 5}
{"review": "Popped in while having a tyre fitted and wasn’t disappointed! Cooked breakfast was cooked to perfection and you could also have waffles with a choice of toppings. Plenty of choice for drinks too. Nice touch of having a toaster on each table so you could...", "stars": 5}
{"review": "I have been meaning to go into Brody’s for a while so today was the day. I was seated after a very short wait, I thought the price of £11.95 was very reasonable to have all you can eat cooked breakfast, waffles and drinks- both...", "stars": 5}
{"review": "Definitely a place for students. Plenty of food on offer. Service yourself and they do you waffles. Have as much as you like for just over £11 each. Toaster on the table , fresh bread. The place is basic seating clean but not comfortable. Trendy...", "stars": 4}
{"review": "Very nice food but it’s packed in, so many people climbing over one another, it’s covid heaven, unfortunately I did get covid. Surly it would be better having a one way system instead of the free for all?", "stars": 5}
{"review": "Went to try their breakfast and I cannot complain about anything! The food is amazing, shop is clean and staff are friendly, what more can you ask for 😁.\nWould definitely try every time in town!", "stars": 5}
{"review": "Best breakfast in Exeter!. If you ever stop by the city you need to get yourself to Brody's. Go when you're hungry, you won't be disappointed!!", "stars": 5}
{"review": "The food was really good with a really nice atmosphere. Will be coming back here for food. All the food was fresh too.", "stars": 5}
{"review": "Nice atmosphere, great food and very friendly staff…. Definitely will come again very soon!! 😊😊😊😊", "stars": 5}
{"review": "Loved the breakfast here, a real warm atmosphere and the staff couldn't be more friendly. We will definitely be back at Brody's soon!", "stars": 5}
{"review": "Exactly what we needed and was looking for at the time. Wife and I were so hungry! Food was great, service was great, and waffles were amazing.", "stars": 5}
{"review": "Entered brodys with freinds for their unlimited pancakes\npayed, then was told pancakes arkt available and haven't been for moths because the owner dosent want to buy the skillets, (the had a converebelt machine for this  in the past) despite still advertising this 🙄.\n\nWe...", "stars": 1}
{"review": "What an amazing place! All the food was hot, fresh and tasty, loved being able to toast the bread at your table, stops the cold toast with a fry up! \n\nWaffles are to die for, yummy! Cannot wait to visit again!", "stars": 5}
{"review": "Visited with two children today. Food was great, and the kids loved the waffles. Was disappointed that, on this visit, my 11 year old was charged at adult rate, yet he had the same as his 9 year old friend, who was charged at half...", "stars": 4}
{"review": "We have seen this place a few times and always said we wanted to try it but never got the chance until now. \nWe got in at 8:30am on a Saturday morning and given a table right away. \nThe staff were brilliant and so friendly,...", "stars": 5}
{"review": "Another excellent bottomless full English breakfast whilst staying over in Exeter. All good and great crew. Always 5 star but 4 I'm afraid as they have withdrawn the no drinks option. 🇬🇧🇳🇿🇺🇦", "stars": 4}
{"review": "A lovely, friendly place with great food.  My family and I went here for breakfast and as “an all you can eat” I was skeptical as always worry about people touching and then putting back or food sitting for ages and being dried out.   This...", "stars": 5}
{"review": "Great service from Tom and the team today. All running well, I think that's more to do with the workers than management. Despite being under staffed, they ran everything brilliantly. Food was spot on and everything kept clean. I hope the staff are rewarded for...", "stars": 5}
{"review": "There are few times I am really happy about breakfast but this place makes me happy.\n\nFrom bacon hash browns and sausages to a full selection of waffles.\n\nYou pay a fixed amount and take your selection. All is great to eat.", "stars": 5}
{"review": "Verily 5 star. Return visit following our previous on 23 December last. Sate your appetite here from the buffet counter for a traditional range of English breakfast options. All absolutely delicious with the fried bread pleasantly chewy. Charming and engaging front man. In common with...", "stars": 5}
{"review": "Decided to get the train somewhere with my two kids, 9 and 4 years at the time. No booking option but had space for us on arrival at 10am on a rainy Sunday. \nTeam were very welcoming and happy to help. Everything was explained to...", "stars": 5}
{"review": "Love love love Brody’s, it is the only reason I visit Exeter. \nGreat food and great service. Visited today, 3/2/22 and the man serving was great. He was pleasant and friendly. \nFood selection is brilliant, all items from a full english to choose from as...", "stars": 5}
{"review": "My husband and I visited Brody's on Sunday morning for breakfast and it was amazing! All you could eat, pipping hot, lots of variety, good butter and jam options (I am a conserve snob!!) I expected it to be full of students but there was...", "stars": 5}
{"review": "Great place for Breakfast. Fixed price all you can eat Breakfast with waffle puddings! What’s not to like? The food was fresh and hot and staff very friendly, definitely worth a visit.", "stars": 5}
{"review": "Wow. Just wow. This place is amazing and the value for money is mind-blowing!! My boyfriend and I couldn’t believe the value for money at this place - the food was hot, fresh and delicious and the staff were so lovely and were happy to...", "stars": 5}
{"review": "Amazing food. Our server, Tom, was really friendly and helpful with everything. Such good value for money as well, we will definitely be back!!", "stars": 5}
{"review": "Amazing service, amazing food, amazing value. What more can I say?! Honestly! I need to reach the word count!", "stars": 5}
{"review": "Been here a few times now and every time the service, food and staff are brilliant. You will not be disappointed visiting here. My wife, myself and our 3 kids enjoyed the locally sourced food and the kids loved the waffles.", "stars": 5}
{"review": "As soon as me and my partner saw this place & saw the menu..we just had to go here the next morning for some breakfast. Then we saw the price & that you get all you can eat & drink..this was a no brainer for...", "stars": 5}
{"review": "Excellent restaurant! Very nice place to have an authentic english breakfast. The staff is really kind and warming. I would absolutely recomment this place !!", "stars": 5}
{"review": "Tasty food, nice atmosphere, friendly helpful staff, would like more vegan options, some vegan sausages and milkshakes would be especially welcome", "stars": 4}
{"review": "Amazing place to eat and drink……. Recovering from the night before or not!!\nThe workers are Great! Tom the legend bringing the good energy and always working hard with a smile on his face, it’s like a movie!! But seriously give Tom a holiday, that...", "stars": 5}
{"review": "The staff are friendly, helpful and make you feel welcome. The food is okay and it does it’s job. The value is alright, but when you consider most people who go in there apart from a few, eat maybe a breakfast that is smaller than...", "stars": 3}
{"review": "Offers the convenience of a buffet without the normal drawbacks as a result of their very good hygiene policies as one must sanitise their hands before each station. The quality of the bacon, sausage and eggs are great, and the waffles are to die for....", "stars": 5}
{"review": "Family trip to Devon. Came across this restaurant  opposite the Royal Albert memorial museum RAMM. Well located. Clean. Good covid secure set up. Food was perfect. Full choice with nothing missing. Too much food to actually try everything. Had full cooked local sourced meat. Pancakes,...", "stars": 5}
{"review": "Ive been going to brody's for years since i was 8, back when it used to have cereals and the eggs, bacon and sausages on the ceilings for lights and its safe to say they are going downhill. they’ve got rid of the cereals and...", "stars": 3}
{"review": "Amazing breakfast and warmest welcome in Exeter! I’ve never had waffles so good and the kids were in heaven with the array of toppings including ice cream. The bottomless breakfast inc drinks was the cherry on the top. The ingredients are sourced locally and sausages...", "stars": 5}
{"review": "Great service, the guy on front of house was really helpful and friendly. They had sanitiser everywhere and screens to keep you separated from other guests. Individual toasters on each table is a great touch.\nWe've been meaning to go for a while now and...", "stars": 5}
{"review": "What's not to love? Full English breakfast - as much as you can eat, plus freshly made pancakes and waffles with ice-cream, sauces and toppings. Throw in unlimited tea, coffee, juices and soft drinks, plus toast and jams - all for £9.95 a head. It's...", "stars": 5}
{"review": "Firstly we visited here not longer after restrictions were lifted so I am putting the low stock levels of certain items down to that, otherwise a 5 star review would have been forthcoming.\n\nWe got there 8.30ish on saturday morning and didn't have to queue,...", "stars": 4}
{"review": "We have seen this place a few times and always said we would try it but never got the chance until now. We waited a bit as it was busy but it was well worth it! The staff were super friendly and ready to help...", "stars": 5}
{"review": "Just been to Brodys for breakfast. Excellent food and service. Staff couldn’t have been any more welcoming and friendly. Definitely will be back", "stars": 5}
{"review": "We decided to take a chance on buying breakfast out rather than having it in our hotel and I'm so glad we did, especially after finding this little gem! Unfortunately I wasn't sufficiently hungry enough to really take full advantage of the wide range of...", "stars": 5}
{"review": "Was really pleasantly surprised at the quality of the food, every element was high quality; sausage, coffee, bread, chocolate sauce, the lot! Partner has allergies and the server was excellent with her. Great service, young lad, maybe Australian, couldn't do more. Bit if a wait...", "stars": 5}
{"review": "Food was lovely, great full fry uo and delicious waffles cooked fresh with ice cream and a range of sauces and toppings. Made to feel welcome by the server and nothing was too much. Great value!", "stars": 5}
{"review": "My  husband and I visited with our son. We had the all you can eat and drink menu for £10 each. I have to say I didn'eat £10 worth but I  think my son and husband did. The sausages and bacon were probably the best...", "stars": 4}
{"review": "Received a very warm welcome and helpful explanation of the self service system. Food was excellent and all felt Covid secure. Great atmosphere and a totally enjoyable experience. Many thanks to George and Shaun!", "stars": 5}
{"review": "Covid measures were very good. All you could want from a all you can eat breakfast place. Only small complaint, no decaf teas/coffees. Australian waiter was super friendly and helpful.", "stars": 5}
{"review": "Food was amazing. Super reasonable! Only £10 per person for all you can eat? Small wait for tables as there’s no bookings but totally worth the wait. Very impressed", "stars": 5}
{"review": "What a brilliant setup and superb organisation and customer service from the main guy (Brody?) wonderful cooked breakfast followed by fresh waffles made just for us and love the toaster on the table and excellent quality bread for real hot buttered toast to finish. Can...", "stars": 5}
{"review": "Firstly we did have to queue to get in due to covid requirements but we were informed by a friendly staff member that we wouldn't be waiting long and the reason regarding the wait. On entering the system was explained fully to us on when...", "stars": 4}
{"review": "What a great place to eat breakfast. \nReally enjoyed it - best breakfast I have ever eaten. \nYou must try it.", "stars": 5}
{"review": "Absolutely love this place. The food is always amazing(thanks to Phil and his fellow chefs!). Im always made to feel super welcome by the front of house staff(especially Tom, who is a true gentleman!) \n\nWould rate it even higher if the option was given!", "stars": 5}
{"review": "Fantastic food at a fantastic price with fantastic service. Couldn’t have done more to make us feel comfortable and didn’t rush us out despite there being people waiting. Great choice of food and would definitely go back.", "stars": 5}
{"review": "We were recommended to go to Brody’s by a friend. \nReally friendly and helpful members of staff, Sean and George. We enjoyed the cooked breakfast (perfectly cooked eggs) and the waffles. \nFelt safe: hand sanitiser stations, tables wiped down etc.\nWe’ll go again when we’re...", "stars": 5}
{"review": "We went to Brodys today and the staff were brilliant! Very attentive and Covid secure. We will definitely be going back!", "stars": 5}
{"review": "My best friend told me about the great and friendly customer service from a New Zealand Gentleman. Today I met him, his name is Tom and it's true. He gives the best Customer Service and he's very polite, made me and my mum feel very...", "stars": 5}
{"review": "I was going to email the owner, Tom, rather than posting a review publicly, about feedback from my visit, but on my way out he started being extremely rude. All I had said was that I wasn’t very happy with the service I’d received, and...", "stars": 1}
{"review": "We expected a few more covid-19 related precautions, hand washing, masks etc but this did nothing to make our visit any less pleasant. We had to wait 10 minutes to get a table but i don't mind this at all. Once in, we paid for...", "stars": 5}
{"review": "From the outset, it was clear that this was a business that was so bought into the crazy Covid measures that it wasn’t going to be a relaxing experience.\n\nThe food was excellent and it is good value for money. However, as an adult was...", "stars": 3}
{"review": "Brilliant service and good food. Host/waiter couldnt do enough to keep the the experience as safe and \"normal\" as possible.", "stars": 5}
{"review": "We visited here early one Saturday morning - Tom could not have been more helpful or put us more at ease.  Service was fantastic and the covid-19 restrictions and the complications that they cause are being handled magnificently - really well done guys.  While eating...", "stars": 5}
{"review": "We visited as a family with our Exeter Uni student d’daughter (a regular there already!). A lovely warm welcome, clear and professional advice and instruction (covid protocol) from the manager who welcomed us in on arrival and explained how everything worked. He was a very...", "stars": 5}
{"review": "Friendly staff, amazing food with lots of cool quirks, and a great Covid setup. Can’t wait to go back!", "stars": 5}
{"review": "Stopped in during a visit to show our daughter the area for prospective uni next year. Qued for 20 minutes well worth it.  Brody's had well thought out system for our covid visit . Gents who run it are super friendly and eager to make...", "stars": 5}
{"review": "I’m going to keep this simple, as it is a simple kind of place. It’s a breakfast bar which serves your English style breakfast in a buffet format (you do get your own toaster at your table). This place won’t win a Michelin star but...", "stars": 5}
{"review": "Went here for breakfast, the staff were excellent, so friendly and helpful, best service I have had in a long time. \nFood was of reasonable quality, all you can eat buffet. Normal selection of hot items, toaster on your table, so no waiting for others...", "stars": 5}
{"review": "This place was recommended to us.  Good range of tasty breakfast buffet service.\nVery organised and efficient with helpful friendly staff.", "stars": 5}
{"review": "First time in Exeter, was looking for somewhere I could relax for a few hours and just get my head down with my laptop. \n\nSaw the sign - All you can eat breakfast with unlimited drinks for less than £10\n\nTom was working and couldn't...", "stars": 5}
{"review": "My partner and I travelled from Bristol and decided to eat her for a little breakfast. My god did we choose wisely! By far the nicest breakfast I have eaten, with a great selection and high quality too! Want to say a huge thank you...", "stars": 5}
{"review": "The way to a gardeners heart (kingdomplants.com). I am set up for the day. The breakfast of kings! Come and support them in these wierd covid times..... I cant tell you how much I love brodies.... it is a physical joy fest a seriously spiritual...", "stars": 5}
{"review": "Food = Brilliant consistency and quality every time. A proper traditional English breakfast, sausages and bacon especially good which often lets other places down. In a world where good customer service is rare to find, Tom the manager is outstanding - bends over backwards to...", "stars": 5}
{"review": "Come all the from Falmouth (down south) really nice food great ideal and amazing staff and great price", "stars": 5}
{"review": "Full English then waffles and ice cream, all before 10am 😋\nSean was a great host and enhanced our experience. Can’t wait to go back.", "stars": 5}
{"review": "Amazing service and amazing food , staff was very helpful and attentive. Would highly recommend. Waffles , bacon , eggs , coffee and more.", "stars": 5}
{"review": "We love coming here. The decor is fantastically rustic and relaxing, the concept is fab and the service is always amazing.\n\nWe turned up on our latest visit just after the crazy student rush and the staff were visibly trying to do dozens of things...", "stars": 5}
{"review": "Visited here with friends for breakfast, the staff were very polite and did everything they could to deliver an excellent breakfast, very good choice with lots of added extras in as well. My only complaint would be the seating, it is very uncomfortable and crowded...", "stars": 4}
{"review": "Brody’s is the reason we go to Exeter. My sister, brother in law, husband and myself went to Brody’s twice whilst visiting Exeter. The gentlemen who worked there were really patience, helpful and friendly throughout both visits. The food is always cooked hot and you...", "stars": 5}
{"review": "So we spent a weekend in Exeter meeting up with friends, Brodys was the destination for our sunday morning hangover cure!\nFrom the minute we waited outside to the minute we left...Amazing!\nSuch a qwerky concept which obviously works for these guys, and the covidn...", "stars": 5}
{"review": "A great concept, fabulous staff (Tom and Shaun were super helpful and friendly), really high quality breakfast ingredients, delicious selection of bread, such good value for money and all topped off with a Mr Whippy on a freshly made waffle!! Loved all of it 😋😊👍", "stars": 5}
{"review": "We searched for 'breakfast' near me, whilst on a short stay in Exeter, up popped Brody's which wasn't a million miles from where we were staying. It was a Saturday, but we were up early'ish and got there around 9.30 and walked straight in. It...", "stars": 5}
{"review": "I stuffed my face with 4 full English breakfasts and 2 waffles topped with icecream. I am a fat beggar so this place fills a spot. Bacon was a bit too salty and overcooked but what do you expect for an all you can eat...", "stars": 3}
{"review": "Great service , great food. \n\nEspecially enjoyed the waffle and maple syrup with ice cream ! \nLooking forward to returning .", "stars": 5}
{"review": "This place was a godsend at 8am on a Sunday morning. The quality of the bacon, sausage and black pudding was fabulous. All you can eat for a tenner and choice of breakfast was awesome. Thank you guys for an amazing breakfast experience. Will be...", "stars": 5}
{"review": "Very welcoming and staff was very helpful and accomodating especially a man called Tom could see I had a baby with me  and helped alot should be more people like him in world !", "stars": 5}
{"review": "Breakfast this morning , great food and Tom running the service today was brilliant\nWorking under difficult conditions with Covid he made everything easy for the customers\nGreat Job Tom!", "stars": 5}
{"review": "Great choice of good quality food available made even better with eat all you can. Allowing you to make your own waffles and pancakes is a really nice touch. Great value for mo way and thoroughly recommend!", "stars": 5}
{"review": "Amazing quality and selection of food... so soooo clean and staff very informative, all of the staff were on the ball must be a hard job in the current climate ! \n\nThe selection of food was amazing... my son ate for free as he was...", "stars": 5}
{"review": "What can I say? This place will set you up for the day and plenty of options and refillable drinks. Reasonable quality at a great price. Go hungry, you won't want to eat for the rest of the day", "stars": 4}
{"review": "Best place for breakfast in Exeter, atmosphere and the unlimited breakfast grill is awesome, customer service 5 starts", "stars": 5}
{"review": "This place is amazing! They have good COVID-19 hygiene procedures. We were greeted by a really friendly member of staff who showed us where everything was and how it works! The children loved the waffle making stations, my advise would he to get there early...", "stars": 5}
{"review": "Absolutely love this place. Decent breakfast + all you can eat and drink. Covid restrictions are a bit of a pain but Brody's deals with this as well as it can. We're local and have eaten here a few times, always good.", "stars": 5}
{"review": "Visiting friends in Devon we went to Exeter to do some shopping.  Saw Brody's and thought it looked interesting.  Well we were not prepared to have such a great choice of fantastic food, excellent customer service and being made so welcome.  Cant wait to come...", "stars": 5}
{"review": "Visited today with my family and there was no air con! I enquired about it but no one had an expectation, the waiter just shrugged his shoulders at me and walked off! Very poor service! COVID measures aren’t great- the table was still mucky from...", "stars": 1}
{"review": "We visited this breakfast bar on the weekend of 08/08/20, it is an all day breakfast bar with everything you can imagine and more. You can even make your own waffles with lots of sweet toppings which is great for the kids. The breakfast itself...", "stars": 5}
{"review": "Lovely breakfast this morning at Brodys, even better we could use the 50% off 'eat out to help out' scheme so was only £20 for all 5 of us! The food was lovely, nice and hot and so much choice, even cooked some vegetarian sausages...", "stars": 5}
{"review": "This is the place to go if you want a great breakfast, everything cooked to perfection.\n\nPlus there are Waffles and ice cream available too.", "stars": 5}
{"review": "Had to queue for a while but that’s not an issue. Once we got in it was like a scrum at the hot food counter absolutely no social distancing between customers or staff. Tables were sticky and still dirty from the previous customers. I raised...", "stars": 2}
{"review": "We had breakfast here to set us up for a day of sight-seeing.  COVID precautions were in place and strictly adhered to.  All items were freely available and replenished regularly.  The waffle was a great addition (although I would have liked some maple syrup, which...", "stars": 5}
{"review": "Great customer service and food shawn was a stand put member extremely helpfull deserves a raise 🙌👍👍", "stars": 5}
{"review": "Went there for breakfast on my birthday. Very good food and i love how you can make your own waffles and pancakes. Staff very helpful. Would go again!", "stars": 5}
{"review": "We decided to go here on a Sunday morning for an all you can eat breakfast experience.\n       Firstly the staff were extremely friendly and helpful.\n    Quite willing to have a chat and explain how things work and talk you through how it worked.\n\nGood value...", "stars": 4}
{"review": "Really good! The food is delicious, cooked great not greasy at all. Great selection! Really good organisation with the whole covid thing going on. The main thing that would make us go back was the 2 lads that served us! Visited sunday 19th july. They...", "stars": 5}
{"review": "We have been going here almost religiously for a couple of years now and it just gets better and better. Tom is constantly innovative to make the dining experience easier and more enjoyable. \n\nThe food is so good and the staff is very friendly and...", "stars": 5}
{"review": "Reasonable self service food though egg options seemed limited on this visit. Includes pancakes and ice-cream.", "stars": 3}
{"review": "When we go to Exeter this is our go to place for breakfast. They use fantastic produce to create one of the best breakfast experiences. Staff are always attentive and happy. Great place love it here !", "stars": 5}
{"review": "My partner and I have been here two weekends in a row. It is amazing value and there is a ton of variety. Help yourself full English and make your own waffles and pancakes. I was pretty daunted by the waffle iron, but a really...", "stars": 5}
{"review": "Me and my partner went for breakfast here and the costumer service was absolutely outstanding. We were served by a gentleman called Tom and he really did go the extra mile for us. He showed us how to use the waffle and pancake machine as...", "stars": 5}
{"review": "Popped in here on Saturday afternoon. The bar was understaffed, but fortunately there wasn't a queue, so I didn't have to wait long to be served. \nDecided we would make use of the dry weather and find a table in the garden, of which there...", "stars": 3}
{"review": "Cool evening front door closed patio doors open. Downstairs feels like the airco is on. Fortunately I'm sitting in the 'Heavens' so not too chilly but with autumn around the corner someone needs to tell Tim about how his profit is being squanderd by very...", "stars": 4}
{"review": "Only went in following visit to the Cathedral, Got to say for a 'Spoons' this was super. The layout was great, the staff were superb and the service was very quick. We ordered a pizza to share and this actually really tasty. let's face it...", "stars": 5}
{"review": "Recommended and featured in the Good Pub Guide and Good Beer Guide. As is often the case with Wetherspoon pubs this is set in a beautiful historic building. Attractive gardens to one side. Known for amazing value for both food and drinks. Children welcome but...", "stars": 4}
{"review": "I went with my sister, brother-in-law, his family and my niece.  We went in separate cars and my sister was able to leave her car across the road.  It offered free parking for the rest of the day from just after 4pm onwards.  When we...", "stars": 3}
{"review": "We popped in here early on a Sunday Evening for a bite to eat and a few drinks. \n\nThere was plenty of room to have a choice of table but busy enough to give a good atmosphere. We chose on of the high tables on...", "stars": 3}
{"review": "A beautiful place with good food, good prices, good people and last but not least: a good bathroom.\nThere's a lot of space, so you can come in large groups. We were 20 people and went there twice for breakfast and once for dinner, and...", "stars": 4}
{"review": "I have called in here a couple of times recently for breakfast - the gluten free 'freedom breakfast' was well presented and excellent value for money. I later returned for some real cider from the box which was nice, the service was friendly each time....", "stars": 5}
{"review": "Came here for breakfast on for 2 mornings, very good service and good cheap food as always, will be returning", "stars": 5}
{"review": "Dropped in for a quick lunch - love the app and ordered easily. Great value, pizza lovely. drinks their usual quality and value, but fried halloumi was not that appetising. That said, it's excellent value, and it's a fabulous building - they should get credit...", "stars": 4}
{"review": "Busy but service was still very good.\nUsual Wetherspoon good value food  menu to choose from.Relaxing  venue at this time of day also.", "stars": 4}
{"review": "We have been Travelling in Britain for 10 day on a medium budget and have experienced a lot of places to eat . We  have found most of them overpriced. \nStumbled on George’s meeting house and we were greatly suprised   . An 18th century chapel...", "stars": 5}
{"review": "Very poor customer service both from the staff at the pub and from the online APP staff members. My wife and I shared some chips with our meal and complained about the fishy flavour! Not what you expect or want with a chicken wrap. Basically...", "stars": 2}
{"review": "A weeks in Exeter and came here for Breakfast on most days; but wish they'd return to serving until 12.00 like before.  The building is a legend and the Wetherspooning hasn't spoilt it one bit. The staff were all friendly and efficient, with management in...", "stars": 4}
{"review": "We called in for food and drink on a very busy Saturday lunchtime. With both football and rugby clubs with home fixtures there were many supporters of both teams present. However, the pub seemed to have the right number of staff working and ordering at...", "stars": 4}
{"review": "Having heard that a lovely church building had been made into a restaurant, I was interested in going to it.  From the moment we walked in, we were impressed.  The building is fascinating, having many of the original features preserved (stained glass, ornate pulpit, etc)....", "stars": 4}
{"review": "Where is the carpet? Its through in the back areas.\n\nWhat a nice place this was. We called in at lunch time. Friendly, helpful staff. The place was lean and tidy. \n\nNice place to visit.\n\nAnother old property repurposed. Well done Wetherspoons.", "stars": 5}
{"review": "Simple evening out, for a beer or three and a bite to eat. Service fast. Food better than I remember. Staff 10/10. Great night", "stars": 5}
{"review": "Just popped in for a quick drink on a Friday evening.\nTables cleared of plates etc very quickly and all clean despite being really busy. \nWill be back soon.", "stars": 4}
{"review": "The service was good and the food was the usual standard but the pub was not the cleanest.  Maybe it was like this due to the football", "stars": 3}
{"review": "Genuinely shocked by the astonishingly poor attitude of certain staff members. The man serving us was extremely rude without provocation. I don’t know how he could get away with treating customers like that. Will never go again.", "stars": 1}
{"review": "Whether you love it or not, most of the time Wetherspoons give value for money and this was no exception.\nBit disappointed that none of the breakfast muffins were available.", "stars": 3}
{"review": "The security here are another level of stupid, dont listen to a word you say and kick you out even if you follow what they say.\nNothing good about this place if i have one life lesson for you, do not go here i promise...", "stars": 1}
{"review": "Ngl Connor was an absolute legend. He knew all the bangers and was kind and new all the bangers. Impy pales in comparison to this service. \n\nThey apologised for id ing us like wtf? Great service and impey should learn a big lesson from this....", "stars": 5}
{"review": "When I arrived there was a q to get in which with covid you expect but the bouncer with on the door was enjoying his moment of power smirking as he told people they could not come in while all the time ogling the young...", "stars": 1}
{"review": "Waited in que for over half an hour only to be told by 20 year old manager that because someone I knew had previously been bared I was bared by association! I personally have never been bared or caused any trouble. I’m 61 for gods...", "stars": 1}
{"review": "First impressions were dirty tables...we picked the cleanest free one but not once did we see anybody wiping tables down.\nFood was cheap, adequate and service was pleasant but wouldn't really recommend or return. On a positive it is a great building.", "stars": 3}
{"review": "Absolutely disgusted by what I’ve seen at your establishment this evening. Whilst queuing for entry w group of boys in front of us in a group of 5 were told they were not allowed to queue and asked to move on. When they calmly asked...", "stars": 1}
{"review": "Avoid if you want for drinks served in clean glasses. Don’t bother complaining, they’ll just lie to you and tell you it’s ‘watermarks’ they obviously can’t admit the glass washing machines are shoddy and don’t clean glasses properly.", "stars": 1}
{"review": "We arrived as a group of 6, and there were no tables available. We were happy to wait but the bouncers were trying to make us leave. We suggested sitting on two separate tables, which they were fine with for a bit, until the bald...", "stars": 1}
{"review": "I came to George's meeting place for some lunch with my mum and kids like we do every Monday. Ordered the food and on one of the meals I asked for it to not have something in it as I cant eat it. It came...", "stars": 1}
{"review": "This was a great Wetherspoons; the pub is great inside and the staff were really friendly and nice. The only downside was there was no real ale/draught beers available due to a 'technical fault' for the whole of our stay. Hence only 4 out of...", "stars": 4}
{"review": "Called into Weatherspoons for breakfast on a Saturday and Sunday as the hotel we were staying at weren't serving breakfasts. Service was good and staff friendly. When the food came the portions of beans on the cooked breakfast was terrible about the size of a...", "stars": 2}
{"review": "We turned up on spec last night, so had a short wait but it was worth it. Food as with most Weatherspoons (have had the odd one that was below par) was good. The building itself was worth the visit just to see the stained...", "stars": 5}
{"review": "As with many Wetherspoons that are ex churches, cinemas or theatres, This one is an ex chapel, complete with a magnificent pulpit. several seating areas, including balconies, main hall and two garden areas. service is very good and tables and cleared and sanitised 'religiously'. Usual...", "stars": 4}
{"review": "Called into one of the nicer spoons pubs in Exeter- George’s Meeting House. It has a quieter atmosphere and a nice seating area outside for the warmer months. You can even go upstairs to sit and watch the world go by from the first floor...", "stars": 5}
{"review": "I have eaten at George's Meeting House a few times before. It's an unusual Wetherspoons pub with an interesting history in that it was built as a chapel in 1760 and still retains many of its original features.\n\nOn this occasion I visited with a...", "stars": 4}
{"review": "Fantastic transformation of an old Wesleyan chapel, whilst keeping many of the original features.  Great selection of beers, well kept.  Food prepared well and tasted great.  We always pop in when visiting Exeter.", "stars": 4}
{"review": "Went to the Wetherspoons pub in town, George’s Meeting House. Formerly an old school and church this place is full of character and charm. Good cheap beers and ciders and friendly staff - you cant go too far wrong. Upper and lower levels give interesting...", "stars": 5}
{"review": "Fantastic that you can take items off and exchange for others. However, when the breakfast arrived they were very cold (for both breakfasts ordered)", "stars": 3}
{"review": "Nice Wetherspoon, clean and well run.  Nice old building.  I attended a small wedding reception here and used the upper gallery.  Staff very helpful and friendly.", "stars": 5}
{"review": "Decent pint of kronenbourg 64 \nHad a mixed grill which was very nice all in all great for a evening meal and cheap. Would be in there every night if I had stayed in Exeter longer", "stars": 4}
{"review": "Visited today at 12.30 and the venue was very busy. We managed to find some seats upstairs and duly ordered our food. Food eventually arrived at 1.15pm and was luke warm and stoggy. The chips were hard, the fish had been fried to long and...", "stars": 2}
{"review": "Popped in for a couple of nights whilst staying in Exeter and food was ok and beer as good as always and good prices would pop back in next time stay here", "stars": 5}
{"review": "Really a very nice setting to have a bite to eat situated in the centre of Exeter not far from the main shopping area. The breakfasts were very nicely done and arrived promptly. The old fashioned look of the windows and fittings definitely adds to...", "stars": 5}
{"review": "Off a coach tour and wanting a local experience I came across this former church now a bar and restaurant. Large food and beer menu, good prices and friendly service and pleasant staff. I had ribs and chicken combo which was great.", "stars": 4}
{"review": "Two friends and I ventured to Exeter for one of our regular Gentlemen's Liquid Refreshment Perambulations of some of the finer watering holes the town has to offer. Our crawls always start in a Wetherspoons wherever we are, for breakfast of Eggs Benedict and a...", "stars": 4}
{"review": "We arrived at our hotel late so decided to pop over here for our dinner- great manager specials on the food and it was really tasty too- tables were clean and the place was tidy, staff were nice and friendly! Went back for breakfast in...", "stars": 4}
{"review": "Excellent location quick service friendly staff the best wetherspoons i have ever been to. We will go back", "stars": 4}
{"review": "This is a nicely converted chapel house in a central location. Worth a look even if you don't intend to eat or drink there. I would definitely recommend it for breakfast. Ours was excellent: expertly cooked, fresh and hot. Great value too and better than...", "stars": 4}
{"review": "Ate in The Meeting Rooms, a converted chapel house, three times during the week and had a good meal each time of a standard i'd expect. Couldn't fault it and the changing range of cheaply priced guest beers offered plenty of choice. Friday evening was...", "stars": 4}
{"review": "An unusual building well worth a look inside as it was a former church. However my burger arrived cold though the chips were piping hot. Such a disappointment as Wetherspoons are usually good.  Recommended to visit but not to eat.", "stars": 3}
{"review": "Popped in for a couple of drinks in the the evening and to be honest was pleasantly surprised we the way the place looked, usual fare from this type of establishment but the ale was decent and my wife enjoyed her drink and I have...", "stars": 4}
{"review": "An impressive place inside. We sat in one of the galleries - much quieter than downstairs. They also have a pleasant garden. Standard food and good drinks at great prices. Staff were good and kept tables clear and clean, even on a Saturday evening -...", "stars": 4}
{"review": "Obviously a converted building it is a very open and high interior - a concert hall not a pub.\nStill it works and imho looks great.\nThis is a JD Wetherspoon chain pub, so the prices are good, however the quality wasn't great here, which...", "stars": 4}
{"review": "The food and drink is standard Wetherspoons, so decent value. Staff are friendly and the service quick. The building is an old Quaker meeting house, so an interesting setting, a bit different to your usual chain pub", "stars": 4}
{"review": "His Grace while C & C...\n\nThis is a unique pub - a converted church! The openness and wood panels and the stained glass windows and a pulpit gives this pub a dimension that is unique. And it is C & C - cheap and...", "stars": 5}
{"review": "We came in Sunday evening with our three children for a meal, our service at the bar was standard but there was a member of staff on the floor a red haired girl who brought our food over and went the extra mile for extra...", "stars": 5}
{"review": "First day in UK.  Picked up car at Heathrow and drove to Exeter arriving around 11:30AM.  Hungry and as hotel (White Hart) restaurant wasn't open  yet we walked across the street to this establishment. Had a \"full English\" breakfast.  Not best I've had but for...", "stars": 4}
{"review": "Busy pub with lots of available tables. We were in a rush so ordered at our table on the app and the food arrived so quickly. Good sized portions and all well cooked and tasty. Very good prices and nice atmosphere.", "stars": 4}
{"review": "Beautiful old chapel building with stained glass window. We were only there for coffee and went upstairs to the balcony seating. Would like to return for lunch one day.", "stars": 4}
{"review": "We had breakfast twice and dinner here because it’s just an excellent establishment! It’s good value, fast service, clean and super tasty! \nI was so busy eating my dinner that I didn’t bother taking a picture but definitely 100% recommended! \nIf I go back to...", "stars": 5}
{"review": "Was very busy but managed to get a table, very quick service and food was good.\nFriendly helpful staff. Good lication, would recommend.", "stars": 4}
{"review": "This place is extremely popular but the staff seem to cope quite well. The food is good (if mass produced) and because it is so busy I like the idea of being able to order/pay by App. They can be a bit slow at clearing...", "stars": 4}
{"review": "I retired recently and decided to go for a meal and drinks with colleagues after work.  It's a very popular venue, we got there at 6.30pm.  Five of us found a table and ordered drinks and meals via the Wetherspoon app.  I had a steak...", "stars": 4}
{"review": "A converted chapel with high ceiling and stained glass serving honest grub and beer. This is a traditional formula and Wetherspoon does it well. Even better, George’s is open all day, the food arrives promptly, and you depart satisfied and without feeling you overpaid.\n\nWhen...", "stars": 4}
{"review": "This is a pretty typical Wetherspoons. A stunning building converted to highlight the history and features, in this case of a chapel. Cheap food and drink. Pretty good cask ale, but understaffed so that waiting times at the bar were longer than I would have...", "stars": 4}
{"review": "We were staying in Airbnb nearby where breakfast wasn’t included, so we came to George’s Meeting Place (our former local when we lived in Exeter). We’ve had Wetherspoons breakfasts before, so we know they’re good value for money. \nI had the traditional breakfast and my...", "stars": 5}
{"review": "Nice Wetherspoon  conversion serving good drinks . Great that they have left quite a lot of original features. Didn't  have meals but looked typical fayre. Good position in city centre not far from cathedral.", "stars": 3}
{"review": "We stayed in the white heart hotel opposite and didnt know this was here as we got to the hotel late. Wish we had known as our hotel food was rubbish. Had breakfast and lunch here before heading home. Staff very friendly and food was...", "stars": 5}
{"review": "Called here for some drinks during a shirt visit to Exeter. Nice Guinness and other draught beers.\nFollowed up by returning next morning for breakfast. Really tasty good value for money.", "stars": 4}
{"review": "Visited the establishment on Saturday the 26th of January where it was relatively quiet for a Saturday night, plenty of places to sit with the bar being relatively busy. However, when queuing at the bar it become quite clear they were understaffed with only 3...", "stars": 1}
{"review": "This is a tastefully renovated chapel which is spacious. It is on the edge of the main shopping area in the city and was much quieter than the high street cafes. There is only one coffee machine and this soon meant that people had to...", "stars": 4}
{"review": "We popped into this Wetherspoons on a recent trip to Exeter. The service and food were both reasonable in this former converted church. The roaring fire was a nice feature but the venue appeared quite worn and it could do with a refresh. It also...", "stars": 3}
{"review": "Called in here on Saturday morning\nI had the eggs 🥚 Benedict with toast absolutely fantastic for afters I had icream with jelly", "stars": 5}
{"review": "We visited this pub twice during our stay in Exeter. The 1st time was a Wednesday evening. The pub was fairly quiet and we had a peaceful meal. The food came quickly & was very good. We loved the original features kept from the church...", "stars": 4}
{"review": "Visted for a family meal, ordered via app which was easy food arrived quickly, my husband had steak which was cooked perfectly. Childrens meals looked nice unfortunately my son managed to topple his plate full of food onto the floor when i infored a member...", "stars": 4}
{"review": "Always fairly busy, good an drink good value. Decor getting tired now, it's been a few years since it opened and the furniture is tatty, as are the floor coverings. Surprising really. I'm sure it's on the 'to do' list!", "stars": 3}
{"review": "I visited this place as it was recommended to me for their breakfast menu.   I visited this place on a Sunday morning and the place was a hive of activity with people having their breakfast. I had the full English breakfast and it was delicious....", "stars": 5}
{"review": "They previously had a rather nice snug area with an open fire and armchairs, this area was always very popular with locals and groups that gathered for a chat.\nReplacing these furnishings with tables and chairs has reduced the ambience to that of a downmarket...", "stars": 2}
{"review": "Typical Wetherspoons.\nLovely old building. Good choice of food and beer.\nFriendly staff here and will visit again", "stars": 4}
{"review": "Well you know what you get with Wetherspoons! This is a converted church and has some character but can be very noisy. Opposite the White Hart which is quieter!", "stars": 4}
{"review": "Great value food served in comfortable surroundings! \n\nService was very quick too both for drinks and for food! \n\nSpot on", "stars": 5}
{"review": "George's Meeting House is one of the more unusual pubs in the Wetherspoons chain, who have operated the pub since 2005. I have visited this pub several times on my travels for work, it's a nice and airy pub to enjoy a good value meal...", "stars": 4}
{"review": "Visited this pub prior to the Exeter rugby match v Leicester , nice converted chapel and staff friendly , beer good and had a steak ciabatta with chips which was nice, as you’d expect from Wetherspoons very good value for money", "stars": 4}
{"review": "Staying in a hotel around the corner. Wanted something to eat for reasonable Money so came here. We all had a good meal and service was very good. Thanks again.", "stars": 5}
{"review": "Who wouldn't want to see a church transformed into a pub? Being also a Wetherspoons, it is not expensive, but the food is what you pay for. Not quite excellent but a good choice anyway.", "stars": 4}
{"review": "What a fantastic building this is being an old chapel. You walk through the door to be greeted with the most fantastic stained glass windows. Great garden to the side. The food was good and served quickly. Good all round building well worth visiting.", "stars": 5}
{"review": "Firstly, you have to bear in mind this is a Wetherspoons and you get what you pay for. The food is cheap and cheerful - great value and always good but don't expect haute cuisine!\nWe spent an afternoon here taking full advantage of the...", "stars": 4}
{"review": "Polite staff and a lovely converted church, typical Spooner grub, drinks good as was the chicken burger.", "stars": 4}
{"review": "No beer on tap due to  no gas shortage of gas .so hance the poor mark but usually very good on food and real ale can be very busy weekend s , also a good garden at the side of building .worth a visit", "stars": 4}
{"review": "Based in a very cool and quirky old Chapel, the main bar is in the big hall, complete with altar and upstairs seating around the hall. Staff very friendly and happy. Food is what it is, tasty and good value. Two paninis, chips and a...", "stars": 4}
{"review": "Best beer selection in town.\nThe interior is quite special as it used to be a church. During the day, the windows provide heavenly light, at night, you can imagine something else (different movies spring to mind...).", "stars": 5}
{"review": "Another good Wetherspoons in Exeter. Fairly small, a tastefully converted chapel.\nThe curry we had was served promptly, very tasty and a superb price.\nAll the staff we met, waitresses and bar staff were all friendly and efficient.\nUsual great choice of beer too.\nWell...", "stars": 5}
{"review": "We had a drink here on a Sunday, early evening. Service was fine and we liked the historical feel to the pub. It was really hot and so we went into the non smoking garden. You can probably guess that this is where the problems...", "stars": 2}
{"review": "It is always a joy to enter this historic Wetherspoons pub/restaurant. The staff were attentive and friendly, the choices of real ales superb and the food excellent and delivered to the table with little delay.", "stars": 5}
{"review": "Interesting building with high ceilings, giving an atrium feel to the main bar area. Good choice of cheap beers and friendly young staff.", "stars": 4}
{"review": "Have visited a few times over the years and standard of food has remained consistently good and well priced, in common with other Wetherspoon pubs. Although still a fair range, the food menu choices have been reduced since our last visit.\nA good list of...", "stars": 4}
{"review": "Popped in here for a late lunch. Have always loved this building as a pub. Went to the bar to order our drinks and food but when the first drink was served I proceeded to knock it over. I am temporarily suffering from double vision...", "stars": 5}
{"review": "Visited this venue following the St Georges parade and to celebrate a Birthday. Prompt service although quite busy. Good hot simple food. Liked the beverage self service refill system. The building is spectacular with many original features including the pulpit and stain glassed windows.", "stars": 4}
{"review": "Worth a visit to see the interior alone. On a Saturday afternoon the place was packed, but in the best kind of bustling way. A trip to find the Ladies revealed a fabulous glassed in area and beautiful garden. \nThe Ladies is upstairs incidently and...", "stars": 4}
{"review": "One of the serene library-type Wetherspoons. Beyond the big spaces a few almost-hidden reading nooks. Very nice side salad. Fresh. Relatable staff. Does not yet have the plugpoints/usb chargepoints other Wetherspoons have.\n\nLiterally the only negative point is on the less busy upper floors some...", "stars": 4}
{"review": "I wanted a straight scotch whiskey, no mixer, no ice, no water. My wife ordered this. She was served the whisky with ice. She politely informed the barperson that she wanted a straight scotch with no ice. The barperson then walked away in a huff...", "stars": 1}
{"review": "We have a drink and dine here every 2weeks alternating with weatherspoons in Paignton.\nHowever tonight 3of us ordered chicken wings with chips with added spice on the chips,\nWell the Cole slaw was missing from all three plates, plus two plates had 8 chicken...", "stars": 3}
{"review": "Called here a few times during our Recent stay in Exeter and it was a nice atmosphere, as is always at Wetherspoon's.", "stars": 4}
{"review": "Nice veggie breakfast this morning but can someone explain to the chef that a grilled tomato is not just half a fresh and fairly hard tomato placed on a hot plate for a few seconds ........", "stars": 4}
{"review": "Myself and the girls stopped here before going out. The food was as expected as with the price. It was however very busy which once again as expected for the day. Beautiful building and very loud. Would recommend to friends but maybe more for daytime...", "stars": 5}
{"review": "The meeting place is a well preserved chapel with pulpit and stained glass windows. dont go for the food. its embarrassing that they cant serve a hot english breakfast when its not even busy. toast (also cold) was ok. you can have refills of both...", "stars": 2}
{"review": "No problem finding a table. Know by reputation that food and drinks good and reasonable.\nAppeared busy, but no waiting for serving at the bar or ordering food, which appeared on time. Staff: ample numbers, yet not over-conspicuous; attentive to needs and ready to explain...", "stars": 4}
{"review": "Nice venue and great place to have a drink but experience was a shambles\n\nUnorganised staff who ignored me at that bar. \nFood sent to wrong table. \nFood was wrong\nFood was cold \nWaited ages\n\nSay no more...", "stars": 2}
{"review": "A great venue with very pleasant and helpful staff unfortunately however they seem totally incapable of producing an even remotely warm breakfast or toasted toast.\nI have now lost count of how many times that I have had to return it.", "stars": 2}
{"review": "Awful & disgusting experience!! The bar staff was marvellous, brought us our drinks in no time and everything was great!!! The issue arised when the food started being delivered, at this stage almost every item we ordered was on the table except a burguer, one...", "stars": 1}
{"review": "Splendid bulding, friendly and efficient staff, great food.  The eggs royale I'd thoroughly recommend.  All 3excellent value.  And it's very near the centre of town", "stars": 5}
{"review": "We had breakfast and dinner here and they were both up to the usual Wetherspoons high quality. The building itself is interesting and if you sit at one of the tables on the balcony you have a good view.", "stars": 5}
{"review": "looking at the xmas meal, i thought about treating my mum to a turkey meal-deal...whereupon, i was passed a flyer...hmm,...so we went with the flyer...and the manager's special...hmm, turkey roll and mashed potato lol....75p pigs in blankets and 75p stuffing...hmm...last time i get a manager's...", "stars": 4}
{"review": "A very good all round pub. Always a large range of excellent real ales at a great prices plus consistently good food. It has an ok atmosphere but can be noisy in the large open chapel area; out back room is quieter when pub is...", "stars": 3}
{"review": "Ok service. Good choice of beers. Like the location near restaurants. Not much cleaning up going on, menus all over the place and dirty tables.", "stars": 3}
{"review": "First time I've been here,but it won't be the last,when I'm in the area!\nThe building is great,an interesting conversion.\nThe service was good, with a good choice on the hand pumps.\nI enjoyed the choice of seating,and sat upstairs to watch the world go...", "stars": 4}
{"review": "A very typical menu and choice of offerings.\nA good range of beers on,and service was good.\nWe sat upstairs which was interesting,the only neg being you do go up / down / up again to access the loos..!,being a bit of a trek.\nBut...", "stars": 4}
{"review": "I tried the christmas meal which was turkey. One word it was terrible!! It arrived with the gravy boat sat in the meal in gravy. The turkey was circular? Mash, about 4 chopped slices of carrot and peas. The turkey was cold and frozen in...", "stars": 1}
{"review": "Fantastic evening, Matt the team leader had some great drink suggestions, and really made the evening - thanks!", "stars": 5}
{"review": "I came here to have a drink in the late afternoon, The best thing of this place is the location, which is an ex church. This makes the place interesting. Good drinks and nice stay. Advised.", "stars": 4}
{"review": "Nice little pub with plenty of indoor and outdoor seating. \nCan get very busy but usually there is space to sit down. \nGood for coffee and cake as well as brekkie and lunch. \n\nStaff are good but it can get very busy and hectic.", "stars": 4}
{"review": "Great for cheap eats - typical Wetherspoons - service usually great and great beer choices!  We eat here often and always happy with it.", "stars": 4}
{"review": "Called in for lunch with friends. Main reason was our combined experiences from visits in other towns and cities. As usual good price for the food and drink. Situated in what I think is an old Methodist chapel the place is huge. Several different sitting...", "stars": 4}
{"review": "We were so impressed after having a delicious curry for dinner that we went the next morning for breakfast. We both ordered the Eggs Royal. When they arrived they looked delicious and the time it took to arrive should have guaranteed eggs poached to order...", "stars": 1}
{"review": "You know what you going to get with Wetherspoon's. George's Meeting House has lots of space and a nice atmosphere close to the centre of the town.", "stars": 4}
{"review": "Not been here for a while. Visited during the early evening. Always plenty of room and nearly always able to find a table. Good service. Fantastic selection of beers. Have eaten here but today only here for the beer", "stars": 4}
{"review": "We went here with family,  three adults and four children. Several tables were pushed together to seat us. Crayons etc. soon appeared as did childrens' menus. Food very good, quickly served, very friendly staff  and a varied selection of drinks soon dispensed. All in all...", "stars": 4}
{"review": "Being a Wetherspoons can be fairly sure of what you will get and this one of better ones with added novelty of being set in old church complete with many original features, including pulpit and upper gallery. Often eat here when visiting Exeter and would...", "stars": 4}
{"review": "I had my usual Monday meal of Wiltshire ham, eggs & chips with real ale but this time I was in what I think is my favourite Wetherspoons. How wonderful that such a charming building has been given a new lease of life. The interior...", "stars": 4}
{"review": "It's a pub in a church - well, a former Unitarian chapel to be precise. But it still has some of the old fittings, including the pulpit! Very atmospheric, lots of tables so always going to get a seat even when it's busy. Came for...", "stars": 5}
{"review": "Waitress (sorry I can’t remember her name) was absolutely amazing! So chatty and friendly! Amazing atmosphere + food!", "stars": 5}
{"review": "We visited for valentines, the restaurant was extremely busy due to numerous other couples as well as several birthday groups. Although we were seated immediately we were advised straight away that there was a bit of a wait on food, luckily we were in no...", "stars": 5}
{"review": "Avoid. Seriously bad meal. Ordered meatballs. They were rock hard and hardly any sauce. Could hardly eat the meal. How can you get a basic dish so wrong. Won’t be returning.", "stars": 2}
{"review": "We visited for a birthday party on Thursday.\nMost of our party are either deaf or hard of hearing. The staff wer very accommodating and even went out of their way to learn how to sign Happy Birthday!!\nThank you!!", "stars": 5}
{"review": "Upon arrival we was seated quickly, drinks order took and served, brilliant! Ordered our food and over an hour later it arrived. The pizza and garlic bread was barely cooked but editable (just). My daughter is a fussy eater so we ordered her wrap plain...", "stars": 1}
{"review": "We called up last night after 9pm for a table for 4 and Timmy was very friendly and accommodated us straight away.food was very quick and tasty.i believe Nikky was the other lady behind the bar she made us lovely cocktails.she was funny and very...", "stars": 5}
{"review": "Had a meal in the week on a visit to Exeter for a gig and was met with a warm welcome and service throughout. \n\nWe had a member of staff in training serving us alongside Nicole and they were both so friendly and accommodating. The...", "stars": 4}
{"review": "We had lunch at Frankie & Bennys during the week. Very warm welcome by the serving staff with a couple of the team being trained as they are new. Staff very helpful and try extremely hard to make sure that your meal is a great...", "stars": 5}
{"review": "Our server, Nicole, was very welcoming and made our experience at Frankie and Bennys memorable. There were lots of vegan options on the menu and the food was amazing. We will be definitely coming back more often. To top it off Nicole’s marge Simpsons impression...", "stars": 5}
{"review": "Very disappointed with the meal after having waited over an hour. Was provided with a free second round of drinks as an apology for the delay but the meals were lukewarm, bread roll past its best, steak on the ceasar salad was over cooked and...", "stars": 2}
{"review": "Awful experience.   Had our starter, then waited 45 minutes for our main.  Husbands chicken burger overcooked,  my bolognese cold and obviously microwaved as the middle was slightly warm.  The pasta was stodgy and stuck together.  Ordered 2 coffee's which were luke warm! .....total bill was...", "stars": 1}
{"review": "we came to eat at lunchtime , had hotdogs which were ok then puddings, my Husbands waffle was stone cold sent it back when it arrived back the waitress said it was because the kitchen was cold ! yeah ok \nmeant to have cream and...", "stars": 3}
{"review": "We popped in for a quick spot of food, and the lovely waitress Nicole made our time here amazing. Very lovely to talk to and makes easy conversation, made us laugh and made us feel very welcome. Food was amazing and got to try the...", "stars": 5}
{"review": "We went as a family of 5 on Thursday. well all i can say is i never eaten such cheap over priced food in my life. The chips were luke warm at the best, burger had been cooked for hours by the look of it....", "stars": 1}
{"review": "We went for my daughters birthday as she wanted macaroni cheese as it’s her favourite meal. Both kids pastas came out cold, they redid them but still weren’t warm all the way through. I also had macaroni cheese, it tasted like tinned macaroni with some...", "stars": 1}
{"review": "Visited the Alphington branch yesterday evening with a party of 8 to celebrate an 18th birthday.  We notified the waitress we didn't have allergies but were all vegan. Everything was double checked when placing the order. When the vegan bbq ribz came I questioned whether...", "stars": 1}
{"review": "I celebrated my birthday there, the staff worked very slowly and was rude. They brought dirty prosecco glasses, and when I asked him to change them, he made a disgusted face, no sorry, nothing. I don't think I will visit them again.", "stars": 2}
{"review": "We were served by Katie, food was very nice and Katie was very good. She was kind and funny and made the ordering experience more fun and joined in with the banter. She’s a credit to your team.", "stars": 5}
{"review": "Shocking. Just really bad. Half the starters came, other half 10 mins later. Waited 40 mins for mains and again half came other half 10 mins later.\n\nFood is bland and luke warm. Went for my daughters birthday, just appalling.", "stars": 1}
{"review": "just don’t go here and don’t get delivery. food was bland, chips were not cooked, and had to wait over 20 minutes after due time for pick up, and the restaurant only had a few tables with customers. don’t waste your money.", "stars": 1}
{"review": "Would definitely reccomend. Food was amazing and the staff were so friendly. Very helpful and attentive especially with allergies. Great gluten free options. Would 100% recommend.", "stars": 5}
{"review": "Absolutely horrendous\n\nFather’s Day meal. Everything was cold all had to be sent back. I went to the hatch where the cooks pass the plates to the waitresses and there is an aircon blower right above the gantry. The waitress took our meals back but...", "stars": 1}
{"review": "Myself, my friend and her little baby visited Frankie and Bennies for late lunch.\nThe food was not great considering such a high price to pay.\nMy friend had the Chicken with spaghetti and fries.\nThe fries were stale, the chicken was overcooked.\nMyself had...", "stars": 3}
{"review": "Delicious food excellent service and our server Nicole was amazing made our evening excellent definitely returning", "stars": 5}
{"review": "We went to the restaurant by chance. We had great starters and a great main courses staff are a 10/10 and great atmosphere in the whole restaurant. We will be coming back very soon.", "stars": 5}
{"review": "great place. Had a lovely time there. The chips, oh the chips. They were great, no not great... they were glorious. I will go again for more of them. LOVED IT. Would rate 10 if I could.", "stars": 5}
{"review": "We visited  on Saturday evening with our daughter who has coeliac disease and she was looked after and catered for brilliantly, when I was asking questions about the food prep and cross contamination I was really pleased with the knowledge of the staff,  she enjoyed...", "stars": 5}
{"review": "Delivering 5/2/22 in the evening for Uber eats, absolutely  disgusted by the way the employee spoke to me. 20 minutes gone by waiting at the delivery door, the employees looked at me whilst I was stood outside with my order number. I had another delivery...", "stars": 1}
{"review": "Excellent food and service for boy's birthday party. Brooke was brilliant and would recommend this venue (and Brooke) for for future birthday parties.", "stars": 5}
{"review": "Lovely meal served by American waitress called Nicole \nVery attentive,  cold iced water served with meal sauces put on table bbq chicken  was very nice \nHusband had burger he enjoyed it \n meals were tasty. Did not have dessert full up.", "stars": 5}
{"review": "Not been for a while due to previous less than impressive experience so took a gamble and things have definitely improved! We hadn’t booked but after a short wait in the bar they found us a table even though it was mega busy. Food was...", "stars": 5}
{"review": "Was made really welcome by Nicole and was served efficiently and with humour. Nothing was too much trouble and she was very patient while we were spoilt for choice with the menu.", "stars": 5}
{"review": "Went for a last minute dinner with my fiancé and frankies & bennies did not disappoint, amazing food & service, we were looked after by Nicole (American lady) and she always serves with a smile and made sure we were well looked after, thank you...", "stars": 5}
{"review": "Don't ask for soft drinks, there policy apparently is to fill the glass with ice and give you very little soft drink as possible. Half a pint? 2 sips! Pint? Same glass, just filled to the rim and you get 3 sips! \nComplained, got told...", "stars": 1}
{"review": "We visited this restaurant Monday evening, the alarm bells should've started ringing when we entered the restaurant and was 90% empty. We went there for my daughter birthday, what a mistake that was. Majority of the food we all wanted was not available and we...", "stars": 1}
{"review": "My partner and I visited this restaurant as a very last minute thing. We were delighted with the food, the atmosphere and the service thank you", "stars": 5}
{"review": "Arrived to a friendly welcome, lovely environment generally and great music all night. Food was excellent and even with our large table everyone's meals came at same time. Kids got loads of attention and despite being busy both our servers Brooke and Timmy were attentive...", "stars": 5}
{"review": "We ventured to this frankie and bennies from our holiday in Torquay and I have to say it was the best f and b’s we’ve had. The food was perfect and Nicole was the perfect t host/ attentive and made us feel that  nothing was...", "stars": 5}
{"review": "Ordered F & B through Deliveroo. The order took over 2 hours to arrives. I rang F&B to see if they could advise if they knew what was happening with our order and maybe because it had taken so long that maybe a token gift...", "stars": 1}
{"review": "Went for a dinner to celebrate and Nicole made us feel very welcome from the start, and all the way through, was so nice to see someone so professional and nice, excited to go back again just to have service from Nicole", "stars": 5}
{"review": "Well what else can we say as soon as we walked in yesterday 21/09 we were greeted and sat straight away as soon as we were sat we had someone come over straight away taking our orders, the staff were really nice and were always...", "stars": 5}
{"review": "We ordered 3 tap waters, 2 with ice, simple you'd think, apparently not!! We received one glass of water with ice, then when they tried to correct it, we got 3 glasses of water and a jug of ice!! 🤣\n\nWe enquired where our food...", "stars": 2}
{"review": "Just back from an extremely disappointing meal at Exeter Frankie and Bennys…\nWhere do I start? Well for starters, they were out of both the options my partner and I wanted as well as orange juice. Secondly, our food took over 45 minutes to arrive...", "stars": 1}
{"review": "Not a great experience, restaurant wasn’t that busy. Starters came reasonably quickly but we then waited 55 minutes for mains. Was told this was because the system automatically prioritises the online orders. Not the best way to run a restaurant when you have paying customers...", "stars": 2}
{"review": "I am just so sorry to be writing this so late after our visit for our friends birthday on the 6th June. Nicole was just utterly brilliant and made the whole experience so easy and pleasant as our friend is coeliac. At first our choices...", "stars": 5}
{"review": "My mother and daughter was impressed with the vegetarian options, I found the steak tough and the peppercorn sauce was vile, I thought service was slow, I think the meals were overpriced", "stars": 3}
{"review": "Not been to F&B for years after so many bad experiences. \n\nTried this branch out for first time after a day out. Got a table for 10 with no fuss, Served for drinks efficiently and Nicola, our waitress, was great with the kids and us....", "stars": 5}
{"review": "Stopped last minute with our young children to break our journey back to Cornwall, was just expecting a quick meal, but our waitress Nicola made it such a lovely experience, we all loved her! Such a character and very attentive, the food was delicious too...", "stars": 5}
{"review": "Thankyou G and team, and the girl who joined later on (never caught your name) You were all amazing tonight, amazing service and the food was amazing just too big portions (which is never a bad thing). From Lydia and Danielle from the stars x", "stars": 5}
{"review": "Had a lovely meal tonight and highly rate the service, we were served by a fab waitress Alisha who is very attentive and friendly! Considering she was the only waitress working, she was always checking up on everyone! Such a shame to know she will...", "stars": 5}
{"review": "We recently visited Frankie and Benny's in Exeter for my son's 8th birthday.\nWe were running late due to traffic and we had another appointment so we were short on time. I explained this to Nicole and she was great! Our food arrived quickly, she...", "stars": 5}
{"review": "Had a fantastic birthday meal with the family on a busy Saturday evening. The food was lovely and delicious and the service from Nicole was excellent. She was an absolute delight who was warming and easy to talk to and even sorted me out with...", "stars": 5}
{"review": "Lovely food, great atmosphere and best of all.. our wonderful server Nicole was amazing. She really made our grandkids night and birthday special. One of our kids is diabetic and they went above and beyond to assist with carb counting/weights etc... Thanks Nicole.. you are...", "stars": 5}
{"review": "Just back from an amazing trip to Frankie Benny’s Exeter. We were served by Nicole, she was  absolutely amazing. Made us feel so comfortable and had a brilliant sense of humour. As well as this the food was lovely. Will definitely be returning😊", "stars": 5}
{"review": "Delicious food and amazing service! New York BBQ Chicken & Ribs is my favourite and it is absolutely worth the price. Also, the staff is very friendly and helpful. I will come back to this restaurant again for sure.", "stars": 5}
{"review": "Popped into Exeter, outside dining was great. Served by Molly, very friendly. Can't wait to visit again.", "stars": 5}
{"review": "I needed a bite to eat and got an awesome chicken burger from the ‘stacks’ takeaway menu here through Just Eat. Happy:)))", "stars": 5}
{"review": "I Arrived for dinner after a long drive to exeter with my daughter. Food was great came out quickly and tasted fresh. Waitress brook was very friendly and helpful will be returning hopefully to eat in soon.", "stars": 5}
{"review": "Came to exeter with Friends today to done out. Great menu. Server Molly was great! will be returning!", "stars": 5}
{"review": "Had to write a review about the takeaway I had today! Out of all the takeaways I’ve tried through lockdown this was the best by far! Hot, fresh and great portions. Really happy 😃.", "stars": 5}
{"review": "Served by Dan today. Nothing was too much for him. very attentive. will return. food waa great so thanks to the chefs", "stars": 5}
{"review": "Had a lovely meal - which was made even nicer by our amazing waitress Nicole - she’s was kind, friendly, welcoming, helpful, chatty and she made us chuckle which was just what we needed 😊", "stars": 5}
{"review": "Nicole was really helpful and offered great service. The range of food available for our daughter with multiple allergies was excellent and easy to find the info we needed. Food was good and we felt really safe with all the new systems that had been...", "stars": 5}
{"review": "EXCELLENT service Jess our servers customer service was exceptional she helped us sort our app the food was great", "stars": 5}
{"review": "Me and my partner visited for an evening meal, they were super busy but our server Nicole kept coming back to check on us and letting us know our food wouldn’t be long! She’s was super friendly and made out visit super enjoyable", "stars": 5}
{"review": "Food was really good with a great childrens menu. Brilliant table service from Dan and he was amazing with my 5 year old Niece she cant wait to go back. I would definitely recommend to friends.", "stars": 5}
{"review": "Popped in on the off chance, was abit hesitant after visiting another frankies & Bennys previously & not having a good experience. But we were seated quickly! Ordered our food. What made it for us was our waitress Nicole she was so lovely and definitely...", "stars": 5}
{"review": "Fantastic food I haven't tasted a pizza that good for ages and the burger was extremely juice\nThe staff are extremely helpful and respectful \nThe atmosphere is lovely \nThe lunch menu was fantastic and good value for money", "stars": 5}
{"review": "We visited today on our way to Cornwall for lunch. Food was great service amazing especially a lady called Nic who was American. Had a lovely conversation with Nic she was very friendly and remembered our names ( which made us feel very welcome) Would...", "stars": 5}
{"review": "Visited this evening as a treat for my daughter. We had a really nice welcome from our server, I forgot to grab her name. COVID regulations were explained clearly and friendly as we were seated. Our meals came out within a reasonable time and was...", "stars": 5}
{"review": "1. Served plates at the table with garlic sauce missing from the dough balls... No sauce offered and no onion rings with the hunters chicken as ordered\n \n2. In reply to No1 be told us the man at the front (manager) should have told us...", "stars": 3}
{"review": "My husband and I and my little boy (7yrs) had a late lunch. We had a warm and friendly welcome from Nicole, who was our waitress throughout. Excellent service & food", "stars": 5}
{"review": "Great social distancing with clear signs, the time was taken to explain how to get around the restaurant. \n\nFood was great - especially the desserts. Our waitress was great, especially when I managed to spill my drink over myself! She was really helpful and didn’t...", "stars": 5}
{"review": "It’s Good to be Back. Great food, great staff, recommended to all. Special thanks to our fantastic waitress Nicole.", "stars": 5}
{"review": "We had a fully vegan 3 courses here today. It was excellent. The first really good vegan selection of courses - garlic bread with vegan mozzarella, Mediterranean lasagne and chocamisu - really the best restaurant vegan food it has been my fortune to taste. Highly...", "stars": 5}
{"review": "Had a really love meal here on the 28/7/2020, they’d only been open a couple of days but I think the staff really handled ‘the new normal’ with great professionalism. Our server, Nicole, was so friendly and accommodating; she really made our trip memorable. The...", "stars": 4}
{"review": "The atmosphere was great. Our food was served quickly and cooked to perfection, but what really made it was a staff member named Casey. Her customer service was excellent!", "stars": 5}
{"review": "We are a family of 4, and we visited to celebrate my sons birthday. We ordered 2 pizzas and 2 burgers between us, which were served remarkably quickly and tasted delicious! I was especially grateful for our server Renata, who helped me with my weird...", "stars": 5}
{"review": "Fabulous lunch. I had the meatballs, mum had the salmon, followed by the lemon tart and mint choc sundae. All of the food was delicious and the customer service from Renata was top notch, especially when she added birthday candles to both of our desserts...", "stars": 5}
{"review": "We visited on a very busy day during the half term holidays. We were warned there would be a wait which was understandable, so sat back and watched the restaurant. I used to waitress, and understand how tricky it can be but Jess was a...", "stars": 3}
{"review": "Jess was our waitress. We asked for her as she has been amazing on a previous visit. She was again, very attentive and looked after us. Once we were seated, we, were disappointed to be told that a few items, ie, coleslaw, sweet potato fries,...", "stars": 4}
{"review": "Not often I leave reviews. However Jess was brilliant. Friendly without being familiar. Checked if we needed anything without being an inconvenient irritant. Literally checked to see if we had finished and could take any empties, or ask if we needed more drink at the...", "stars": 5}
{"review": "Dan our waiter was as much use as a chocolate fire guard. Food was average if that. The only good thing was the manager.", "stars": 2}
{"review": "Got seated ok ordered our food have to say waitress was not very happy and just going through the motion, when the food. Some mine was burnt and still served to me , when I complained she said oh yes I’ll replace it , then...", "stars": 2}
{"review": "Very nice food and excellent service.... very accommodating with my one year old son will definitely come again! Calamari starter is amazing and mixed grill is definitely worth the price!! What’s better is they except the Taste card! Every little helps when your a family", "stars": 5}
{"review": "Great frankie and Benny's lovely food very friendly staff.. Need to book priar to coming at the weekend if you want a table or the could turn you away....  Carpal outside a bit hectic as you have other food outlets on site overall ⭐⭐⭐⭐", "stars": 5}
{"review": "Waited over an hour for food, within that time no one checked on us to other more drink or see if we were ok. Staff were polite at least but, weren’t paying much attention to customers.", "stars": 1}
{"review": "Everyone enjoyed their meals which was a treat for 7 people on a birthday outing, food was pasta , pitza, burgers, steak and ribs , followed by various deserts and coffee. Pasta was far too hot and a bit claggy but otherwise  Ok. Bit overpriced,...", "stars": 4}
{"review": "We stopped off for an evening meal on our way home and were really pleased with the  whole experience.\nThe staff were very friendly and efficient with serving us.\nThe food was excellent and we will return in the future.", "stars": 5}
{"review": "Waited over an hour for our food, no update given. No offer of further drinks.\nFood was VERY poor considering the cost. My friend had the gluten free carbonna which was £10. Portion was tiny and something you could have knocked up at home for...", "stars": 2}
{"review": "Food was ok but service left more to be desired as our waitress (who didn’t tell us her name) when delivering us our food near enough-shoved any meal that I had ordered into to my brothers face and to be honest I didn’t want to...", "stars": 2}
{"review": "Never been before what an amazing please fantastic food and great music our waiter was very nice and very friendly his name was (paul) was a great way to spend our night before travelling back down to Cornwall.", "stars": 5}
{"review": "Jess was very friendly and nice. One of The best team members. Exeter branch is very good and food is really teasty. We ll come back here again", "stars": 5}
{"review": "Came here for the first time a few weeks ago and have been coming more frequently to the point we actually just went 2 days in a row! Food is absolutely unbeatable and music is always on point banger after banger! Always receive such great...", "stars": 5}
{"review": "Visiting quite awhile ago now but have yet to write the review. Visited for my mums birthday breakfast with my family .\nMy 7 year old nephew however is severely autistic and had what I can only describe as a full Meltdown in the restaurant,...", "stars": 5}
{"review": "Have just left this restaurant for my grandsons 7th birthday, table booked for 5pm not busy when we got there but we still didn’t get our dinner till 6.20. It was not good, two of us had burgers that got dished up to us cold,...", "stars": 1}
{"review": "Came as a couple last week, it was my first time there, lovely and clean tables, waitress was young, smiley and very polite, the service was incredible, it was a quiet night but I still enjoyed how quickly the food was served and it was...", "stars": 4}
{"review": "We took my dad for his 65th birthday - he’s an old fussy grump but thought it would be worth a try.\n\nThe food was lush, atmosphere was just right and Renata our waitress made my dads day, she knew he didn’t want the birthday...", "stars": 5}
{"review": "Staff are brilliant how ever the portions of the children meals are shocking and this was supposed to be the child’s big plate at the cost of £8 I’d expect more £8 never again", "stars": 2}
{"review": "Perfect service perfectly cooked food. Staff were very friendly and nice. Apparently short staffed as well so really can’t be faulted", "stars": 5}
{"review": "I say surprisingly because I am not a fan of dressed up American eating places. So, here we are on our second visit in 3 weeks! We specifically asked for Renáta as the level of service she gave to us was superb and really made...", "stars": 5}
{"review": "Came here for the first time last night although my kids have been before. Great atmosphere and nice feel to the place, delicious food but maybe we could have a bit more?\nMy kids are 9 and 8 and have enormous appetites as I imagine...", "stars": 3}
{"review": "We have visited Frankie&Benny's for a second time to celebrate our daughters birthday. We were served by Renata who was absolutely fantastic,  food arrived quickly and it was delicious. Will definitely return", "stars": 5}
{"review": "Impromptu visit to F&B’s for dinner. Greeted by the front of house with a warm welcome. Renata, our server, did a fantastic job. Very knowledgeable of the menu and efficient service. Answered all our questions and the food was served quickly. Thanks Renata. We’ll be...", "stars": 5}
{"review": "Popped in for an early dinner with the kids, hadn’t booked but were seated straight away. It’s fairly standard food but would expect that for a chain with plenty of choices for the kids. We were served quickly by a friendly chap and the food...", "stars": 4}
{"review": "My family and I decided on a Breakfast treat this morning (Sunday 29/9) we were looked after by Rena’ta.  She was exactly what we needed with two children who couldn’t make up their minds.  Patient, engaging and just the right amount of humour.  The food...", "stars": 4}
{"review": "Popped in and got a free pizza on national Pizza day. Very cool. Server Lydia was fantastic. Will return", "stars": 5}
{"review": "Excellent service by Renata, thank you. We popped in for lunch, good food selection on the menu, quick service.", "stars": 4}
{"review": "The food is very poor quality, dough balls were hard as rocks, sent back and given a replacement and they weren't much better, obviously changed suppliers as they used to be nice rounded dough balls now you can clearly see where they must come in...", "stars": 1}
{"review": "Food order was muddled, the burgers were rock hard... pasta was undercooked and still a bit too crunchy to be al dente. Drinks were really over priced... it was no wonder the place was half empty. After complaining the manager didn’t charge us for the...", "stars": 2}
{"review": "Good food and a great atmosphere. Served by Viking who was an absolute gem. Made our experience lovely. Would done again.", "stars": 5}
{"review": "Decor and music were good , staff were efficient and friendly ... food was ok but average and overpriced for what you got .. typical chain restaurant ... Tried it once .. won't be going back again.", "stars": 3}
{"review": "went for lunch, not busy, food came cold plate (not good) chicken very dry, chips ok & ribs tasty,but food did not keep hot which spoils lunch, young lady very nice, but do not think we will go back.", "stars": 3}
{"review": "Overpriced and very slow service. Party of 12 arrived at 7.15pm and didn't leave until 10.15pm due to long wait for mains. A few had starters but no one had desserts. Waiting staff not particularly helpful or friendly especially the waitress who served the drinks...", "stars": 1}
{"review": "Friday night treat out, a very enjoyable meal, the sticky wings to start were sumptuous, then we had Steak & Fries, and Seared steak on salad, plus we had a bonus the lovely Renata serving us, always with a smile, friendly and always gives time...", "stars": 5}
{"review": "lovely meal and great friendly staff. everytime I go into that restaurant I want renata as my waitress because she is so friendly and makes it an enjoyable experience that I will remember for a long time. :)", "stars": 5}
{"review": "The food was great, the service was quick and friendly. Excellent varied menu, would recommend to anyone.", "stars": 5}
{"review": "Really lovely time. The food was great, our server was polite and helpful. The candle in the dessert for our birthday boy was a lovely touch. Service wasn’t the fastest but that meant we didn’t feel rushed. Used our Meerkat Meal deal so that brought...", "stars": 4}
{"review": "Decided to go for lunch with the kids as we had a voucher. Was expecting it to be busy, especially as it was summer holidays. To our surprise it was very quiet at peak lunchtime Friday.  We were shown to our table, all very normal....", "stars": 3}
{"review": "Absolutely love the food, cant say which is my favourite mains as love it all, but when it comes to desserts it has to be chocolate brownies or maybe the apple pie and custard or cheesecake god its hard.\n\nBut most of all the service,...", "stars": 5}
{"review": "Paid 14 quid for the chicken parmigiana as a main when I could get the same taste from a 50p can of spaghetti hoops from tesco. Chicken was very cheaply done as well. Will not be going back.", "stars": 2}
{"review": "It was a Friday night and looking for somewhere to have a meal to celebrate our anniversary.\nWe arrived at Frankie & Bennys and was greeted by friendly staff who took us straight to our table. The drinks order was taken shortly after, followed by...", "stars": 4}
{"review": "Midweek evening but long wait for all courses. Chicken salad was very poor- soggy and unimaginative. We complained \nand the manager refunded it. Pretty noisy and not a calm environment. Won't rush back.", "stars": 2}
{"review": "I ordered online as my wife has shingles and thought it would be a treat for her. Despite living just 350 yds away for the actual restaurant, the food was freezing cold. Worse than that though, we ordered two types of cheesy garlic bread starter,...", "stars": 1}
{"review": "Decided last minute to come to Frankie's, instead of Toby carvery.\nReally glad we changed our minds. \nFood was lovely atmosphere was great and lovely table service from Megan too. \nMade to feel really welcome.", "stars": 5}
{"review": "Very pleased with the food and lovely service from Renata, friendly feel and welcoming.  Busy with lots of families and birthday celebrations, but food was served quickly and good standard.", "stars": 4}
{"review": "I had a rare date night with my long distance lorry driver husband as he was in Exeter overnight. Having just got my Meerkat Meals app, we decided to go to Frankie & Benny's as the one we visit in Peterborough has always been OK....", "stars": 3}
{"review": "This isn’t the sort of restaurant that my wife and I would normally visit but it was a birthday gift to my wife from her sister.\nOur starter was delicious, meatballs, which we were able to make more spicy. Our main courses were good but...", "stars": 4}
{"review": "Overall a pleasant dinner, there was a nice atmosphere and they had the air conditioning on which was nice to step in to on a hot day. Staff were friendly and attentive enough, though it did take us a little while to get the bill....", "stars": 4}
{"review": "Very pleasant visit today alisha our waitress was fantastic couldn't do enough for us as we have a young child with severe allergies she was fantastic chef was flawless to so helpful and such a welcoming atmosphere thank you so much all", "stars": 5}
{"review": "Myself and partner had been disappointed with the food here at f&b's a few years back. We vould to ourselves we would never return. So as we drive past we though we would give it one last chance after 2 and a bit years surly...", "stars": 1}
{"review": "Popped into here on the off chance whilst close by for lunch. Our waitress was excellent just wish I could remember her name but she was brilliant with my two boys treated them like actual customers. Food was prompt and the kids deal was good...", "stars": 5}
